MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile T8HLTbits_t T8HLTbits __at(0x49D);
// bitfield macros
#define _T8HLT_MODE_POSN                                    0x0
#define _T8HLT_MODE_POSITION                                0x0
#define _T8HLT_MODE_SIZE                                    0x5
#define _T8HLT_MODE_LENGTH                                  0x5
#define _T8HLT_MODE_MASK                                    0x1F
#define _T8HLT_CKSYNC_POSN                                  0x5
#define _T8HLT_CKSYNC_POSITION                              0x5
#define _T8HLT_CKSYNC_SIZE                                  0x1
#define _T8HLT_CKSYNC_LENGTH                                0x1
#define _T8HLT_CKSYNC_MASK                                  0x20
#define _T8HLT_CKPOL_POSN                                   0x6
#define _T8HLT_CKPOL_POSITION                               0x6
#define _T8HLT_CKPOL_SIZE                                   0x1
#define _T8HLT_CKPOL_LENGTH                                 0x1
#define _T8HLT_CKPOL_MASK                                   0x40
#define _T8HLT_PSYNC_POSN                                   0x7
#define _T8HLT_PSYNC_POSITION                               0x7
#define _T8HLT_PSYNC_SIZE                                   0x1
#define _T8HLT_PSYNC_LENGTH                                 0x1
#define _T8HLT_PSYNC_MASK                                   0x80
#define _T8HLT_MODE0_POSN                                   0x0
#define _T8HLT_MODE0_POSITION                               0x0
#define _T8HLT_MODE0_SIZE                                   0x1
#define _T8HLT_MODE0_LENGTH                                 0x1
#define _T8HLT_MODE0_MASK                                   0x1
#define _T8HLT_MODE1_POSN                                   0x1
#define _T8HLT_MODE1_POSITION                               0x1
#define _T8HLT_MODE1_SIZE                                   0x1
#define _T8HLT_MODE1_LENGTH                                 0x1
#define _T8HLT_MODE1_MASK                                   0x2
#define _T8HLT_MODE2_POSN                                   0x2
#define _T8HLT_MODE2_POSITION                               0x2
#define _T8HLT_MODE2_SIZE                                   0x1
#define _T8HLT_MODE2_LENGTH                                 0x1
#define _T8HLT_MODE2_MASK                                   0x4
#define _T8HLT_MODE3_POSN                                   0x3
#define _T8HLT_MODE3_POSITION                               0x3
#define _T8HLT_MODE3_SIZE                                   0x1
#define _T8HLT_MODE3_LENGTH                                 0x1
#define _T8HLT_MODE3_MASK                                   0x8
#define _T8HLT_MODE4_POSN                                   0x4
#define _T8HLT_MODE4_POSITION                               0x4
#define _T8HLT_MODE4_SIZE                                   0x1
#define _T8HLT_MODE4_LENGTH                                 0x1
#define _T8HLT_MODE4_MASK                                   0x10
#define _T8HLT_T8MODE_POSN                                  0x0
#define _T8HLT_T8MODE_POSITION                              0x0
#define _T8HLT_T8MODE_SIZE                                  0x5
#define _T8HLT_T8MODE_LENGTH                                0x5
#define _T8HLT_T8MODE_MASK                                  0x1F
#define _T8HLT_T8CKSYNC_POSN                                0x5
#define _T8HLT_T8CKSYNC_POSITION                            0x5
#define _T8HLT_T8CKSYNC_SIZE                                0x1
#define _T8HLT_T8CKSYNC_LENGTH                              0x1
#define _T8HLT_T8CKSYNC_MASK                                0x20
#define _T8HLT_T8CKPOL_POSN                                 0x6
#define _T8HLT_T8CKPOL_POSITION                             0x6
#define _T8HLT_T8CKPOL_SIZE                                 0x1
#define _T8HLT_T8CKPOL_LENGTH                               0x1
#define _T8HLT_T8CKPOL_MASK                                 0x40
#define _T8HLT_T8PSYNC_POSN                                 0x7
#define _T8HLT_T8PSYNC_POSITION                             0x7
#define _T8HLT_T8PSYNC_SIZE                                 0x1
#define _T8HLT_T8PSYNC_LENGTH                               0x1
#define _T8HLT_T8PSYNC_MASK                                 0x80
#define _T8HLT_T8MODE0_POSN                                 0x0
#define _T8HLT_T8MODE0_POSITION                             0x0
#define _T8HLT_T8MODE0_SIZE                                 0x1
#define _T8HLT_T8MODE0_LENGTH                               0x1
#define _T8HLT_T8MODE0_MASK                                 0x1
#define _T8HLT_T8MODE1_POSN                                 0x1
#define _T8HLT_T8MODE1_POSITION                             0x1
#define _T8HLT_T8MODE1_SIZE                                 0x1
#define _T8HLT_T8MODE1_LENGTH                               0x1
#define _T8HLT_T8MODE1_MASK                                 0x2
#define _T8HLT_T8MODE2_POSN                                 0x2
#define _T8HLT_T8MODE2_POSITION                             0x2
#define _T8HLT_T8MODE2_SIZE                                 0x1
#define _T8HLT_T8MODE2_LENGTH                               0x1
#define _T8HLT_T8MODE2_MASK                                 0x4
#define _T8HLT_T8MODE3_POSN                                 0x3
#define _T8HLT_T8MODE3_POSITION                             0x3
#define _T8HLT_T8MODE3_SIZE                                 0x1
#define _T8HLT_T8MODE3_LENGTH                               0x1
#define _T8HLT_T8MODE3_MASK                                 0x8
#define _T8HLT_T8MODE4_POSN                                 0x4
#define _T8HLT_T8MODE4_POSITION                             0x4
#define _T8HLT_T8MODE4_SIZE                                 0x1
#define _T8HLT_T8MODE4_LENGTH                               0x1
#define _T8HLT_T8MODE4_MASK                                 0x10

// Register: T8CLKCON
#define T8CLKCON T8CLKCON
extern volatile unsigned char           T8CLKCON            __at(0x49E);
#ifndef _LIB_BUILD
asm("T8CLKCON equ 049Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :4;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
    struct {
        unsigned T8CS                   :4;
    };
    struct {
        unsigned T8CS0                  :1;
        unsigned T8CS1                  :1;
        unsigned T8CS2                  :1;
        unsigned T8CS3                  :1;
    };
} T8CLKCONbits_t;
extern volatile T8CLKCONbits_t T8CLKCONbits __at(0x49E);
// bitfield macros
#define _T8CLKCON_CS_POSN                                   0x0
#define _T8CLKCON_CS_POSITION                               0x0
#define _T8CLKCON_CS_SIZE                                   0x4
#define _T8CLKCON_CS_LENGTH                                 0x4
#define _T8CLKCON_CS_MASK                                   0xF
#define _T8CLKCON_CS0_POSN                                  0x0
#define _T8CLKCON_CS0_POSITION                              0x0
#define _T8CLKCON_CS0_SIZE                                  0x1
#define _T8CLKCON_CS0_LENGTH                                0x1
#define _T8CLKCON_CS0_MASK                                  0x1
#define _T8CLKCON_CS1_POSN                                  0x1
#define _T8CLKCON_CS1_POSITION                              0x1
#define _T8CLKCON_CS1_SIZE                                  0x1
#define _T8CLKCON_CS1_LENGTH                                0x1
#define _T8CLKCON_CS1_MASK                                  0x2
#define _T8CLKCON_CS2_POSN                                  0x2
#define _T8CLKCON_CS2_POSITION                              0x2
#define _T8CLKCON_CS2_SIZE                                  0x1
#define _T8CLKCON_CS2_LENGTH                                0x1
#define _T8CLKCON_CS2_MASK                                  0x4
#define _T8CLKCON_CS3_POSN                                  0x3
#define _T8CLKCON_CS3_POSITION                              0x3
#define _T8CLKCON_CS3_SIZE                                  0x1
#define _T8CLKCON_CS3_LENGTH                                0x1
#define _T8CLKCON_CS3_MASK                                  0x8
#define _T8CLKCON_T8CS_POSN                                 0x0
#define _T8CLKCON_T8CS_POSITION                             0x0
#define _T8CLKCON_T8CS_SIZE                                 0x4
#define _T8CLKCON_T8CS_LENGTH                               0x4
#define _T8CLKCON_T8CS_MASK                                 0xF
#define _T8CLKCON_T8CS0_POSN                                0x0
#define _T8CLKCON_T8CS0_POSITION                            0x0
#define _T8CLKCON_T8CS0_SIZE                                0x1
#define _T8CLKCON_T8CS0_LENGTH                              0x1
#define _T8CLKCON_T8CS0_MASK                                0x1
#define _T8CLKCON_T8CS1_POSN                                0x1
#define _T8CLKCON_T8CS1_POSITION                            0x1
#define _T8CLKCON_T8CS1_SIZE                                0x1
#define _T8CLKCON_T8CS1_LENGTH                              0x1
#define _T8CLKCON_T8CS1_MASK                                0x2
#define _T8CLKCON_T8CS2_POSN                                0x2
#define _T8CLKCON_T8CS2_POSITION                            0x2
#define _T8CLKCON_T8CS2_SIZE                                0x1
#define _T8CLKCON_T8CS2_LENGTH                              0x1
#define _T8CLKCON_T8CS2_MASK                                0x4
#define _T8CLKCON_T8CS3_POSN                                0x3
#define _T8CLKCON_T8CS3_POSITION                            0x3
#define _T8CLKCON_T8CS3_SIZE                                0x1
#define _T8CLKCON_T8CS3_LENGTH                              0x1
#define _T8CLKCON_T8CS3_MASK                                0x8

// Register: T8RST
#define T8RST T8RST
extern volatile unsigned char           T8RST               __at(0x49F);
#ifndef _LIB_BUILD
asm("T8RST equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSEL                   :5;
    };
    struct {
        unsigned RSEL0                  :1;
        unsigned RSEL1                  :1;
        unsigned RSEL2                  :1;
        unsigned RSEL3                  :1;
        unsigned RSEL4                  :1;
    };
    struct {
        unsigned T8RSEL                 :5;
    };
    struct {
        unsigned T8RSEL0                :1;
        unsigned T8RSEL1                :1;
        unsigned T8RSEL2                :1;
        unsigned T8RSEL3                :1;
        unsigned T8RSEL4                :1;
    };
} T8RSTbits_t;
extern volatile T8RSTbits_t T8RSTbits __at(0x49F);
// bitfield macros
#define _T8RST_RSEL_POSN                                    0x0
#define _T8RST_RSEL_POSITION                                0x0
#define _T8RST_RSEL_SIZE                                    0x5
#define _T8RST_RSEL_LENGTH                                  0x5
#define _T8RST_RSEL_MASK                                    0x1F
#define _T8RST_RSEL0_POSN                                   0x0
#define _T8RST_RSEL0_POSITION                               0x0
#define _T8RST_RSEL0_SIZE                                   0x1
#define _T8RST_RSEL0_LENGTH                                 0x1
#define _T8RST_RSEL0_MASK                                   0x1
#define _T8RST_RSEL1_POSN                                   0x1
#define _T8RST_RSEL1_POSITION                               0x1
#define _T8RST_RSEL1_SIZE                                   0x1
#define _T8RST_RSEL1_LENGTH                                 0x1
#define _T8RST_RSEL1_MASK                                   0x2
#define _T8RST_RSEL2_POSN                                   0x2
#define _T8RST_RSEL2_POSITION                               0x2
#define _T8RST_RSEL2_SIZE                                   0x1
#define _T8RST_RSEL2_LENGTH                                 0x1
#define _T8RST_RSEL2_MASK                                   0x4
#define _T8RST_RSEL3_POSN                                   0x3
#define _T8RST_RSEL3_POSITION                               0x3
#define _T8RST_RSEL3_SIZE                                   0x1
#define _T8RST_RSEL3_LENGTH                                 0x1
#define _T8RST_RSEL3_MASK                                   0x8
#define _T8RST_RSEL4_POSN                                   0x4
#define _T8RST_RSEL4_POSITION                               0x4
#define _T8RST_RSEL4_SIZE                                   0x1
#define _T8RST_RSEL4_LENGTH                                 0x1
#define _T8RST_RSEL4_MASK                                   0x10
#define _T8RST_T8RSEL_POSN                                  0x0
#define _T8RST_T8RSEL_POSITION                              0x0
#define _T8RST_T8RSEL_SIZE                                  0x5
#define _T8RST_T8RSEL_LENGTH                                0x5
#define _T8RST_T8RSEL_MASK                                  0x1F
#define _T8RST_T8RSEL0_POSN                                 0x0
#define _T8RST_T8RSEL0_POSITION                             0x0
#define _T8RST_T8RSEL0_SIZE                                 0x1
#define _T8RST_T8RSEL0_LENGTH                               0x1
#define _T8RST_T8RSEL0_MASK                                 0x1
#define _T8RST_T8RSEL1_POSN                                 0x1
#define _T8RST_T8RSEL1_POSITION                             0x1
#define _T8RST_T8RSEL1_SIZE                                 0x1
#define _T8RST_T8RSEL1_LENGTH                               0x1
#define _T8RST_T8RSEL1_MASK                                 0x2
#define _T8RST_T8RSEL2_POSN                                 0x2
#define _T8RST_T8RSEL2_POSITION                             0x2
#define _T8RST_T8RSEL2_SIZE                                 0x1
#define _T8RST_T8RSEL2_LENGTH                               0x1
#define _T8RST_T8RSEL2_MASK                                 0x4
#define _T8RST_T8RSEL3_POSN                                 0x3
#define _T8RST_T8RSEL3_POSITION                             0x3
#define _T8RST_T8RSEL3_SIZE                                 0x1
#define _T8RST_T8RSEL3_LENGTH                               0x1
#define _T8RST_T8RSEL3_MASK                                 0x8
#define _T8RST_T8RSEL4_POSN                                 0x4
#define _T8RST_T8RSEL4_POSITION                             0x4
#define _T8RST_T8RSEL4_SIZE                                 0x1
#define _T8RST_T8RSEL4_LENGTH                               0x1
#define _T8RST_T8RSEL4_MASK                                 0x10

// Register: OPA1NCHS
#define OPA1NCHS OPA1NCHS
extern volatile unsigned char           OPA1NCHS            __at(0x50F);
#ifndef _LIB_BUILD
asm("OPA1NCHS equ 050Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :8;
    };
    struct {
        unsigned OPA1NCH                :8;
    };
} OPA1NCHSbits_t;
extern volatile OPA1NCHSbits_t OPA1NCHSbits __at(0x50F);
// bitfield macros
#define _OPA1NCHS_NCH_POSN                                  0x0
#define _OPA1NCHS_NCH_POSITION                              0x0
#define _OPA1NCHS_NCH_SIZE                                  0x8
#define _OPA1NCHS_NCH_LENGTH                                0x8
#define _OPA1NCHS_NCH_MASK                                  0xFF
#define _OPA1NCHS_OPA1NCH_POSN                              0x0
#define _OPA1NCHS_OPA1NCH_POSITION                          0x0
#define _OPA1NCHS_OPA1NCH_SIZE                              0x8
#define _OPA1NCHS_OPA1NCH_LENGTH                            0x8
#define _OPA1NCHS_OPA1NCH_MASK                              0xFF

// Register: OPA1PCHS
#define OPA1PCHS OPA1PCHS
extern volatile unsigned char           OPA1PCHS            __at(0x510);
#ifndef _LIB_BUILD
asm("OPA1PCHS equ 0510h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
    struct {
        unsigned OPA1PCH                :8;
    };
} OPA1PCHSbits_t;
extern volatile OPA1PCHSbits_t OPA1PCHSbits __at(0x510);
// bitfield macros
#define _OPA1PCHS_PCH_POSN                                  0x0
#define _OPA1PCHS_PCH_POSITION                              0x0
#define _OPA1PCHS_PCH_SIZE                                  0x8
#define _OPA1PCHS_PCH_LENGTH                                0x8
#define _OPA1PCHS_PCH_MASK                                  0xFF
#define _OPA1PCHS_OPA1PCH_POSN                              0x0
#define _OPA1PCHS_OPA1PCH_POSITION                          0x0
#define _OPA1PCHS_OPA1PCH_SIZE                              0x8
#define _OPA1PCHS_OPA1PCH_LENGTH                            0x8
#define _OPA1PCHS_OPA1PCH_MASK                              0xFF

