MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile OPA3CONbits_t OPA3CONbits __at(0x519);
// bitfield macros
#define _OPA3CON_ORM_POSN                                   0x0
#define _OPA3CON_ORM_POSITION                               0x0
#define _OPA3CON_ORM_SIZE                                   0x2
#define _OPA3CON_ORM_LENGTH                                 0x2
#define _OPA3CON_ORM_MASK                                   0x3
#define _OPA3CON_ORPOL_POSN                                 0x2
#define _OPA3CON_ORPOL_POSITION                             0x2
#define _OPA3CON_ORPOL_SIZE                                 0x1
#define _OPA3CON_ORPOL_LENGTH                               0x1
#define _OPA3CON_ORPOL_MASK                                 0x4
#define _OPA3CON_UG_POSN                                    0x4
#define _OPA3CON_UG_POSITION                                0x4
#define _OPA3CON_UG_SIZE                                    0x1
#define _OPA3CON_UG_LENGTH                                  0x1
#define _OPA3CON_UG_MASK                                    0x10
#define _OPA3CON_SP_POSN                                    0x6
#define _OPA3CON_SP_POSITION                                0x6
#define _OPA3CON_SP_SIZE                                    0x1
#define _OPA3CON_SP_LENGTH                                  0x1
#define _OPA3CON_SP_MASK                                    0x40
#define _OPA3CON_EN_POSN                                    0x7
#define _OPA3CON_EN_POSITION                                0x7
#define _OPA3CON_EN_SIZE                                    0x1
#define _OPA3CON_EN_LENGTH                                  0x1
#define _OPA3CON_EN_MASK                                    0x80
#define _OPA3CON_ORM0_POSN                                  0x0
#define _OPA3CON_ORM0_POSITION                              0x0
#define _OPA3CON_ORM0_SIZE                                  0x1
#define _OPA3CON_ORM0_LENGTH                                0x1
#define _OPA3CON_ORM0_MASK                                  0x1
#define _OPA3CON_ORM1_POSN                                  0x1
#define _OPA3CON_ORM1_POSITION                              0x1
#define _OPA3CON_ORM1_SIZE                                  0x1
#define _OPA3CON_ORM1_LENGTH                                0x1
#define _OPA3CON_ORM1_MASK                                  0x2
#define _OPA3CON_OPA3ORM_POSN                               0x0
#define _OPA3CON_OPA3ORM_POSITION                           0x0
#define _OPA3CON_OPA3ORM_SIZE                               0x2
#define _OPA3CON_OPA3ORM_LENGTH                             0x2
#define _OPA3CON_OPA3ORM_MASK                               0x3
#define _OPA3CON_OPA3ORPOL_POSN                             0x2
#define _OPA3CON_OPA3ORPOL_POSITION                         0x2
#define _OPA3CON_OPA3ORPOL_SIZE                             0x1
#define _OPA3CON_OPA3ORPOL_LENGTH                           0x1
#define _OPA3CON_OPA3ORPOL_MASK                             0x4
#define _OPA3CON_OPA3UG_POSN                                0x4
#define _OPA3CON_OPA3UG_POSITION                            0x4
#define _OPA3CON_OPA3UG_SIZE                                0x1
#define _OPA3CON_OPA3UG_LENGTH                              0x1
#define _OPA3CON_OPA3UG_MASK                                0x10
#define _OPA3CON_OPA3SP_POSN                                0x6
#define _OPA3CON_OPA3SP_POSITION                            0x6
#define _OPA3CON_OPA3SP_SIZE                                0x1
#define _OPA3CON_OPA3SP_LENGTH                              0x1
#define _OPA3CON_OPA3SP_MASK                                0x40
#define _OPA3CON_OPA3EN_POSN                                0x7
#define _OPA3CON_OPA3EN_POSITION                            0x7
#define _OPA3CON_OPA3EN_SIZE                                0x1
#define _OPA3CON_OPA3EN_LENGTH                              0x1
#define _OPA3CON_OPA3EN_MASK                                0x80
#define _OPA3CON_OPA3ORM0_POSN                              0x0
#define _OPA3CON_OPA3ORM0_POSITION                          0x0
#define _OPA3CON_OPA3ORM0_SIZE                              0x1
#define _OPA3CON_OPA3ORM0_LENGTH                            0x1
#define _OPA3CON_OPA3ORM0_MASK                              0x1
#define _OPA3CON_OPA3ORM1_POSN                              0x1
#define _OPA3CON_OPA3ORM1_POSITION                          0x1
#define _OPA3CON_OPA3ORM1_SIZE                              0x1
#define _OPA3CON_OPA3ORM1_LENGTH                            0x1
#define _OPA3CON_OPA3ORM1_MASK                              0x2

// Register: OPA3ORS
#define OPA3ORS OPA3ORS
extern volatile unsigned char           OPA3ORS             __at(0x51A);
#ifndef _LIB_BUILD
asm("OPA3ORS equ 051Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
} OPA3ORSbits_t;
extern volatile OPA3ORSbits_t OPA3ORSbits __at(0x51A);
// bitfield macros
#define _OPA3ORS_ORS_POSN                                   0x0
#define _OPA3ORS_ORS_POSITION                               0x0
#define _OPA3ORS_ORS_SIZE                                   0x8
#define _OPA3ORS_ORS_LENGTH                                 0x8
#define _OPA3ORS_ORS_MASK                                   0xFF

// Register: OPA4NCHS
#define OPA4NCHS OPA4NCHS
extern volatile unsigned char           OPA4NCHS            __at(0x51B);
#ifndef _LIB_BUILD
asm("OPA4NCHS equ 051Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :8;
    };
    struct {
        unsigned OPA4NCH                :8;
    };
} OPA4NCHSbits_t;
extern volatile OPA4NCHSbits_t OPA4NCHSbits __at(0x51B);
// bitfield macros
#define _OPA4NCHS_NCH_POSN                                  0x0
#define _OPA4NCHS_NCH_POSITION                              0x0
#define _OPA4NCHS_NCH_SIZE                                  0x8
#define _OPA4NCHS_NCH_LENGTH                                0x8
#define _OPA4NCHS_NCH_MASK                                  0xFF
#define _OPA4NCHS_OPA4NCH_POSN                              0x0
#define _OPA4NCHS_OPA4NCH_POSITION                          0x0
#define _OPA4NCHS_OPA4NCH_SIZE                              0x8
#define _OPA4NCHS_OPA4NCH_LENGTH                            0x8
#define _OPA4NCHS_OPA4NCH_MASK                              0xFF

// Register: OPA4PCHS
#define OPA4PCHS OPA4PCHS
extern volatile unsigned char           OPA4PCHS            __at(0x51C);
#ifndef _LIB_BUILD
asm("OPA4PCHS equ 051Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
    struct {
        unsigned OPA4PCH                :8;
    };
} OPA4PCHSbits_t;
extern volatile OPA4PCHSbits_t OPA4PCHSbits __at(0x51C);
// bitfield macros
#define _OPA4PCHS_PCH_POSN                                  0x0
#define _OPA4PCHS_PCH_POSITION                              0x0
#define _OPA4PCHS_PCH_SIZE                                  0x8
#define _OPA4PCHS_PCH_LENGTH                                0x8
#define _OPA4PCHS_PCH_MASK                                  0xFF
#define _OPA4PCHS_OPA4PCH_POSN                              0x0
#define _OPA4PCHS_OPA4PCH_POSITION                          0x0
#define _OPA4PCHS_OPA4PCH_SIZE                              0x8
#define _OPA4PCHS_OPA4PCH_LENGTH                            0x8
#define _OPA4PCHS_OPA4PCH_MASK                              0xFF

// Register: OPA4CON
#define OPA4CON OPA4CON
extern volatile unsigned char           OPA4CON             __at(0x51D);
#ifndef _LIB_BUILD
asm("OPA4CON equ 051Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORM                    :2;
        unsigned ORPOL                  :1;
        unsigned                        :1;
        unsigned UG                     :1;
        unsigned                        :1;
        unsigned SP                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ORM0                   :1;
        unsigned ORM1                   :1;
    };
    struct {
        unsigned OPA4ORM                :2;
        unsigned OPA4ORPOL              :1;
        unsigned                        :1;
        unsigned OPA4UG                 :1;
        unsigned                        :1;
        unsigned OPA4SP                 :1;
        unsigned OPA4EN                 :1;
    };
    struct {
        unsigned OPA4ORM0               :1;
        unsigned OPA4ORM1               :1;
    };
} OPA4CONbits_t;
