MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile DAC6CON0bits_t DAC6CON0bits __at(0x59B);
// bitfield macros
#define _DAC6CON0_NSS_POSN                                  0x0
#define _DAC6CON0_NSS_POSITION                              0x0
#define _DAC6CON0_NSS_SIZE                                  0x2
#define _DAC6CON0_NSS_LENGTH                                0x2
#define _DAC6CON0_NSS_MASK                                  0x3
#define _DAC6CON0_PSS_POSN                                  0x2
#define _DAC6CON0_PSS_POSITION                              0x2
#define _DAC6CON0_PSS_SIZE                                  0x2
#define _DAC6CON0_PSS_LENGTH                                0x2
#define _DAC6CON0_PSS_MASK                                  0xC
#define _DAC6CON0_OE2_POSN                                  0x4
#define _DAC6CON0_OE2_POSITION                              0x4
#define _DAC6CON0_OE2_SIZE                                  0x1
#define _DAC6CON0_OE2_LENGTH                                0x1
#define _DAC6CON0_OE2_MASK                                  0x10
#define _DAC6CON0_OE1_POSN                                  0x5
#define _DAC6CON0_OE1_POSITION                              0x5
#define _DAC6CON0_OE1_SIZE                                  0x1
#define _DAC6CON0_OE1_LENGTH                                0x1
#define _DAC6CON0_OE1_MASK                                  0x20
#define _DAC6CON0_FM_POSN                                   0x6
#define _DAC6CON0_FM_POSITION                               0x6
#define _DAC6CON0_FM_SIZE                                   0x1
#define _DAC6CON0_FM_LENGTH                                 0x1
#define _DAC6CON0_FM_MASK                                   0x40
#define _DAC6CON0_EN_POSN                                   0x7
#define _DAC6CON0_EN_POSITION                               0x7
#define _DAC6CON0_EN_SIZE                                   0x1
#define _DAC6CON0_EN_LENGTH                                 0x1
#define _DAC6CON0_EN_MASK                                   0x80
#define _DAC6CON0_NSS0_POSN                                 0x0
#define _DAC6CON0_NSS0_POSITION                             0x0
#define _DAC6CON0_NSS0_SIZE                                 0x1
#define _DAC6CON0_NSS0_LENGTH                               0x1
#define _DAC6CON0_NSS0_MASK                                 0x1
#define _DAC6CON0_NSS1_POSN                                 0x1
#define _DAC6CON0_NSS1_POSITION                             0x1
#define _DAC6CON0_NSS1_SIZE                                 0x1
#define _DAC6CON0_NSS1_LENGTH                               0x1
#define _DAC6CON0_NSS1_MASK                                 0x2
#define _DAC6CON0_PSS0_POSN                                 0x2
#define _DAC6CON0_PSS0_POSITION                             0x2
#define _DAC6CON0_PSS0_SIZE                                 0x1
#define _DAC6CON0_PSS0_LENGTH                               0x1
#define _DAC6CON0_PSS0_MASK                                 0x4
#define _DAC6CON0_PSS1_POSN                                 0x3
#define _DAC6CON0_PSS1_POSITION                             0x3
#define _DAC6CON0_PSS1_SIZE                                 0x1
#define _DAC6CON0_PSS1_LENGTH                               0x1
#define _DAC6CON0_PSS1_MASK                                 0x8
#define _DAC6CON0_OE_POSN                                   0x5
#define _DAC6CON0_OE_POSITION                               0x5
#define _DAC6CON0_OE_SIZE                                   0x1
#define _DAC6CON0_OE_LENGTH                                 0x1
#define _DAC6CON0_OE_MASK                                   0x20
#define _DAC6CON0_DACNSS_POSN                               0x0
#define _DAC6CON0_DACNSS_POSITION                           0x0
#define _DAC6CON0_DACNSS_SIZE                               0x2
#define _DAC6CON0_DACNSS_LENGTH                             0x2
#define _DAC6CON0_DACNSS_MASK                               0x3
#define _DAC6CON0_DACPSS_POSN                               0x2
#define _DAC6CON0_DACPSS_POSITION                           0x2
#define _DAC6CON0_DACPSS_SIZE                               0x2
#define _DAC6CON0_DACPSS_LENGTH                             0x2
#define _DAC6CON0_DACPSS_MASK                               0xC
#define _DAC6CON0_DACOE2_POSN                               0x4
#define _DAC6CON0_DACOE2_POSITION                           0x4
#define _DAC6CON0_DACOE2_SIZE                               0x1
#define _DAC6CON0_DACOE2_LENGTH                             0x1
#define _DAC6CON0_DACOE2_MASK                               0x10
#define _DAC6CON0_DACOE1_POSN                               0x5
#define _DAC6CON0_DACOE1_POSITION                           0x5
#define _DAC6CON0_DACOE1_SIZE                               0x1
#define _DAC6CON0_DACOE1_LENGTH                             0x1
#define _DAC6CON0_DACOE1_MASK                               0x20
#define _DAC6CON0_DACFM_POSN                                0x6
#define _DAC6CON0_DACFM_POSITION                            0x6
#define _DAC6CON0_DACFM_SIZE                                0x1
#define _DAC6CON0_DACFM_LENGTH                              0x1
#define _DAC6CON0_DACFM_MASK                                0x40
#define _DAC6CON0_DACEN_POSN                                0x7
#define _DAC6CON0_DACEN_POSITION                            0x7
#define _DAC6CON0_DACEN_SIZE                                0x1
#define _DAC6CON0_DACEN_LENGTH                              0x1
#define _DAC6CON0_DACEN_MASK                                0x80
#define _DAC6CON0_DACNSS0_POSN                              0x0
#define _DAC6CON0_DACNSS0_POSITION                          0x0
#define _DAC6CON0_DACNSS0_SIZE                              0x1
#define _DAC6CON0_DACNSS0_LENGTH                            0x1
#define _DAC6CON0_DACNSS0_MASK                              0x1
#define _DAC6CON0_DACNSS1_POSN                              0x1
#define _DAC6CON0_DACNSS1_POSITION                          0x1
#define _DAC6CON0_DACNSS1_SIZE                              0x1
#define _DAC6CON0_DACNSS1_LENGTH                            0x1
#define _DAC6CON0_DACNSS1_MASK                              0x2
#define _DAC6CON0_DACPSS0_POSN                              0x2
#define _DAC6CON0_DACPSS0_POSITION                          0x2
#define _DAC6CON0_DACPSS0_SIZE                              0x1
#define _DAC6CON0_DACPSS0_LENGTH                            0x1
#define _DAC6CON0_DACPSS0_MASK                              0x4
#define _DAC6CON0_DACPSS1_POSN                              0x3
#define _DAC6CON0_DACPSS1_POSITION                          0x3
#define _DAC6CON0_DACPSS1_SIZE                              0x1
#define _DAC6CON0_DACPSS1_LENGTH                            0x1
#define _DAC6CON0_DACPSS1_MASK                              0x8
#define _DAC6CON0_DACOE_POSN                                0x5
#define _DAC6CON0_DACOE_POSITION                            0x5
#define _DAC6CON0_DACOE_SIZE                                0x1
#define _DAC6CON0_DACOE_LENGTH                              0x1
#define _DAC6CON0_DACOE_MASK                                0x20
#define _DAC6CON0_DAC6NSS_POSN                              0x0
#define _DAC6CON0_DAC6NSS_POSITION                          0x0
#define _DAC6CON0_DAC6NSS_SIZE                              0x2
#define _DAC6CON0_DAC6NSS_LENGTH                            0x2
#define _DAC6CON0_DAC6NSS_MASK                              0x3
#define _DAC6CON0_DAC6PSS_POSN                              0x2
#define _DAC6CON0_DAC6PSS_POSITION                          0x2
#define _DAC6CON0_DAC6PSS_SIZE                              0x2
#define _DAC6CON0_DAC6PSS_LENGTH                            0x2
#define _DAC6CON0_DAC6PSS_MASK                              0xC
#define _DAC6CON0_DAC6OE2_POSN                              0x4
#define _DAC6CON0_DAC6OE2_POSITION                          0x4
#define _DAC6CON0_DAC6OE2_SIZE                              0x1
#define _DAC6CON0_DAC6OE2_LENGTH                            0x1
#define _DAC6CON0_DAC6OE2_MASK                              0x10
#define _DAC6CON0_DAC6OE1_POSN                              0x5
#define _DAC6CON0_DAC6OE1_POSITION                          0x5
#define _DAC6CON0_DAC6OE1_SIZE                              0x1
#define _DAC6CON0_DAC6OE1_LENGTH                            0x1
#define _DAC6CON0_DAC6OE1_MASK                              0x20
#define _DAC6CON0_DAC6FM_POSN                               0x6
#define _DAC6CON0_DAC6FM_POSITION                           0x6
#define _DAC6CON0_DAC6FM_SIZE                               0x1
#define _DAC6CON0_DAC6FM_LENGTH                             0x1
#define _DAC6CON0_DAC6FM_MASK                               0x40
#define _DAC6CON0_DAC6EN_POSN                               0x7
#define _DAC6CON0_DAC6EN_POSITION                           0x7
#define _DAC6CON0_DAC6EN_SIZE                               0x1
#define _DAC6CON0_DAC6EN_LENGTH                             0x1
#define _DAC6CON0_DAC6EN_MASK                               0x80
#define _DAC6CON0_DAC6NSS0_POSN                             0x0
#define _DAC6CON0_DAC6NSS0_POSITION                         0x0
#define _DAC6CON0_DAC6NSS0_SIZE                             0x1
#define _DAC6CON0_DAC6NSS0_LENGTH                           0x1
#define _DAC6CON0_DAC6NSS0_MASK                             0x1
#define _DAC6CON0_DAC6NSS1_POSN                             0x1
#define _DAC6CON0_DAC6NSS1_POSITION                         0x1
#define _DAC6CON0_DAC6NSS1_SIZE                             0x1
#define _DAC6CON0_DAC6NSS1_LENGTH                           0x1
#define _DAC6CON0_DAC6NSS1_MASK                             0x2
#define _DAC6CON0_DAC6PSS0_POSN                             0x2
#define _DAC6CON0_DAC6PSS0_POSITION                         0x2
#define _DAC6CON0_DAC6PSS0_SIZE                             0x1
#define _DAC6CON0_DAC6PSS0_LENGTH                           0x1
#define _DAC6CON0_DAC6PSS0_MASK                             0x4
#define _DAC6CON0_DAC6PSS1_POSN                             0x3
#define _DAC6CON0_DAC6PSS1_POSITION                         0x3
#define _DAC6CON0_DAC6PSS1_SIZE                             0x1
#define _DAC6CON0_DAC6PSS1_LENGTH                           0x1
#define _DAC6CON0_DAC6PSS1_MASK                             0x8

// Register: DAC6REF
#define DAC6REF DAC6REF
extern volatile unsigned short          DAC6REF             __at(0x59C);
#ifndef _LIB_BUILD
asm("DAC6REF equ 059Ch");
#endif

