MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile DAC7REFbits_t DAC7REFbits __at(0x59F);
// bitfield macros
#define _DAC7REF_DACR_POSN                                  0x0
#define _DAC7REF_DACR_POSITION                              0x0
#define _DAC7REF_DACR_SIZE                                  0x5
#define _DAC7REF_DACR_LENGTH                                0x5
#define _DAC7REF_DACR_MASK                                  0x1F
#define _DAC7REF_DACR0_POSN                                 0x0
#define _DAC7REF_DACR0_POSITION                             0x0
#define _DAC7REF_DACR0_SIZE                                 0x1
#define _DAC7REF_DACR0_LENGTH                               0x1
#define _DAC7REF_DACR0_MASK                                 0x1
#define _DAC7REF_DACR1_POSN                                 0x1
#define _DAC7REF_DACR1_POSITION                             0x1
#define _DAC7REF_DACR1_SIZE                                 0x1
#define _DAC7REF_DACR1_LENGTH                               0x1
#define _DAC7REF_DACR1_MASK                                 0x2
#define _DAC7REF_DACR2_POSN                                 0x2
#define _DAC7REF_DACR2_POSITION                             0x2
#define _DAC7REF_DACR2_SIZE                                 0x1
#define _DAC7REF_DACR2_LENGTH                               0x1
#define _DAC7REF_DACR2_MASK                                 0x4
#define _DAC7REF_DACR3_POSN                                 0x3
#define _DAC7REF_DACR3_POSITION                             0x3
#define _DAC7REF_DACR3_SIZE                                 0x1
#define _DAC7REF_DACR3_LENGTH                               0x1
#define _DAC7REF_DACR3_MASK                                 0x8
#define _DAC7REF_DACR4_POSN                                 0x4
#define _DAC7REF_DACR4_POSITION                             0x4
#define _DAC7REF_DACR4_SIZE                                 0x1
#define _DAC7REF_DACR4_LENGTH                               0x1
#define _DAC7REF_DACR4_MASK                                 0x10
#define _DAC7REF_R0_POSN                                    0x0
#define _DAC7REF_R0_POSITION                                0x0
#define _DAC7REF_R0_SIZE                                    0x1
#define _DAC7REF_R0_LENGTH                                  0x1
#define _DAC7REF_R0_MASK                                    0x1
#define _DAC7REF_R1_POSN                                    0x1
#define _DAC7REF_R1_POSITION                                0x1
#define _DAC7REF_R1_SIZE                                    0x1
#define _DAC7REF_R1_LENGTH                                  0x1
#define _DAC7REF_R1_MASK                                    0x2
#define _DAC7REF_R2_POSN                                    0x2
#define _DAC7REF_R2_POSITION                                0x2
#define _DAC7REF_R2_SIZE                                    0x1
#define _DAC7REF_R2_LENGTH                                  0x1
#define _DAC7REF_R2_MASK                                    0x4
#define _DAC7REF_R3_POSN                                    0x3
#define _DAC7REF_R3_POSITION                                0x3
#define _DAC7REF_R3_SIZE                                    0x1
#define _DAC7REF_R3_LENGTH                                  0x1
#define _DAC7REF_R3_MASK                                    0x8
#define _DAC7REF_R4_POSN                                    0x4
#define _DAC7REF_R4_POSITION                                0x4
#define _DAC7REF_R4_SIZE                                    0x1
#define _DAC7REF_R4_LENGTH                                  0x1
#define _DAC7REF_R4_MASK                                    0x10
#define _DAC7REF_DAC7R_POSN                                 0x0
#define _DAC7REF_DAC7R_POSITION                             0x0
#define _DAC7REF_DAC7R_SIZE                                 0x5
#define _DAC7REF_DAC7R_LENGTH                               0x5
#define _DAC7REF_DAC7R_MASK                                 0x1F
#define _DAC7REF_DAC7R0_POSN                                0x0
#define _DAC7REF_DAC7R0_POSITION                            0x0
#define _DAC7REF_DAC7R0_SIZE                                0x1
#define _DAC7REF_DAC7R0_LENGTH                              0x1
#define _DAC7REF_DAC7R0_MASK                                0x1
#define _DAC7REF_DAC7R1_POSN                                0x1
#define _DAC7REF_DAC7R1_POSITION                            0x1
#define _DAC7REF_DAC7R1_SIZE                                0x1
#define _DAC7REF_DAC7R1_LENGTH                              0x1
#define _DAC7REF_DAC7R1_MASK                                0x2
#define _DAC7REF_DAC7R2_POSN                                0x2
#define _DAC7REF_DAC7R2_POSITION                            0x2
#define _DAC7REF_DAC7R2_SIZE                                0x1
#define _DAC7REF_DAC7R2_LENGTH                              0x1
#define _DAC7REF_DAC7R2_MASK                                0x4
#define _DAC7REF_DAC7R3_POSN                                0x3
#define _DAC7REF_DAC7R3_POSITION                            0x3
#define _DAC7REF_DAC7R3_SIZE                                0x1
#define _DAC7REF_DAC7R3_LENGTH                              0x1
#define _DAC7REF_DAC7R3_MASK                                0x8
#define _DAC7REF_DAC7R4_POSN                                0x4
#define _DAC7REF_DAC7R4_POSITION                            0x4
#define _DAC7REF_DAC7R4_SIZE                                0x1
#define _DAC7REF_DAC7R4_LENGTH                              0x1
#define _DAC7REF_DAC7R4_MASK                                0x10
#define _DAC7REF_REF0_POSN                                  0x0
#define _DAC7REF_REF0_POSITION                              0x0
#define _DAC7REF_REF0_SIZE                                  0x1
#define _DAC7REF_REF0_LENGTH                                0x1
#define _DAC7REF_REF0_MASK                                  0x1
#define _DAC7REF_REF1_POSN                                  0x1
#define _DAC7REF_REF1_POSITION                              0x1
#define _DAC7REF_REF1_SIZE                                  0x1
#define _DAC7REF_REF1_LENGTH                                0x1
#define _DAC7REF_REF1_MASK                                  0x2
#define _DAC7REF_REF2_POSN                                  0x2
#define _DAC7REF_REF2_POSITION                              0x2
#define _DAC7REF_REF2_SIZE                                  0x1
#define _DAC7REF_REF2_LENGTH                                0x1
#define _DAC7REF_REF2_MASK                                  0x4
#define _DAC7REF_REF3_POSN                                  0x3
#define _DAC7REF_REF3_POSITION                              0x3
#define _DAC7REF_REF3_SIZE                                  0x1
#define _DAC7REF_REF3_LENGTH                                0x1
#define _DAC7REF_REF3_MASK                                  0x8
#define _DAC7REF_REF4_POSN                                  0x4
#define _DAC7REF_REF4_POSITION                              0x4
#define _DAC7REF_REF4_SIZE                                  0x1
#define _DAC7REF_REF4_LENGTH                                0x1
#define _DAC7REF_REF4_MASK                                  0x10
#define _DAC7REF_DAC7REF0_POSN                              0x0
#define _DAC7REF_DAC7REF0_POSITION                          0x0
#define _DAC7REF_DAC7REF0_SIZE                              0x1
#define _DAC7REF_DAC7REF0_LENGTH                            0x1
#define _DAC7REF_DAC7REF0_MASK                              0x1
#define _DAC7REF_DAC7REF1_POSN                              0x1
#define _DAC7REF_DAC7REF1_POSITION                          0x1
#define _DAC7REF_DAC7REF1_SIZE                              0x1
#define _DAC7REF_DAC7REF1_LENGTH                            0x1
#define _DAC7REF_DAC7REF1_MASK                              0x2
#define _DAC7REF_DAC7REF2_POSN                              0x2
#define _DAC7REF_DAC7REF2_POSITION                          0x2
#define _DAC7REF_DAC7REF2_SIZE                              0x1
#define _DAC7REF_DAC7REF2_LENGTH                            0x1
#define _DAC7REF_DAC7REF2_MASK                              0x4
#define _DAC7REF_DAC7REF3_POSN                              0x3
#define _DAC7REF_DAC7REF3_POSITION                          0x3
#define _DAC7REF_DAC7REF3_SIZE                              0x1
#define _DAC7REF_DAC7REF3_LENGTH                            0x1
#define _DAC7REF_DAC7REF3_MASK                              0x8
#define _DAC7REF_DAC7REF4_POSN                              0x4
#define _DAC7REF_DAC7REF4_POSITION                          0x4
#define _DAC7REF_DAC7REF4_SIZE                              0x1
#define _DAC7REF_DAC7REF4_LENGTH                            0x1
#define _DAC7REF_DAC7REF4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC7R                  :5;
    };
    struct {
        unsigned DAC7R0                 :1;
        unsigned DAC7R1                 :1;
        unsigned DAC7R2                 :1;
        unsigned DAC7R3                 :1;
        unsigned DAC7R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC7REF0               :1;
        unsigned DAC7REF1               :1;
        unsigned DAC7REF2               :1;
        unsigned DAC7REF3               :1;
        unsigned DAC7REF4               :1;
    };
} DAC7CON1bits_t;
extern volatile DAC7CON1bits_t DAC7CON1bits __at(0x59F);
// bitfield macros
#define _DAC7CON1_DACR_POSN                                 0x0
#define _DAC7CON1_DACR_POSITION                             0x0
#define _DAC7CON1_DACR_SIZE                                 0x5
#define _DAC7CON1_DACR_LENGTH                               0x5
#define _DAC7CON1_DACR_MASK                                 0x1F
#define _DAC7CON1_DACR0_POSN                                0x0
#define _DAC7CON1_DACR0_POSITION                            0x0
#define _DAC7CON1_DACR0_SIZE                                0x1
#define _DAC7CON1_DACR0_LENGTH                              0x1
#define _DAC7CON1_DACR0_MASK                                0x1
#define _DAC7CON1_DACR1_POSN                                0x1
#define _DAC7CON1_DACR1_POSITION                            0x1
#define _DAC7CON1_DACR1_SIZE                                0x1
#define _DAC7CON1_DACR1_LENGTH                              0x1
#define _DAC7CON1_DACR1_MASK                                0x2
#define _DAC7CON1_DACR2_POSN                                0x2
#define _DAC7CON1_DACR2_POSITION                            0x2
#define _DAC7CON1_DACR2_SIZE                                0x1
#define _DAC7CON1_DACR2_LENGTH                              0x1
#define _DAC7CON1_DACR2_MASK                                0x4
#define _DAC7CON1_DACR3_POSN                                0x3
#define _DAC7CON1_DACR3_POSITION                            0x3
#define _DAC7CON1_DACR3_SIZE                                0x1
#define _DAC7CON1_DACR3_LENGTH                              0x1
#define _DAC7CON1_DACR3_MASK                                0x8
#define _DAC7CON1_DACR4_POSN                                0x4
#define _DAC7CON1_DACR4_POSITION                            0x4
#define _DAC7CON1_DACR4_SIZE                                0x1
#define _DAC7CON1_DACR4_LENGTH                              0x1
#define _DAC7CON1_DACR4_MASK                                0x10
#define _DAC7CON1_R0_POSN                                   0x0
#define _DAC7CON1_R0_POSITION                               0x0
#define _DAC7CON1_R0_SIZE                                   0x1
#define _DAC7CON1_R0_LENGTH                                 0x1
#define _DAC7CON1_R0_MASK                                   0x1
#define _DAC7CON1_R1_POSN                                   0x1
#define _DAC7CON1_R1_POSITION                               0x1
#define _DAC7CON1_R1_SIZE                                   0x1
#define _DAC7CON1_R1_LENGTH                                 0x1
#define _DAC7CON1_R1_MASK                                   0x2
#define _DAC7CON1_R2_POSN                                   0x2
#define _DAC7CON1_R2_POSITION                               0x2
#define _DAC7CON1_R2_SIZE                                   0x1
#define _DAC7CON1_R2_LENGTH                                 0x1
#define _DAC7CON1_R2_MASK                                   0x4
#define _DAC7CON1_R3_POSN                                   0x3
#define _DAC7CON1_R3_POSITION                               0x3
#define _DAC7CON1_R3_SIZE                                   0x1
#define _DAC7CON1_R3_LENGTH                                 0x1
#define _DAC7CON1_R3_MASK                                   0x8
#define _DAC7CON1_R4_POSN                                   0x4
#define _DAC7CON1_R4_POSITION                               0x4
#define _DAC7CON1_R4_SIZE                                   0x1
#define _DAC7CON1_R4_LENGTH                                 0x1
#define _DAC7CON1_R4_MASK                                   0x10
#define _DAC7CON1_DAC7R_POSN                                0x0
#define _DAC7CON1_DAC7R_POSITION                            0x0
#define _DAC7CON1_DAC7R_SIZE                                0x5
#define _DAC7CON1_DAC7R_LENGTH                              0x5
#define _DAC7CON1_DAC7R_MASK                                0x1F
#define _DAC7CON1_DAC7R0_POSN                               0x0
#define _DAC7CON1_DAC7R0_POSITION                           0x0
#define _DAC7CON1_DAC7R0_SIZE                               0x1
#define _DAC7CON1_DAC7R0_LENGTH                             0x1
#define _DAC7CON1_DAC7R0_MASK                               0x1
#define _DAC7CON1_DAC7R1_POSN                               0x1
#define _DAC7CON1_DAC7R1_POSITION                           0x1
#define _DAC7CON1_DAC7R1_SIZE                               0x1
#define _DAC7CON1_DAC7R1_LENGTH                             0x1
#define _DAC7CON1_DAC7R1_MASK                               0x2
#define _DAC7CON1_DAC7R2_POSN                               0x2
#define _DAC7CON1_DAC7R2_POSITION                           0x2
#define _DAC7CON1_DAC7R2_SIZE                               0x1
#define _DAC7CON1_DAC7R2_LENGTH                             0x1
#define _DAC7CON1_DAC7R2_MASK                               0x4
#define _DAC7CON1_DAC7R3_POSN                               0x3
#define _DAC7CON1_DAC7R3_POSITION                           0x3
#define _DAC7CON1_DAC7R3_SIZE                               0x1
#define _DAC7CON1_DAC7R3_LENGTH                             0x1
#define _DAC7CON1_DAC7R3_MASK                               0x8
#define _DAC7CON1_DAC7R4_POSN                               0x4
#define _DAC7CON1_DAC7R4_POSITION                           0x4
#define _DAC7CON1_DAC7R4_SIZE                               0x1
#define _DAC7CON1_DAC7R4_LENGTH                             0x1
#define _DAC7CON1_DAC7R4_MASK                               0x10
#define _DAC7CON1_REF0_POSN                                 0x0
#define _DAC7CON1_REF0_POSITION                             0x0
#define _DAC7CON1_REF0_SIZE                                 0x1
#define _DAC7CON1_REF0_LENGTH                               0x1
#define _DAC7CON1_REF0_MASK                                 0x1
#define _DAC7CON1_REF1_POSN                                 0x1
#define _DAC7CON1_REF1_POSITION                             0x1
#define _DAC7CON1_REF1_SIZE                                 0x1
#define _DAC7CON1_REF1_LENGTH                               0x1
#define _DAC7CON1_REF1_MASK                                 0x2
#define _DAC7CON1_REF2_POSN                                 0x2
#define _DAC7CON1_REF2_POSITION                             0x2
#define _DAC7CON1_REF2_SIZE                                 0x1
#define _DAC7CON1_REF2_LENGTH                               0x1
#define _DAC7CON1_REF2_MASK                                 0x4
#define _DAC7CON1_REF3_POSN                                 0x3
#define _DAC7CON1_REF3_POSITION                             0x3
#define _DAC7CON1_REF3_SIZE                                 0x1
#define _DAC7CON1_REF3_LENGTH                               0x1
#define _DAC7CON1_REF3_MASK                                 0x8
#define _DAC7CON1_REF4_POSN                                 0x4
#define _DAC7CON1_REF4_POSITION                             0x4
#define _DAC7CON1_REF4_SIZE                                 0x1
#define _DAC7CON1_REF4_LENGTH                               0x1
#define _DAC7CON1_REF4_MASK                                 0x10
#define _DAC7CON1_DAC7REF0_POSN                             0x0
#define _DAC7CON1_DAC7REF0_POSITION                         0x0
#define _DAC7CON1_DAC7REF0_SIZE                             0x1
#define _DAC7CON1_DAC7REF0_LENGTH                           0x1
#define _DAC7CON1_DAC7REF0_MASK                             0x1
#define _DAC7CON1_DAC7REF1_POSN                             0x1
#define _DAC7CON1_DAC7REF1_POSITION                         0x1
#define _DAC7CON1_DAC7REF1_SIZE                             0x1
#define _DAC7CON1_DAC7REF1_LENGTH                           0x1
#define _DAC7CON1_DAC7REF1_MASK                             0x2
#define _DAC7CON1_DAC7REF2_POSN                             0x2
#define _DAC7CON1_DAC7REF2_POSITION                         0x2
#define _DAC7CON1_DAC7REF2_SIZE                             0x1
#define _DAC7CON1_DAC7REF2_LENGTH                           0x1
#define _DAC7CON1_DAC7REF2_MASK                             0x4
#define _DAC7CON1_DAC7REF3_POSN                             0x3
#define _DAC7CON1_DAC7REF3_POSITION                         0x3
#define _DAC7CON1_DAC7REF3_SIZE                             0x1
#define _DAC7CON1_DAC7REF3_LENGTH                           0x1
#define _DAC7CON1_DAC7REF3_MASK                             0x8
#define _DAC7CON1_DAC7REF4_POSN                             0x4
#define _DAC7CON1_DAC7REF4_POSITION                         0x4
#define _DAC7CON1_DAC7REF4_SIZE                             0x1
#define _DAC7CON1_DAC7REF4_LENGTH                           0x1
#define _DAC7CON1_DAC7REF4_MASK                             0x10

// Register: DAC8CON0
#define DAC8CON0 DAC8CON0
extern volatile unsigned char           DAC8CON0            __at(0x60C);
#ifndef _LIB_BUILD
asm("DAC8CON0 equ 060Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC8NSS                :2;
        unsigned DAC8PSS                :2;
        unsigned DAC8OE2                :1;
        unsigned DAC8OE1                :1;
        unsigned                        :1;
        unsigned DAC8EN                 :1;
    };
    struct {
        unsigned DAC8NSS0               :1;
        unsigned DAC8NSS1               :1;
        unsigned DAC8PSS0               :1;
        unsigned DAC8PSS1               :1;
    };
} DAC8CON0bits_t;
