MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile DAC8CON1bits_t DAC8CON1bits __at(0x60D);
// bitfield macros
#define _DAC8CON1_DACR_POSN                                 0x0
#define _DAC8CON1_DACR_POSITION                             0x0
#define _DAC8CON1_DACR_SIZE                                 0x5
#define _DAC8CON1_DACR_LENGTH                               0x5
#define _DAC8CON1_DACR_MASK                                 0x1F
#define _DAC8CON1_DACR0_POSN                                0x0
#define _DAC8CON1_DACR0_POSITION                            0x0
#define _DAC8CON1_DACR0_SIZE                                0x1
#define _DAC8CON1_DACR0_LENGTH                              0x1
#define _DAC8CON1_DACR0_MASK                                0x1
#define _DAC8CON1_DACR1_POSN                                0x1
#define _DAC8CON1_DACR1_POSITION                            0x1
#define _DAC8CON1_DACR1_SIZE                                0x1
#define _DAC8CON1_DACR1_LENGTH                              0x1
#define _DAC8CON1_DACR1_MASK                                0x2
#define _DAC8CON1_DACR2_POSN                                0x2
#define _DAC8CON1_DACR2_POSITION                            0x2
#define _DAC8CON1_DACR2_SIZE                                0x1
#define _DAC8CON1_DACR2_LENGTH                              0x1
#define _DAC8CON1_DACR2_MASK                                0x4
#define _DAC8CON1_DACR3_POSN                                0x3
#define _DAC8CON1_DACR3_POSITION                            0x3
#define _DAC8CON1_DACR3_SIZE                                0x1
#define _DAC8CON1_DACR3_LENGTH                              0x1
#define _DAC8CON1_DACR3_MASK                                0x8
#define _DAC8CON1_DACR4_POSN                                0x4
#define _DAC8CON1_DACR4_POSITION                            0x4
#define _DAC8CON1_DACR4_SIZE                                0x1
#define _DAC8CON1_DACR4_LENGTH                              0x1
#define _DAC8CON1_DACR4_MASK                                0x10
#define _DAC8CON1_R0_POSN                                   0x0
#define _DAC8CON1_R0_POSITION                               0x0
#define _DAC8CON1_R0_SIZE                                   0x1
#define _DAC8CON1_R0_LENGTH                                 0x1
#define _DAC8CON1_R0_MASK                                   0x1
#define _DAC8CON1_R1_POSN                                   0x1
#define _DAC8CON1_R1_POSITION                               0x1
#define _DAC8CON1_R1_SIZE                                   0x1
#define _DAC8CON1_R1_LENGTH                                 0x1
#define _DAC8CON1_R1_MASK                                   0x2
#define _DAC8CON1_R2_POSN                                   0x2
#define _DAC8CON1_R2_POSITION                               0x2
#define _DAC8CON1_R2_SIZE                                   0x1
#define _DAC8CON1_R2_LENGTH                                 0x1
#define _DAC8CON1_R2_MASK                                   0x4
#define _DAC8CON1_R3_POSN                                   0x3
#define _DAC8CON1_R3_POSITION                               0x3
#define _DAC8CON1_R3_SIZE                                   0x1
#define _DAC8CON1_R3_LENGTH                                 0x1
#define _DAC8CON1_R3_MASK                                   0x8
#define _DAC8CON1_R4_POSN                                   0x4
#define _DAC8CON1_R4_POSITION                               0x4
#define _DAC8CON1_R4_SIZE                                   0x1
#define _DAC8CON1_R4_LENGTH                                 0x1
#define _DAC8CON1_R4_MASK                                   0x10
#define _DAC8CON1_DAC8R_POSN                                0x0
#define _DAC8CON1_DAC8R_POSITION                            0x0
#define _DAC8CON1_DAC8R_SIZE                                0x5
#define _DAC8CON1_DAC8R_LENGTH                              0x5
#define _DAC8CON1_DAC8R_MASK                                0x1F
#define _DAC8CON1_DAC8R0_POSN                               0x0
#define _DAC8CON1_DAC8R0_POSITION                           0x0
#define _DAC8CON1_DAC8R0_SIZE                               0x1
#define _DAC8CON1_DAC8R0_LENGTH                             0x1
#define _DAC8CON1_DAC8R0_MASK                               0x1
#define _DAC8CON1_DAC8R1_POSN                               0x1
#define _DAC8CON1_DAC8R1_POSITION                           0x1
#define _DAC8CON1_DAC8R1_SIZE                               0x1
#define _DAC8CON1_DAC8R1_LENGTH                             0x1
#define _DAC8CON1_DAC8R1_MASK                               0x2
#define _DAC8CON1_DAC8R2_POSN                               0x2
#define _DAC8CON1_DAC8R2_POSITION                           0x2
#define _DAC8CON1_DAC8R2_SIZE                               0x1
#define _DAC8CON1_DAC8R2_LENGTH                             0x1
#define _DAC8CON1_DAC8R2_MASK                               0x4
#define _DAC8CON1_DAC8R3_POSN                               0x3
#define _DAC8CON1_DAC8R3_POSITION                           0x3
#define _DAC8CON1_DAC8R3_SIZE                               0x1
#define _DAC8CON1_DAC8R3_LENGTH                             0x1
#define _DAC8CON1_DAC8R3_MASK                               0x8
#define _DAC8CON1_DAC8R4_POSN                               0x4
#define _DAC8CON1_DAC8R4_POSITION                           0x4
#define _DAC8CON1_DAC8R4_SIZE                               0x1
#define _DAC8CON1_DAC8R4_LENGTH                             0x1
#define _DAC8CON1_DAC8R4_MASK                               0x10
#define _DAC8CON1_REF0_POSN                                 0x0
#define _DAC8CON1_REF0_POSITION                             0x0
#define _DAC8CON1_REF0_SIZE                                 0x1
#define _DAC8CON1_REF0_LENGTH                               0x1
#define _DAC8CON1_REF0_MASK                                 0x1
#define _DAC8CON1_REF1_POSN                                 0x1
#define _DAC8CON1_REF1_POSITION                             0x1
#define _DAC8CON1_REF1_SIZE                                 0x1
#define _DAC8CON1_REF1_LENGTH                               0x1
#define _DAC8CON1_REF1_MASK                                 0x2
#define _DAC8CON1_REF2_POSN                                 0x2
#define _DAC8CON1_REF2_POSITION                             0x2
#define _DAC8CON1_REF2_SIZE                                 0x1
#define _DAC8CON1_REF2_LENGTH                               0x1
#define _DAC8CON1_REF2_MASK                                 0x4
#define _DAC8CON1_REF3_POSN                                 0x3
#define _DAC8CON1_REF3_POSITION                             0x3
#define _DAC8CON1_REF3_SIZE                                 0x1
#define _DAC8CON1_REF3_LENGTH                               0x1
#define _DAC8CON1_REF3_MASK                                 0x8
#define _DAC8CON1_REF4_POSN                                 0x4
#define _DAC8CON1_REF4_POSITION                             0x4
#define _DAC8CON1_REF4_SIZE                                 0x1
#define _DAC8CON1_REF4_LENGTH                               0x1
#define _DAC8CON1_REF4_MASK                                 0x10
#define _DAC8CON1_DAC8REF0_POSN                             0x0
#define _DAC8CON1_DAC8REF0_POSITION                         0x0
#define _DAC8CON1_DAC8REF0_SIZE                             0x1
#define _DAC8CON1_DAC8REF0_LENGTH                           0x1
#define _DAC8CON1_DAC8REF0_MASK                             0x1
#define _DAC8CON1_DAC8REF1_POSN                             0x1
#define _DAC8CON1_DAC8REF1_POSITION                         0x1
#define _DAC8CON1_DAC8REF1_SIZE                             0x1
#define _DAC8CON1_DAC8REF1_LENGTH                           0x1
#define _DAC8CON1_DAC8REF1_MASK                             0x2
#define _DAC8CON1_DAC8REF2_POSN                             0x2
#define _DAC8CON1_DAC8REF2_POSITION                         0x2
#define _DAC8CON1_DAC8REF2_SIZE                             0x1
#define _DAC8CON1_DAC8REF2_LENGTH                           0x1
#define _DAC8CON1_DAC8REF2_MASK                             0x4
#define _DAC8CON1_DAC8REF3_POSN                             0x3
#define _DAC8CON1_DAC8REF3_POSITION                         0x3
#define _DAC8CON1_DAC8REF3_SIZE                             0x1
#define _DAC8CON1_DAC8REF3_LENGTH                           0x1
#define _DAC8CON1_DAC8REF3_MASK                             0x8
#define _DAC8CON1_DAC8REF4_POSN                             0x4
#define _DAC8CON1_DAC8REF4_POSITION                         0x4
#define _DAC8CON1_DAC8REF4_SIZE                             0x1
#define _DAC8CON1_DAC8REF4_LENGTH                           0x1
#define _DAC8CON1_DAC8REF4_MASK                             0x10

// Register: PRG4RTSS
#define PRG4RTSS PRG4RTSS
extern volatile unsigned char           PRG4RTSS            __at(0x60E);
#ifndef _LIB_BUILD
asm("PRG4RTSS equ 060Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTSS                   :8;
    };
    struct {
        unsigned RTSS0                  :1;
        unsigned RTSS1                  :1;
        unsigned RTSS2                  :1;
        unsigned RTSS3                  :1;
    };
    struct {
        unsigned RG4RTSS0               :1;
        unsigned RG4RTSS1               :1;
        unsigned RG4RTSS2               :1;
        unsigned RG4RTSS3               :1;
    };
} PRG4RTSSbits_t;
