MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
// Register: COG3FSIM1
#define COG3FSIM1 COG3FSIM1
extern volatile unsigned char           COG3FSIM1           __at(0x81C);
#ifndef _LIB_BUILD
asm("COG3FSIM1 equ 081Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned FSIM9                  :1;
        unsigned                        :1;
        unsigned FSIM11                 :1;
        unsigned FSIM12                 :1;
        unsigned FSIM13                 :1;
        unsigned FSIM14                 :1;
        unsigned FSIM15                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned G3FSIM9                :1;
        unsigned                        :1;
        unsigned G3FSIM11               :1;
        unsigned G3FSIM12               :1;
        unsigned G3FSIM13               :1;
        unsigned G3FSIM14               :1;
        unsigned G3FSIM15               :1;
    };
} COG3FSIM1bits_t;
extern volatile COG3FSIM1bits_t COG3FSIM1bits __at(0x81C);
// bitfield macros
#define _COG3FSIM1_FSIM9_POSN                               0x1
#define _COG3FSIM1_FSIM9_POSITION                           0x1
#define _COG3FSIM1_FSIM9_SIZE                               0x1
#define _COG3FSIM1_FSIM9_LENGTH                             0x1
#define _COG3FSIM1_FSIM9_MASK                               0x2
#define _COG3FSIM1_FSIM11_POSN                              0x3
#define _COG3FSIM1_FSIM11_POSITION                          0x3
#define _COG3FSIM1_FSIM11_SIZE                              0x1
#define _COG3FSIM1_FSIM11_LENGTH                            0x1
#define _COG3FSIM1_FSIM11_MASK                              0x8
#define _COG3FSIM1_FSIM12_POSN                              0x4
#define _COG3FSIM1_FSIM12_POSITION                          0x4
#define _COG3FSIM1_FSIM12_SIZE                              0x1
#define _COG3FSIM1_FSIM12_LENGTH                            0x1
#define _COG3FSIM1_FSIM12_MASK                              0x10
#define _COG3FSIM1_FSIM13_POSN                              0x5
#define _COG3FSIM1_FSIM13_POSITION                          0x5
#define _COG3FSIM1_FSIM13_SIZE                              0x1
#define _COG3FSIM1_FSIM13_LENGTH                            0x1
#define _COG3FSIM1_FSIM13_MASK                              0x20
#define _COG3FSIM1_FSIM14_POSN                              0x6
#define _COG3FSIM1_FSIM14_POSITION                          0x6
#define _COG3FSIM1_FSIM14_SIZE                              0x1
#define _COG3FSIM1_FSIM14_LENGTH                            0x1
#define _COG3FSIM1_FSIM14_MASK                              0x40
#define _COG3FSIM1_FSIM15_POSN                              0x7
#define _COG3FSIM1_FSIM15_POSITION                          0x7
#define _COG3FSIM1_FSIM15_SIZE                              0x1
#define _COG3FSIM1_FSIM15_LENGTH                            0x1
#define _COG3FSIM1_FSIM15_MASK                              0x80
#define _COG3FSIM1_G3FSIM9_POSN                             0x1
#define _COG3FSIM1_G3FSIM9_POSITION                         0x1
#define _COG3FSIM1_G3FSIM9_SIZE                             0x1
#define _COG3FSIM1_G3FSIM9_LENGTH                           0x1
#define _COG3FSIM1_G3FSIM9_MASK                             0x2
#define _COG3FSIM1_G3FSIM11_POSN                            0x3
#define _COG3FSIM1_G3FSIM11_POSITION                        0x3
#define _COG3FSIM1_G3FSIM11_SIZE                            0x1
#define _COG3FSIM1_G3FSIM11_LENGTH                          0x1
#define _COG3FSIM1_G3FSIM11_MASK                            0x8
#define _COG3FSIM1_G3FSIM12_POSN                            0x4
#define _COG3FSIM1_G3FSIM12_POSITION                        0x4
#define _COG3FSIM1_G3FSIM12_SIZE                            0x1
#define _COG3FSIM1_G3FSIM12_LENGTH                          0x1
#define _COG3FSIM1_G3FSIM12_MASK                            0x10
#define _COG3FSIM1_G3FSIM13_POSN                            0x5
#define _COG3FSIM1_G3FSIM13_POSITION                        0x5
#define _COG3FSIM1_G3FSIM13_SIZE                            0x1
#define _COG3FSIM1_G3FSIM13_LENGTH                          0x1
#define _COG3FSIM1_G3FSIM13_MASK                            0x20
#define _COG3FSIM1_G3FSIM14_POSN                            0x6
#define _COG3FSIM1_G3FSIM14_POSITION                        0x6
#define _COG3FSIM1_G3FSIM14_SIZE                            0x1
#define _COG3FSIM1_G3FSIM14_LENGTH                          0x1
#define _COG3FSIM1_G3FSIM14_MASK                            0x40
#define _COG3FSIM1_G3FSIM15_POSN                            0x7
#define _COG3FSIM1_G3FSIM15_POSITION                        0x7
#define _COG3FSIM1_G3FSIM15_SIZE                            0x1
#define _COG3FSIM1_G3FSIM15_LENGTH                          0x1
#define _COG3FSIM1_G3FSIM15_MASK                            0x80

// Register: COG3ASD0
#define COG3ASD0 COG3ASD0
extern volatile unsigned char           COG3ASD0            __at(0x81D);
#ifndef _LIB_BUILD
asm("COG3ASD0 equ 081Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ASDAC                  :2;
        unsigned ASDBD                  :2;
        unsigned ASREN                  :1;
        unsigned ASE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned ASDAC0                 :1;
        unsigned ASDAC1                 :1;
        unsigned ASDBD0                 :1;
        unsigned ASDBD1                 :1;
        unsigned ARSEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G3ASDAC                :2;
        unsigned G3ASDBD                :2;
        unsigned G3ARSEN                :1;
        unsigned G3ASE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G3ASDAC0               :1;
        unsigned G3ASDAC1               :1;
        unsigned G3ASDBD0               :1;
        unsigned G3ASDBD1               :1;
        unsigned G3ASREN                :1;
    };
} COG3ASD0bits_t;
