MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile COG4DBRbits_t COG4DBRbits __at(0x891);
// bitfield macros
#define _COG4DBR_DBR_POSN                                   0x0
#define _COG4DBR_DBR_POSITION                               0x0
#define _COG4DBR_DBR_SIZE                                   0x6
#define _COG4DBR_DBR_LENGTH                                 0x6
#define _COG4DBR_DBR_MASK                                   0x3F
#define _COG4DBR_DBR0_POSN                                  0x0
#define _COG4DBR_DBR0_POSITION                              0x0
#define _COG4DBR_DBR0_SIZE                                  0x1
#define _COG4DBR_DBR0_LENGTH                                0x1
#define _COG4DBR_DBR0_MASK                                  0x1
#define _COG4DBR_DBR1_POSN                                  0x1
#define _COG4DBR_DBR1_POSITION                              0x1
#define _COG4DBR_DBR1_SIZE                                  0x1
#define _COG4DBR_DBR1_LENGTH                                0x1
#define _COG4DBR_DBR1_MASK                                  0x2
#define _COG4DBR_DBR2_POSN                                  0x2
#define _COG4DBR_DBR2_POSITION                              0x2
#define _COG4DBR_DBR2_SIZE                                  0x1
#define _COG4DBR_DBR2_LENGTH                                0x1
#define _COG4DBR_DBR2_MASK                                  0x4
#define _COG4DBR_DBR3_POSN                                  0x3
#define _COG4DBR_DBR3_POSITION                              0x3
#define _COG4DBR_DBR3_SIZE                                  0x1
#define _COG4DBR_DBR3_LENGTH                                0x1
#define _COG4DBR_DBR3_MASK                                  0x8
#define _COG4DBR_DBR4_POSN                                  0x4
#define _COG4DBR_DBR4_POSITION                              0x4
#define _COG4DBR_DBR4_SIZE                                  0x1
#define _COG4DBR_DBR4_LENGTH                                0x1
#define _COG4DBR_DBR4_MASK                                  0x10
#define _COG4DBR_DBR5_POSN                                  0x5
#define _COG4DBR_DBR5_POSITION                              0x5
#define _COG4DBR_DBR5_SIZE                                  0x1
#define _COG4DBR_DBR5_LENGTH                                0x1
#define _COG4DBR_DBR5_MASK                                  0x20
#define _COG4DBR_G4DBR0_POSN                                0x0
#define _COG4DBR_G4DBR0_POSITION                            0x0
#define _COG4DBR_G4DBR0_SIZE                                0x1
#define _COG4DBR_G4DBR0_LENGTH                              0x1
#define _COG4DBR_G4DBR0_MASK                                0x1
#define _COG4DBR_G4DBR1_POSN                                0x1
#define _COG4DBR_G4DBR1_POSITION                            0x1
#define _COG4DBR_G4DBR1_SIZE                                0x1
#define _COG4DBR_G4DBR1_LENGTH                              0x1
#define _COG4DBR_G4DBR1_MASK                                0x2
#define _COG4DBR_G4DBR2_POSN                                0x2
#define _COG4DBR_G4DBR2_POSITION                            0x2
#define _COG4DBR_G4DBR2_SIZE                                0x1
#define _COG4DBR_G4DBR2_LENGTH                              0x1
#define _COG4DBR_G4DBR2_MASK                                0x4
#define _COG4DBR_G4DBR3_POSN                                0x3
#define _COG4DBR_G4DBR3_POSITION                            0x3
#define _COG4DBR_G4DBR3_SIZE                                0x1
#define _COG4DBR_G4DBR3_LENGTH                              0x1
#define _COG4DBR_G4DBR3_MASK                                0x8
#define _COG4DBR_G4DBR4_POSN                                0x4
#define _COG4DBR_G4DBR4_POSITION                            0x4
#define _COG4DBR_G4DBR4_SIZE                                0x1
#define _COG4DBR_G4DBR4_LENGTH                              0x1
#define _COG4DBR_G4DBR4_MASK                                0x10
#define _COG4DBR_G4DBR5_POSN                                0x5
#define _COG4DBR_G4DBR5_POSITION                            0x5
#define _COG4DBR_G4DBR5_SIZE                                0x1
#define _COG4DBR_G4DBR5_LENGTH                              0x1
#define _COG4DBR_G4DBR5_MASK                                0x20

// Register: COG4DBF
#define COG4DBF COG4DBF
extern volatile unsigned char           COG4DBF             __at(0x892);
#ifndef _LIB_BUILD
asm("COG4DBF equ 0892h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned G4DBF0                 :1;
        unsigned G4DBF1                 :1;
        unsigned G4DBF2                 :1;
        unsigned G4DBF3                 :1;
        unsigned G4DBF4                 :1;
        unsigned G4DBF5                 :1;
    };
    struct {
        unsigned G4DBF                  :6;
    };
} COG4DBFbits_t;
extern volatile COG4DBFbits_t COG4DBFbits __at(0x892);
// bitfield macros
#define _COG4DBF_DBF0_POSN                                  0x0
#define _COG4DBF_DBF0_POSITION                              0x0
#define _COG4DBF_DBF0_SIZE                                  0x1
#define _COG4DBF_DBF0_LENGTH                                0x1
#define _COG4DBF_DBF0_MASK                                  0x1
#define _COG4DBF_DBF1_POSN                                  0x1
#define _COG4DBF_DBF1_POSITION                              0x1
#define _COG4DBF_DBF1_SIZE                                  0x1
#define _COG4DBF_DBF1_LENGTH                                0x1
#define _COG4DBF_DBF1_MASK                                  0x2
#define _COG4DBF_DBF2_POSN                                  0x2
#define _COG4DBF_DBF2_POSITION                              0x2
#define _COG4DBF_DBF2_SIZE                                  0x1
#define _COG4DBF_DBF2_LENGTH                                0x1
#define _COG4DBF_DBF2_MASK                                  0x4
#define _COG4DBF_DBF3_POSN                                  0x3
#define _COG4DBF_DBF3_POSITION                              0x3
#define _COG4DBF_DBF3_SIZE                                  0x1
#define _COG4DBF_DBF3_LENGTH                                0x1
#define _COG4DBF_DBF3_MASK                                  0x8
#define _COG4DBF_DBF4_POSN                                  0x4
#define _COG4DBF_DBF4_POSITION                              0x4
#define _COG4DBF_DBF4_SIZE                                  0x1
#define _COG4DBF_DBF4_LENGTH                                0x1
#define _COG4DBF_DBF4_MASK                                  0x10
#define _COG4DBF_DBF5_POSN                                  0x5
#define _COG4DBF_DBF5_POSITION                              0x5
#define _COG4DBF_DBF5_SIZE                                  0x1
#define _COG4DBF_DBF5_LENGTH                                0x1
#define _COG4DBF_DBF5_MASK                                  0x20
#define _COG4DBF_G4DBF0_POSN                                0x0
#define _COG4DBF_G4DBF0_POSITION                            0x0
#define _COG4DBF_G4DBF0_SIZE                                0x1
#define _COG4DBF_G4DBF0_LENGTH                              0x1
#define _COG4DBF_G4DBF0_MASK                                0x1
#define _COG4DBF_G4DBF1_POSN                                0x1
#define _COG4DBF_G4DBF1_POSITION                            0x1
#define _COG4DBF_G4DBF1_SIZE                                0x1
#define _COG4DBF_G4DBF1_LENGTH                              0x1
#define _COG4DBF_G4DBF1_MASK                                0x2
#define _COG4DBF_G4DBF2_POSN                                0x2
#define _COG4DBF_G4DBF2_POSITION                            0x2
#define _COG4DBF_G4DBF2_SIZE                                0x1
#define _COG4DBF_G4DBF2_LENGTH                              0x1
#define _COG4DBF_G4DBF2_MASK                                0x4
#define _COG4DBF_G4DBF3_POSN                                0x3
#define _COG4DBF_G4DBF3_POSITION                            0x3
#define _COG4DBF_G4DBF3_SIZE                                0x1
#define _COG4DBF_G4DBF3_LENGTH                              0x1
#define _COG4DBF_G4DBF3_MASK                                0x8
#define _COG4DBF_G4DBF4_POSN                                0x4
#define _COG4DBF_G4DBF4_POSITION                            0x4
#define _COG4DBF_G4DBF4_SIZE                                0x1
#define _COG4DBF_G4DBF4_LENGTH                              0x1
#define _COG4DBF_G4DBF4_MASK                                0x10
#define _COG4DBF_G4DBF5_POSN                                0x5
#define _COG4DBF_G4DBF5_POSITION                            0x5
#define _COG4DBF_G4DBF5_SIZE                                0x1
#define _COG4DBF_G4DBF5_LENGTH                              0x1
#define _COG4DBF_G4DBF5_MASK                                0x20
#define _COG4DBF_G4DBF_POSN                                 0x0
#define _COG4DBF_G4DBF_POSITION                             0x0
#define _COG4DBF_G4DBF_SIZE                                 0x6
#define _COG4DBF_G4DBF_LENGTH                               0x6
#define _COG4DBF_G4DBF_MASK                                 0x3F

// Register: COG4CON0
#define COG4CON0 COG4CON0
extern volatile unsigned char           COG4CON0            __at(0x893);
#ifndef _LIB_BUILD
asm("COG4CON0 equ 0893h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD                     :3;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD0                    :1;
        unsigned MD1                    :1;
        unsigned MD2                    :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned G4MD                   :3;
        unsigned G4CS                   :2;
        unsigned                        :1;
        unsigned G4LD                   :1;
        unsigned G4EN                   :1;
    };
    struct {
        unsigned G4MD0                  :1;
        unsigned G4MD1                  :1;
        unsigned G4MD2                  :1;
        unsigned G4CS0                  :1;
        unsigned G4CS1                  :1;
    };
} COG4CON0bits_t;
