MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile COG4CON0bits_t COG4CON0bits __at(0x893);
// bitfield macros
#define _COG4CON0_MD_POSN                                   0x0
#define _COG4CON0_MD_POSITION                               0x0
#define _COG4CON0_MD_SIZE                                   0x3
#define _COG4CON0_MD_LENGTH                                 0x3
#define _COG4CON0_MD_MASK                                   0x7
#define _COG4CON0_CS_POSN                                   0x3
#define _COG4CON0_CS_POSITION                               0x3
#define _COG4CON0_CS_SIZE                                   0x2
#define _COG4CON0_CS_LENGTH                                 0x2
#define _COG4CON0_CS_MASK                                   0x18
#define _COG4CON0_LD_POSN                                   0x6
#define _COG4CON0_LD_POSITION                               0x6
#define _COG4CON0_LD_SIZE                                   0x1
#define _COG4CON0_LD_LENGTH                                 0x1
#define _COG4CON0_LD_MASK                                   0x40
#define _COG4CON0_EN_POSN                                   0x7
#define _COG4CON0_EN_POSITION                               0x7
#define _COG4CON0_EN_SIZE                                   0x1
#define _COG4CON0_EN_LENGTH                                 0x1
#define _COG4CON0_EN_MASK                                   0x80
#define _COG4CON0_MD0_POSN                                  0x0
#define _COG4CON0_MD0_POSITION                              0x0
#define _COG4CON0_MD0_SIZE                                  0x1
#define _COG4CON0_MD0_LENGTH                                0x1
#define _COG4CON0_MD0_MASK                                  0x1
#define _COG4CON0_MD1_POSN                                  0x1
#define _COG4CON0_MD1_POSITION                              0x1
#define _COG4CON0_MD1_SIZE                                  0x1
#define _COG4CON0_MD1_LENGTH                                0x1
#define _COG4CON0_MD1_MASK                                  0x2
#define _COG4CON0_MD2_POSN                                  0x2
#define _COG4CON0_MD2_POSITION                              0x2
#define _COG4CON0_MD2_SIZE                                  0x1
#define _COG4CON0_MD2_LENGTH                                0x1
#define _COG4CON0_MD2_MASK                                  0x4
#define _COG4CON0_CS0_POSN                                  0x3
#define _COG4CON0_CS0_POSITION                              0x3
#define _COG4CON0_CS0_SIZE                                  0x1
#define _COG4CON0_CS0_LENGTH                                0x1
#define _COG4CON0_CS0_MASK                                  0x8
#define _COG4CON0_CS1_POSN                                  0x4
#define _COG4CON0_CS1_POSITION                              0x4
#define _COG4CON0_CS1_SIZE                                  0x1
#define _COG4CON0_CS1_LENGTH                                0x1
#define _COG4CON0_CS1_MASK                                  0x10
#define _COG4CON0_G4MD_POSN                                 0x0
#define _COG4CON0_G4MD_POSITION                             0x0
#define _COG4CON0_G4MD_SIZE                                 0x3
#define _COG4CON0_G4MD_LENGTH                               0x3
#define _COG4CON0_G4MD_MASK                                 0x7
#define _COG4CON0_G4CS_POSN                                 0x3
#define _COG4CON0_G4CS_POSITION                             0x3
#define _COG4CON0_G4CS_SIZE                                 0x2
#define _COG4CON0_G4CS_LENGTH                               0x2
#define _COG4CON0_G4CS_MASK                                 0x18
#define _COG4CON0_G4LD_POSN                                 0x6
#define _COG4CON0_G4LD_POSITION                             0x6
#define _COG4CON0_G4LD_SIZE                                 0x1
#define _COG4CON0_G4LD_LENGTH                               0x1
#define _COG4CON0_G4LD_MASK                                 0x40
#define _COG4CON0_G4EN_POSN                                 0x7
#define _COG4CON0_G4EN_POSITION                             0x7
#define _COG4CON0_G4EN_SIZE                                 0x1
#define _COG4CON0_G4EN_LENGTH                               0x1
#define _COG4CON0_G4EN_MASK                                 0x80
#define _COG4CON0_G4MD0_POSN                                0x0
#define _COG4CON0_G4MD0_POSITION                            0x0
#define _COG4CON0_G4MD0_SIZE                                0x1
#define _COG4CON0_G4MD0_LENGTH                              0x1
#define _COG4CON0_G4MD0_MASK                                0x1
#define _COG4CON0_G4MD1_POSN                                0x1
#define _COG4CON0_G4MD1_POSITION                            0x1
#define _COG4CON0_G4MD1_SIZE                                0x1
#define _COG4CON0_G4MD1_LENGTH                              0x1
#define _COG4CON0_G4MD1_MASK                                0x2
#define _COG4CON0_G4MD2_POSN                                0x2
#define _COG4CON0_G4MD2_POSITION                            0x2
#define _COG4CON0_G4MD2_SIZE                                0x1
#define _COG4CON0_G4MD2_LENGTH                              0x1
#define _COG4CON0_G4MD2_MASK                                0x4
#define _COG4CON0_G4CS0_POSN                                0x3
#define _COG4CON0_G4CS0_POSITION                            0x3
#define _COG4CON0_G4CS0_SIZE                                0x1
#define _COG4CON0_G4CS0_LENGTH                              0x1
#define _COG4CON0_G4CS0_MASK                                0x8
#define _COG4CON0_G4CS1_POSN                                0x4
#define _COG4CON0_G4CS1_POSITION                            0x4
#define _COG4CON0_G4CS1_SIZE                                0x1
#define _COG4CON0_G4CS1_LENGTH                              0x1
#define _COG4CON0_G4CS1_MASK                                0x10

// Register: COG4CON1
#define COG4CON1 COG4CON1
extern volatile unsigned char           COG4CON1            __at(0x894);
#ifndef _LIB_BUILD
asm("COG4CON1 equ 0894h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :2;
        unsigned FDBS                   :1;
        unsigned RDBS                   :1;
    };
    struct {
        unsigned G4POLA                 :1;
        unsigned G4POLB                 :1;
        unsigned G4POLC                 :1;
        unsigned G4POLD                 :1;
        unsigned                        :2;
        unsigned G4FDBS                 :1;
        unsigned G4RDBS                 :1;
    };
} COG4CON1bits_t;
extern volatile COG4CON1bits_t COG4CON1bits __at(0x894);
// bitfield macros
#define _COG4CON1_POLA_POSN                                 0x0
#define _COG4CON1_POLA_POSITION                             0x0
#define _COG4CON1_POLA_SIZE                                 0x1
#define _COG4CON1_POLA_LENGTH                               0x1
#define _COG4CON1_POLA_MASK                                 0x1
#define _COG4CON1_POLB_POSN                                 0x1
#define _COG4CON1_POLB_POSITION                             0x1
#define _COG4CON1_POLB_SIZE                                 0x1
#define _COG4CON1_POLB_LENGTH                               0x1
#define _COG4CON1_POLB_MASK                                 0x2
#define _COG4CON1_POLC_POSN                                 0x2
#define _COG4CON1_POLC_POSITION                             0x2
#define _COG4CON1_POLC_SIZE                                 0x1
#define _COG4CON1_POLC_LENGTH                               0x1
#define _COG4CON1_POLC_MASK                                 0x4
#define _COG4CON1_POLD_POSN                                 0x3
#define _COG4CON1_POLD_POSITION                             0x3
#define _COG4CON1_POLD_SIZE                                 0x1
#define _COG4CON1_POLD_LENGTH                               0x1
#define _COG4CON1_POLD_MASK                                 0x8
#define _COG4CON1_FDBS_POSN                                 0x6
#define _COG4CON1_FDBS_POSITION                             0x6
#define _COG4CON1_FDBS_SIZE                                 0x1
#define _COG4CON1_FDBS_LENGTH                               0x1
#define _COG4CON1_FDBS_MASK                                 0x40
#define _COG4CON1_RDBS_POSN                                 0x7
#define _COG4CON1_RDBS_POSITION                             0x7
#define _COG4CON1_RDBS_SIZE                                 0x1
#define _COG4CON1_RDBS_LENGTH                               0x1
#define _COG4CON1_RDBS_MASK                                 0x80
#define _COG4CON1_G4POLA_POSN                               0x0
#define _COG4CON1_G4POLA_POSITION                           0x0
#define _COG4CON1_G4POLA_SIZE                               0x1
#define _COG4CON1_G4POLA_LENGTH                             0x1
#define _COG4CON1_G4POLA_MASK                               0x1
#define _COG4CON1_G4POLB_POSN                               0x1
#define _COG4CON1_G4POLB_POSITION                           0x1
#define _COG4CON1_G4POLB_SIZE                               0x1
#define _COG4CON1_G4POLB_LENGTH                             0x1
#define _COG4CON1_G4POLB_MASK                               0x2
#define _COG4CON1_G4POLC_POSN                               0x2
#define _COG4CON1_G4POLC_POSITION                           0x2
#define _COG4CON1_G4POLC_SIZE                               0x1
#define _COG4CON1_G4POLC_LENGTH                             0x1
#define _COG4CON1_G4POLC_MASK                               0x4
#define _COG4CON1_G4POLD_POSN                               0x3
#define _COG4CON1_G4POLD_POSITION                           0x3
#define _COG4CON1_G4POLD_SIZE                               0x1
#define _COG4CON1_G4POLD_LENGTH                             0x1
#define _COG4CON1_G4POLD_MASK                               0x8
#define _COG4CON1_G4FDBS_POSN                               0x6
#define _COG4CON1_G4FDBS_POSITION                           0x6
#define _COG4CON1_G4FDBS_SIZE                               0x1
#define _COG4CON1_G4FDBS_LENGTH                             0x1
#define _COG4CON1_G4FDBS_MASK                               0x40
#define _COG4CON1_G4RDBS_POSN                               0x7
#define _COG4CON1_G4RDBS_POSITION                           0x7
#define _COG4CON1_G4RDBS_SIZE                               0x1
#define _COG4CON1_G4RDBS_LENGTH                             0x1
#define _COG4CON1_G4RDBS_MASK                               0x80

// Register: COG4RIS0
#define COG4RIS0 COG4RIS0
extern volatile unsigned char           COG4RIS0            __at(0x895);
#ifndef _LIB_BUILD
asm("COG4RIS0 equ 0895h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS0                   :1;
        unsigned RIS1                   :1;
        unsigned RIS2                   :1;
        unsigned RIS3                   :1;
        unsigned RIS4                   :1;
        unsigned RIS5                   :1;
        unsigned RIS6                   :1;
        unsigned RIS7                   :1;
    };
    struct {
        unsigned G4RIS0                 :1;
        unsigned G4RIS1                 :1;
        unsigned G4RIS2                 :1;
        unsigned G4RIS3                 :1;
        unsigned G4RIS4                 :1;
        unsigned G4RIS5                 :1;
        unsigned G4RIS6                 :1;
        unsigned G4RIS7                 :1;
    };
} COG4RIS0bits_t;
extern volatile COG4RIS0bits_t COG4RIS0bits __at(0x895);
// bitfield macros
#define _COG4RIS0_RIS0_POSN                                 0x0
#define _COG4RIS0_RIS0_POSITION                             0x0
#define _COG4RIS0_RIS0_SIZE                                 0x1
#define _COG4RIS0_RIS0_LENGTH                               0x1
#define _COG4RIS0_RIS0_MASK                                 0x1
#define _COG4RIS0_RIS1_POSN                                 0x1
#define _COG4RIS0_RIS1_POSITION                             0x1
#define _COG4RIS0_RIS1_SIZE                                 0x1
#define _COG4RIS0_RIS1_LENGTH                               0x1
#define _COG4RIS0_RIS1_MASK                                 0x2
#define _COG4RIS0_RIS2_POSN                                 0x2
#define _COG4RIS0_RIS2_POSITION                             0x2
#define _COG4RIS0_RIS2_SIZE                                 0x1
#define _COG4RIS0_RIS2_LENGTH                               0x1
#define _COG4RIS0_RIS2_MASK                                 0x4
#define _COG4RIS0_RIS3_POSN                                 0x3
#define _COG4RIS0_RIS3_POSITION                             0x3
#define _COG4RIS0_RIS3_SIZE                                 0x1
#define _COG4RIS0_RIS3_LENGTH                               0x1
#define _COG4RIS0_RIS3_MASK                                 0x8
#define _COG4RIS0_RIS4_POSN                                 0x4
#define _COG4RIS0_RIS4_POSITION                             0x4
#define _COG4RIS0_RIS4_SIZE                                 0x1
#define _COG4RIS0_RIS4_LENGTH                               0x1
#define _COG4RIS0_RIS4_MASK                                 0x10
#define _COG4RIS0_RIS5_POSN                                 0x5
#define _COG4RIS0_RIS5_POSITION                             0x5
#define _COG4RIS0_RIS5_SIZE                                 0x1
#define _COG4RIS0_RIS5_LENGTH                               0x1
#define _COG4RIS0_RIS5_MASK                                 0x20
#define _COG4RIS0_RIS6_POSN                                 0x6
#define _COG4RIS0_RIS6_POSITION                             0x6
#define _COG4RIS0_RIS6_SIZE                                 0x1
#define _COG4RIS0_RIS6_LENGTH                               0x1
#define _COG4RIS0_RIS6_MASK                                 0x40
#define _COG4RIS0_RIS7_POSN                                 0x7
#define _COG4RIS0_RIS7_POSITION                             0x7
#define _COG4RIS0_RIS7_SIZE                                 0x1
#define _COG4RIS0_RIS7_LENGTH                               0x1
#define _COG4RIS0_RIS7_MASK                                 0x80
#define _COG4RIS0_G4RIS0_POSN                               0x0
#define _COG4RIS0_G4RIS0_POSITION                           0x0
#define _COG4RIS0_G4RIS0_SIZE                               0x1
#define _COG4RIS0_G4RIS0_LENGTH                             0x1
#define _COG4RIS0_G4RIS0_MASK                               0x1
#define _COG4RIS0_G4RIS1_POSN                               0x1
#define _COG4RIS0_G4RIS1_POSITION                           0x1
#define _COG4RIS0_G4RIS1_SIZE                               0x1
#define _COG4RIS0_G4RIS1_LENGTH                             0x1
#define _COG4RIS0_G4RIS1_MASK                               0x2
#define _COG4RIS0_G4RIS2_POSN                               0x2
#define _COG4RIS0_G4RIS2_POSITION                           0x2
#define _COG4RIS0_G4RIS2_SIZE                               0x1
#define _COG4RIS0_G4RIS2_LENGTH                             0x1
#define _COG4RIS0_G4RIS2_MASK                               0x4
#define _COG4RIS0_G4RIS3_POSN                               0x3
#define _COG4RIS0_G4RIS3_POSITION                           0x3
#define _COG4RIS0_G4RIS3_SIZE                               0x1
#define _COG4RIS0_G4RIS3_LENGTH                             0x1
#define _COG4RIS0_G4RIS3_MASK                               0x8
#define _COG4RIS0_G4RIS4_POSN                               0x4
#define _COG4RIS0_G4RIS4_POSITION                           0x4
#define _COG4RIS0_G4RIS4_SIZE                               0x1
#define _COG4RIS0_G4RIS4_LENGTH                             0x1
#define _COG4RIS0_G4RIS4_MASK                               0x10
#define _COG4RIS0_G4RIS5_POSN                               0x5
#define _COG4RIS0_G4RIS5_POSITION                           0x5
#define _COG4RIS0_G4RIS5_SIZE                               0x1
#define _COG4RIS0_G4RIS5_LENGTH                             0x1
#define _COG4RIS0_G4RIS5_MASK                               0x20
#define _COG4RIS0_G4RIS6_POSN                               0x6
#define _COG4RIS0_G4RIS6_POSITION                           0x6
#define _COG4RIS0_G4RIS6_SIZE                               0x1
#define _COG4RIS0_G4RIS6_LENGTH                             0x1
#define _COG4RIS0_G4RIS6_MASK                               0x40
#define _COG4RIS0_G4RIS7_POSN                               0x7
#define _COG4RIS0_G4RIS7_POSITION                           0x7
#define _COG4RIS0_G4RIS7_SIZE                               0x1
#define _COG4RIS0_G4RIS7_LENGTH                             0x1
#define _COG4RIS0_G4RIS7_MASK                               0x80

// Register: COG4RIS1
#define COG4RIS1 COG4RIS1
extern volatile unsigned char           COG4RIS1            __at(0x896);
#ifndef _LIB_BUILD
asm("COG4RIS1 equ 0896h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS8                   :1;
        unsigned RIS9                   :1;
        unsigned RIS10                  :1;
        unsigned RIS11                  :1;
        unsigned RIS12                  :1;
        unsigned RIS13                  :1;
        unsigned RIS14                  :1;
        unsigned RIS15                  :1;
    };
    struct {
        unsigned G4RIS8                 :1;
        unsigned G4RIS9                 :1;
        unsigned G4RIS10                :1;
        unsigned G4RIS11                :1;
        unsigned G4RIS12                :1;
        unsigned G4RIS13                :1;
        unsigned G4RIS14                :1;
        unsigned G4RIS15                :1;
    };
} COG4RIS1bits_t;
extern volatile COG4RIS1bits_t COG4RIS1bits __at(0x896);
// bitfield macros
#define _COG4RIS1_RIS8_POSN                                 0x0
#define _COG4RIS1_RIS8_POSITION                             0x0
#define _COG4RIS1_RIS8_SIZE                                 0x1
#define _COG4RIS1_RIS8_LENGTH                               0x1
#define _COG4RIS1_RIS8_MASK                                 0x1
#define _COG4RIS1_RIS9_POSN                                 0x1
#define _COG4RIS1_RIS9_POSITION                             0x1
#define _COG4RIS1_RIS9_SIZE                                 0x1
#define _COG4RIS1_RIS9_LENGTH                               0x1
#define _COG4RIS1_RIS9_MASK                                 0x2
#define _COG4RIS1_RIS10_POSN                                0x2
#define _COG4RIS1_RIS10_POSITION                            0x2
#define _COG4RIS1_RIS10_SIZE                                0x1
#define _COG4RIS1_RIS10_LENGTH                              0x1
#define _COG4RIS1_RIS10_MASK                                0x4
#define _COG4RIS1_RIS11_POSN                                0x3
#define _COG4RIS1_RIS11_POSITION                            0x3
#define _COG4RIS1_RIS11_SIZE                                0x1
#define _COG4RIS1_RIS11_LENGTH                              0x1
#define _COG4RIS1_RIS11_MASK                                0x8
#define _COG4RIS1_RIS12_POSN                                0x4
#define _COG4RIS1_RIS12_POSITION                            0x4
#define _COG4RIS1_RIS12_SIZE                                0x1
#define _COG4RIS1_RIS12_LENGTH                              0x1
#define _COG4RIS1_RIS12_MASK                                0x10
#define _COG4RIS1_RIS13_POSN                                0x5
#define _COG4RIS1_RIS13_POSITION                            0x5
#define _COG4RIS1_RIS13_SIZE                                0x1
#define _COG4RIS1_RIS13_LENGTH                              0x1
#define _COG4RIS1_RIS13_MASK                                0x20
#define _COG4RIS1_RIS14_POSN                                0x6
#define _COG4RIS1_RIS14_POSITION                            0x6
#define _COG4RIS1_RIS14_SIZE                                0x1
#define _COG4RIS1_RIS14_LENGTH                              0x1
#define _COG4RIS1_RIS14_MASK                                0x40
#define _COG4RIS1_RIS15_POSN                                0x7
#define _COG4RIS1_RIS15_POSITION                            0x7
#define _COG4RIS1_RIS15_SIZE                                0x1
#define _COG4RIS1_RIS15_LENGTH                              0x1
#define _COG4RIS1_RIS15_MASK                                0x80
#define _COG4RIS1_G4RIS8_POSN                               0x0
#define _COG4RIS1_G4RIS8_POSITION                           0x0
#define _COG4RIS1_G4RIS8_SIZE                               0x1
#define _COG4RIS1_G4RIS8_LENGTH                             0x1
#define _COG4RIS1_G4RIS8_MASK                               0x1
#define _COG4RIS1_G4RIS9_POSN                               0x1
#define _COG4RIS1_G4RIS9_POSITION                           0x1
#define _COG4RIS1_G4RIS9_SIZE                               0x1
#define _COG4RIS1_G4RIS9_LENGTH                             0x1
#define _COG4RIS1_G4RIS9_MASK                               0x2
#define _COG4RIS1_G4RIS10_POSN                              0x2
#define _COG4RIS1_G4RIS10_POSITION                          0x2
#define _COG4RIS1_G4RIS10_SIZE                              0x1
#define _COG4RIS1_G4RIS10_LENGTH                            0x1
#define _COG4RIS1_G4RIS10_MASK                              0x4
#define _COG4RIS1_G4RIS11_POSN                              0x3
#define _COG4RIS1_G4RIS11_POSITION                          0x3
#define _COG4RIS1_G4RIS11_SIZE                              0x1
#define _COG4RIS1_G4RIS11_LENGTH                            0x1
#define _COG4RIS1_G4RIS11_MASK                              0x8
#define _COG4RIS1_G4RIS12_POSN                              0x4
#define _COG4RIS1_G4RIS12_POSITION                          0x4
#define _COG4RIS1_G4RIS12_SIZE                              0x1
#define _COG4RIS1_G4RIS12_LENGTH                            0x1
#define _COG4RIS1_G4RIS12_MASK                              0x10
#define _COG4RIS1_G4RIS13_POSN                              0x5
#define _COG4RIS1_G4RIS13_POSITION                          0x5
#define _COG4RIS1_G4RIS13_SIZE                              0x1
#define _COG4RIS1_G4RIS13_LENGTH                            0x1
#define _COG4RIS1_G4RIS13_MASK                              0x20
#define _COG4RIS1_G4RIS14_POSN                              0x6
#define _COG4RIS1_G4RIS14_POSITION                          0x6
#define _COG4RIS1_G4RIS14_SIZE                              0x1
#define _COG4RIS1_G4RIS14_LENGTH                            0x1
#define _COG4RIS1_G4RIS14_MASK                              0x40
#define _COG4RIS1_G4RIS15_POSN                              0x7
#define _COG4RIS1_G4RIS15_POSITION                          0x7
#define _COG4RIS1_G4RIS15_SIZE                              0x1
#define _COG4RIS1_G4RIS15_LENGTH                            0x1
#define _COG4RIS1_G4RIS15_MASK                              0x80

