MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
// Register: CM8CON1
#define CM8CON1 CM8CON1
extern volatile unsigned char           CM8CON1             __at(0x91D);
#ifndef _LIB_BUILD
asm("CM8CON1 equ 091Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C8INTN                 :1;
        unsigned C8INTP                 :1;
    };
} CM8CON1bits_t;
extern volatile CM8CON1bits_t CM8CON1bits __at(0x91D);
// bitfield macros
#define _CM8CON1_INTN_POSN                                  0x0
#define _CM8CON1_INTN_POSITION                              0x0
#define _CM8CON1_INTN_SIZE                                  0x1
#define _CM8CON1_INTN_LENGTH                                0x1
#define _CM8CON1_INTN_MASK                                  0x1
#define _CM8CON1_INTP_POSN                                  0x1
#define _CM8CON1_INTP_POSITION                              0x1
#define _CM8CON1_INTP_SIZE                                  0x1
#define _CM8CON1_INTP_LENGTH                                0x1
#define _CM8CON1_INTP_MASK                                  0x2
#define _CM8CON1_C8INTN_POSN                                0x0
#define _CM8CON1_C8INTN_POSITION                            0x0
#define _CM8CON1_C8INTN_SIZE                                0x1
#define _CM8CON1_C8INTN_LENGTH                              0x1
#define _CM8CON1_C8INTN_MASK                                0x1
#define _CM8CON1_C8INTP_POSN                                0x1
#define _CM8CON1_C8INTP_POSITION                            0x1
#define _CM8CON1_C8INTP_SIZE                                0x1
#define _CM8CON1_C8INTP_LENGTH                              0x1
#define _CM8CON1_C8INTP_MASK                                0x2

// Register: CM8NSEL
#define CM8NSEL CM8NSEL
extern volatile unsigned char           CM8NSEL             __at(0x91E);
#ifndef _LIB_BUILD
asm("CM8NSEL equ 091Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C8NCH                  :4;
    };
    struct {
        unsigned C8NCH0                 :1;
        unsigned C8NCH1                 :1;
        unsigned C8NCH2                 :1;
        unsigned C8NCH3                 :1;
    };
} CM8NSELbits_t;
extern volatile CM8NSELbits_t CM8NSELbits __at(0x91E);
// bitfield macros
#define _CM8NSEL_NCH_POSN                                   0x0
#define _CM8NSEL_NCH_POSITION                               0x0
#define _CM8NSEL_NCH_SIZE                                   0x4
#define _CM8NSEL_NCH_LENGTH                                 0x4
#define _CM8NSEL_NCH_MASK                                   0xF
#define _CM8NSEL_C8NCH_POSN                                 0x0
#define _CM8NSEL_C8NCH_POSITION                             0x0
#define _CM8NSEL_C8NCH_SIZE                                 0x4
#define _CM8NSEL_C8NCH_LENGTH                               0x4
#define _CM8NSEL_C8NCH_MASK                                 0xF
#define _CM8NSEL_C8NCH0_POSN                                0x0
#define _CM8NSEL_C8NCH0_POSITION                            0x0
#define _CM8NSEL_C8NCH0_SIZE                                0x1
#define _CM8NSEL_C8NCH0_LENGTH                              0x1
#define _CM8NSEL_C8NCH0_MASK                                0x1
#define _CM8NSEL_C8NCH1_POSN                                0x1
#define _CM8NSEL_C8NCH1_POSITION                            0x1
#define _CM8NSEL_C8NCH1_SIZE                                0x1
#define _CM8NSEL_C8NCH1_LENGTH                              0x1
#define _CM8NSEL_C8NCH1_MASK                                0x2
#define _CM8NSEL_C8NCH2_POSN                                0x2
#define _CM8NSEL_C8NCH2_POSITION                            0x2
#define _CM8NSEL_C8NCH2_SIZE                                0x1
#define _CM8NSEL_C8NCH2_LENGTH                              0x1
#define _CM8NSEL_C8NCH2_MASK                                0x4
#define _CM8NSEL_C8NCH3_POSN                                0x3
#define _CM8NSEL_C8NCH3_POSITION                            0x3
#define _CM8NSEL_C8NCH3_SIZE                                0x1
#define _CM8NSEL_C8NCH3_LENGTH                              0x1
#define _CM8NSEL_C8NCH3_MASK                                0x8

// Register: CM8PSEL
#define CM8PSEL CM8PSEL
extern volatile unsigned char           CM8PSEL             __at(0x91F);
#ifndef _LIB_BUILD
asm("CM8PSEL equ 091Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C8PCH                  :4;
    };
    struct {
        unsigned C8PCH0                 :1;
        unsigned C8PCH1                 :1;
        unsigned C8PCH2                 :1;
        unsigned C8PCH3                 :1;
    };
} CM8PSELbits_t;
extern volatile CM8PSELbits_t CM8PSELbits __at(0x91F);
// bitfield macros
#define _CM8PSEL_PCH_POSN                                   0x0
#define _CM8PSEL_PCH_POSITION                               0x0
#define _CM8PSEL_PCH_SIZE                                   0x4
#define _CM8PSEL_PCH_LENGTH                                 0x4
#define _CM8PSEL_PCH_MASK                                   0xF
#define _CM8PSEL_PCH0_POSN                                  0x0
#define _CM8PSEL_PCH0_POSITION                              0x0
#define _CM8PSEL_PCH0_SIZE                                  0x1
#define _CM8PSEL_PCH0_LENGTH                                0x1
#define _CM8PSEL_PCH0_MASK                                  0x1
#define _CM8PSEL_PCH1_POSN                                  0x1
#define _CM8PSEL_PCH1_POSITION                              0x1
#define _CM8PSEL_PCH1_SIZE                                  0x1
#define _CM8PSEL_PCH1_LENGTH                                0x1
#define _CM8PSEL_PCH1_MASK                                  0x2
#define _CM8PSEL_PCH2_POSN                                  0x2
#define _CM8PSEL_PCH2_POSITION                              0x2
#define _CM8PSEL_PCH2_SIZE                                  0x1
#define _CM8PSEL_PCH2_LENGTH                                0x1
#define _CM8PSEL_PCH2_MASK                                  0x4
#define _CM8PSEL_PCH3_POSN                                  0x3
#define _CM8PSEL_PCH3_POSITION                              0x3
#define _CM8PSEL_PCH3_SIZE                                  0x1
#define _CM8PSEL_PCH3_LENGTH                                0x1
#define _CM8PSEL_PCH3_MASK                                  0x8
#define _CM8PSEL_C8PCH_POSN                                 0x0
#define _CM8PSEL_C8PCH_POSITION                             0x0
#define _CM8PSEL_C8PCH_SIZE                                 0x4
#define _CM8PSEL_C8PCH_LENGTH                               0x4
#define _CM8PSEL_C8PCH_MASK                                 0xF
#define _CM8PSEL_C8PCH0_POSN                                0x0
#define _CM8PSEL_C8PCH0_POSITION                            0x0
#define _CM8PSEL_C8PCH0_SIZE                                0x1
#define _CM8PSEL_C8PCH0_LENGTH                              0x1
#define _CM8PSEL_C8PCH0_MASK                                0x1
#define _CM8PSEL_C8PCH1_POSN                                0x1
#define _CM8PSEL_C8PCH1_POSITION                            0x1
#define _CM8PSEL_C8PCH1_SIZE                                0x1
#define _CM8PSEL_C8PCH1_LENGTH                              0x1
#define _CM8PSEL_C8PCH1_MASK                                0x2
#define _CM8PSEL_C8PCH2_POSN                                0x2
#define _CM8PSEL_C8PCH2_POSITION                            0x2
#define _CM8PSEL_C8PCH2_SIZE                                0x1
#define _CM8PSEL_C8PCH2_LENGTH                              0x1
#define _CM8PSEL_C8PCH2_MASK                                0x4
#define _CM8PSEL_C8PCH3_POSN                                0x3
#define _CM8PSEL_C8PCH3_POSITION                            0x3
#define _CM8PSEL_C8PCH3_SIZE                                0x1
#define _CM8PSEL_C8PCH3_LENGTH                              0x1
#define _CM8PSEL_C8PCH3_MASK                                0x8

// Register: MD4CON0
#define MD4CON0 MD4CON0
extern volatile unsigned char           MD4CON0             __at(0xD1B);
#ifndef _LIB_BUILD
asm("MD4CON0 equ 0D1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD4BIT                 :1;
        unsigned                        :3;
        unsigned MD4OPOL                :1;
        unsigned MD4OUT                 :1;
        unsigned                        :1;
        unsigned MD4EN                  :1;
    };
} MD4CON0bits_t;
