MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
// Register: PWM5DC
#define PWM5DC PWM5DC
extern volatile unsigned short          PWM5DC              __at(0xD93);
#ifndef _LIB_BUILD
asm("PWM5DC equ 0D93h");
#endif

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
extern volatile unsigned char           PWM5DCL             __at(0xD93);
#ifndef _LIB_BUILD
asm("PWM5DCL equ 0D93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM5DCL0               :1;
        unsigned PWM5DCL1               :1;
        unsigned PWM5DCL2               :1;
        unsigned PWM5DCL3               :1;
        unsigned PWM5DCL4               :1;
        unsigned PWM5DCL5               :1;
        unsigned PWM5DCL6               :1;
        unsigned PWM5DCL7               :1;
    };
    struct {
        unsigned PWM5DCL                :8;
    };
} PWM5DCLbits_t;
extern volatile PWM5DCLbits_t PWM5DCLbits __at(0xD93);
// bitfield macros
#define _PWM5DCL_DC_POSN                                    0x0
#define _PWM5DCL_DC_POSITION                                0x0
#define _PWM5DCL_DC_SIZE                                    0x8
#define _PWM5DCL_DC_LENGTH                                  0x8
#define _PWM5DCL_DC_MASK                                    0xFF
#define _PWM5DCL_PWM5DCL0_POSN                              0x0
#define _PWM5DCL_PWM5DCL0_POSITION                          0x0
#define _PWM5DCL_PWM5DCL0_SIZE                              0x1
#define _PWM5DCL_PWM5DCL0_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL0_MASK                              0x1
#define _PWM5DCL_PWM5DCL1_POSN                              0x1
#define _PWM5DCL_PWM5DCL1_POSITION                          0x1
#define _PWM5DCL_PWM5DCL1_SIZE                              0x1
#define _PWM5DCL_PWM5DCL1_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL1_MASK                              0x2
#define _PWM5DCL_PWM5DCL2_POSN                              0x2
#define _PWM5DCL_PWM5DCL2_POSITION                          0x2
#define _PWM5DCL_PWM5DCL2_SIZE                              0x1
#define _PWM5DCL_PWM5DCL2_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL2_MASK                              0x4
#define _PWM5DCL_PWM5DCL3_POSN                              0x3
#define _PWM5DCL_PWM5DCL3_POSITION                          0x3
#define _PWM5DCL_PWM5DCL3_SIZE                              0x1
#define _PWM5DCL_PWM5DCL3_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL3_MASK                              0x8
#define _PWM5DCL_PWM5DCL4_POSN                              0x4
#define _PWM5DCL_PWM5DCL4_POSITION                          0x4
#define _PWM5DCL_PWM5DCL4_SIZE                              0x1
#define _PWM5DCL_PWM5DCL4_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL4_MASK                              0x10
#define _PWM5DCL_PWM5DCL5_POSN                              0x5
#define _PWM5DCL_PWM5DCL5_POSITION                          0x5
#define _PWM5DCL_PWM5DCL5_SIZE                              0x1
#define _PWM5DCL_PWM5DCL5_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL5_MASK                              0x20
#define _PWM5DCL_PWM5DCL6_POSN                              0x6
#define _PWM5DCL_PWM5DCL6_POSITION                          0x6
#define _PWM5DCL_PWM5DCL6_SIZE                              0x1
#define _PWM5DCL_PWM5DCL6_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL6_MASK                              0x40
#define _PWM5DCL_PWM5DCL7_POSN                              0x7
#define _PWM5DCL_PWM5DCL7_POSITION                          0x7
#define _PWM5DCL_PWM5DCL7_SIZE                              0x1
#define _PWM5DCL_PWM5DCL7_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL7_MASK                              0x80
#define _PWM5DCL_PWM5DCL_POSN                               0x0
#define _PWM5DCL_PWM5DCL_POSITION                           0x0
#define _PWM5DCL_PWM5DCL_SIZE                               0x8
#define _PWM5DCL_PWM5DCL_LENGTH                             0x8
#define _PWM5DCL_PWM5DCL_MASK                               0xFF

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
extern volatile unsigned char           PWM5DCH             __at(0xD94);
#ifndef _LIB_BUILD
asm("PWM5DCH equ 0D94h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM5DCH0               :1;
        unsigned PWM5DCH1               :1;
        unsigned PWM5DCH2               :1;
        unsigned PWM5DCH3               :1;
        unsigned PWM5DCH4               :1;
        unsigned PWM5DCH5               :1;
        unsigned PWM5DCH6               :1;
        unsigned PWM5DCH7               :1;
    };
    struct {
        unsigned PWM5DCH                :8;
    };
} PWM5DCHbits_t;
extern volatile PWM5DCHbits_t PWM5DCHbits __at(0xD94);
// bitfield macros
#define _PWM5DCH_DC_POSN                                    0x0
#define _PWM5DCH_DC_POSITION                                0x0
#define _PWM5DCH_DC_SIZE                                    0x8
#define _PWM5DCH_DC_LENGTH                                  0x8
#define _PWM5DCH_DC_MASK                                    0xFF
#define _PWM5DCH_PWM5DCH0_POSN                              0x0
#define _PWM5DCH_PWM5DCH0_POSITION                          0x0
#define _PWM5DCH_PWM5DCH0_SIZE                              0x1
#define _PWM5DCH_PWM5DCH0_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH0_MASK                              0x1
#define _PWM5DCH_PWM5DCH1_POSN                              0x1
#define _PWM5DCH_PWM5DCH1_POSITION                          0x1
#define _PWM5DCH_PWM5DCH1_SIZE                              0x1
#define _PWM5DCH_PWM5DCH1_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH1_MASK                              0x2
#define _PWM5DCH_PWM5DCH2_POSN                              0x2
#define _PWM5DCH_PWM5DCH2_POSITION                          0x2
#define _PWM5DCH_PWM5DCH2_SIZE                              0x1
#define _PWM5DCH_PWM5DCH2_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH2_MASK                              0x4
#define _PWM5DCH_PWM5DCH3_POSN                              0x3
#define _PWM5DCH_PWM5DCH3_POSITION                          0x3
#define _PWM5DCH_PWM5DCH3_SIZE                              0x1
#define _PWM5DCH_PWM5DCH3_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH3_MASK                              0x8
#define _PWM5DCH_PWM5DCH4_POSN                              0x4
#define _PWM5DCH_PWM5DCH4_POSITION                          0x4
#define _PWM5DCH_PWM5DCH4_SIZE                              0x1
#define _PWM5DCH_PWM5DCH4_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH4_MASK                              0x10
#define _PWM5DCH_PWM5DCH5_POSN                              0x5
#define _PWM5DCH_PWM5DCH5_POSITION                          0x5
#define _PWM5DCH_PWM5DCH5_SIZE                              0x1
#define _PWM5DCH_PWM5DCH5_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH5_MASK                              0x20
#define _PWM5DCH_PWM5DCH6_POSN                              0x6
#define _PWM5DCH_PWM5DCH6_POSITION                          0x6
#define _PWM5DCH_PWM5DCH6_SIZE                              0x1
#define _PWM5DCH_PWM5DCH6_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH6_MASK                              0x40
#define _PWM5DCH_PWM5DCH7_POSN                              0x7
#define _PWM5DCH_PWM5DCH7_POSITION                          0x7
#define _PWM5DCH_PWM5DCH7_SIZE                              0x1
#define _PWM5DCH_PWM5DCH7_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH7_MASK                              0x80
#define _PWM5DCH_PWM5DCH_POSN                               0x0
#define _PWM5DCH_PWM5DCH_POSITION                           0x0
#define _PWM5DCH_PWM5DCH_SIZE                               0x8
#define _PWM5DCH_PWM5DCH_LENGTH                             0x8
#define _PWM5DCH_PWM5DCH_MASK                               0xFF

// Register: PWM5PR
#define PWM5PR PWM5PR
extern volatile unsigned short          PWM5PR              __at(0xD95);
#ifndef _LIB_BUILD
asm("PWM5PR equ 0D95h");
#endif

