MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
// Register: PWM5OFCON
#define PWM5OFCON PWM5OFCON
extern volatile unsigned char           PWM5OFCON           __at(0xDA0);
#ifndef _LIB_BUILD
asm("PWM5OFCON equ 0DA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM5OFS0               :1;
        unsigned PWM5OFS1               :1;
        unsigned                        :3;
        unsigned PWM5OFM0               :1;
        unsigned PWM5OFM1               :1;
    };
    struct {
        unsigned PWM5OFS                :2;
        unsigned                        :2;
        unsigned PWM5OFMC               :1;
        unsigned PWM5OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM5OFCONbits_t;
extern volatile PWM5OFCONbits_t PWM5OFCONbits __at(0xDA0);
// bitfield macros
#define _PWM5OFCON_OFS_POSN                                 0x0
#define _PWM5OFCON_OFS_POSITION                             0x0
#define _PWM5OFCON_OFS_SIZE                                 0x2
#define _PWM5OFCON_OFS_LENGTH                               0x2
#define _PWM5OFCON_OFS_MASK                                 0x3
#define _PWM5OFCON_OFO_POSN                                 0x4
#define _PWM5OFCON_OFO_POSITION                             0x4
#define _PWM5OFCON_OFO_SIZE                                 0x1
#define _PWM5OFCON_OFO_LENGTH                               0x1
#define _PWM5OFCON_OFO_MASK                                 0x10
#define _PWM5OFCON_OFM_POSN                                 0x5
#define _PWM5OFCON_OFM_POSITION                             0x5
#define _PWM5OFCON_OFM_SIZE                                 0x2
#define _PWM5OFCON_OFM_LENGTH                               0x2
#define _PWM5OFCON_OFM_MASK                                 0x60
#define _PWM5OFCON_PWM5OFS0_POSN                            0x0
#define _PWM5OFCON_PWM5OFS0_POSITION                        0x0
#define _PWM5OFCON_PWM5OFS0_SIZE                            0x1
#define _PWM5OFCON_PWM5OFS0_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFS0_MASK                            0x1
#define _PWM5OFCON_PWM5OFS1_POSN                            0x1
#define _PWM5OFCON_PWM5OFS1_POSITION                        0x1
#define _PWM5OFCON_PWM5OFS1_SIZE                            0x1
#define _PWM5OFCON_PWM5OFS1_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFS1_MASK                            0x2
#define _PWM5OFCON_PWM5OFM0_POSN                            0x5
#define _PWM5OFCON_PWM5OFM0_POSITION                        0x5
#define _PWM5OFCON_PWM5OFM0_SIZE                            0x1
#define _PWM5OFCON_PWM5OFM0_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFM0_MASK                            0x20
#define _PWM5OFCON_PWM5OFM1_POSN                            0x6
#define _PWM5OFCON_PWM5OFM1_POSITION                        0x6
#define _PWM5OFCON_PWM5OFM1_SIZE                            0x1
#define _PWM5OFCON_PWM5OFM1_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFM1_MASK                            0x40
#define _PWM5OFCON_PWM5OFS_POSN                             0x0
#define _PWM5OFCON_PWM5OFS_POSITION                         0x0
#define _PWM5OFCON_PWM5OFS_SIZE                             0x2
#define _PWM5OFCON_PWM5OFS_LENGTH                           0x2
#define _PWM5OFCON_PWM5OFS_MASK                             0x3
#define _PWM5OFCON_PWM5OFMC_POSN                            0x4
#define _PWM5OFCON_PWM5OFMC_POSITION                        0x4
#define _PWM5OFCON_PWM5OFMC_SIZE                            0x1
#define _PWM5OFCON_PWM5OFMC_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFMC_MASK                            0x10
#define _PWM5OFCON_PWM5OFM_POSN                             0x5
#define _PWM5OFCON_PWM5OFM_POSITION                         0x5
#define _PWM5OFCON_PWM5OFM_SIZE                             0x2
#define _PWM5OFCON_PWM5OFM_LENGTH                           0x2
#define _PWM5OFCON_PWM5OFM_MASK                             0x60
#define _PWM5OFCON_OFS0_POSN                                0x0
#define _PWM5OFCON_OFS0_POSITION                            0x0
#define _PWM5OFCON_OFS0_SIZE                                0x1
#define _PWM5OFCON_OFS0_LENGTH                              0x1
#define _PWM5OFCON_OFS0_MASK                                0x1
#define _PWM5OFCON_OFS1_POSN                                0x1
#define _PWM5OFCON_OFS1_POSITION                            0x1
#define _PWM5OFCON_OFS1_SIZE                                0x1
#define _PWM5OFCON_OFS1_LENGTH                              0x1
#define _PWM5OFCON_OFS1_MASK                                0x2
#define _PWM5OFCON_OFM0_POSN                                0x5
#define _PWM5OFCON_OFM0_POSITION                            0x5
#define _PWM5OFCON_OFM0_SIZE                                0x1
#define _PWM5OFCON_OFM0_LENGTH                              0x1
#define _PWM5OFCON_OFM0_MASK                                0x20
#define _PWM5OFCON_OFM1_POSN                                0x6
#define _PWM5OFCON_OFM1_POSITION                            0x6
#define _PWM5OFCON_OFM1_SIZE                                0x1
#define _PWM5OFCON_OFM1_LENGTH                              0x1
#define _PWM5OFCON_OFM1_MASK                                0x40

// Register: PWM6PH
#define PWM6PH PWM6PH
extern volatile unsigned short          PWM6PH              __at(0xDA1);
#ifndef _LIB_BUILD
asm("PWM6PH equ 0DA1h");
#endif

// Register: PWM6PHL
#define PWM6PHL PWM6PHL
extern volatile unsigned char           PWM6PHL             __at(0xDA1);
#ifndef _LIB_BUILD
asm("PWM6PHL equ 0DA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM6PHL0               :1;
        unsigned PWM6PHL1               :1;
        unsigned PWM6PHL2               :1;
        unsigned PWM6PHL3               :1;
        unsigned PWM6PHL4               :1;
        unsigned PWM6PHL5               :1;
        unsigned PWM6PHL6               :1;
        unsigned PWM6PHL7               :1;
    };
    struct {
        unsigned PWM6PHL                :8;
    };
} PWM6PHLbits_t;
extern volatile PWM6PHLbits_t PWM6PHLbits __at(0xDA1);
// bitfield macros
#define _PWM6PHL_PH_POSN                                    0x0
#define _PWM6PHL_PH_POSITION                                0x0
#define _PWM6PHL_PH_SIZE                                    0x8
#define _PWM6PHL_PH_LENGTH                                  0x8
#define _PWM6PHL_PH_MASK                                    0xFF
#define _PWM6PHL_PWM6PHL0_POSN                              0x0
#define _PWM6PHL_PWM6PHL0_POSITION                          0x0
#define _PWM6PHL_PWM6PHL0_SIZE                              0x1
#define _PWM6PHL_PWM6PHL0_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL0_MASK                              0x1
#define _PWM6PHL_PWM6PHL1_POSN                              0x1
#define _PWM6PHL_PWM6PHL1_POSITION                          0x1
#define _PWM6PHL_PWM6PHL1_SIZE                              0x1
#define _PWM6PHL_PWM6PHL1_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL1_MASK                              0x2
#define _PWM6PHL_PWM6PHL2_POSN                              0x2
#define _PWM6PHL_PWM6PHL2_POSITION                          0x2
#define _PWM6PHL_PWM6PHL2_SIZE                              0x1
#define _PWM6PHL_PWM6PHL2_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL2_MASK                              0x4
#define _PWM6PHL_PWM6PHL3_POSN                              0x3
#define _PWM6PHL_PWM6PHL3_POSITION                          0x3
#define _PWM6PHL_PWM6PHL3_SIZE                              0x1
#define _PWM6PHL_PWM6PHL3_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL3_MASK                              0x8
#define _PWM6PHL_PWM6PHL4_POSN                              0x4
#define _PWM6PHL_PWM6PHL4_POSITION                          0x4
#define _PWM6PHL_PWM6PHL4_SIZE                              0x1
#define _PWM6PHL_PWM6PHL4_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL4_MASK                              0x10
#define _PWM6PHL_PWM6PHL5_POSN                              0x5
#define _PWM6PHL_PWM6PHL5_POSITION                          0x5
#define _PWM6PHL_PWM6PHL5_SIZE                              0x1
#define _PWM6PHL_PWM6PHL5_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL5_MASK                              0x20
#define _PWM6PHL_PWM6PHL6_POSN                              0x6
#define _PWM6PHL_PWM6PHL6_POSITION                          0x6
#define _PWM6PHL_PWM6PHL6_SIZE                              0x1
#define _PWM6PHL_PWM6PHL6_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL6_MASK                              0x40
#define _PWM6PHL_PWM6PHL7_POSN                              0x7
#define _PWM6PHL_PWM6PHL7_POSITION                          0x7
#define _PWM6PHL_PWM6PHL7_SIZE                              0x1
#define _PWM6PHL_PWM6PHL7_LENGTH                            0x1
#define _PWM6PHL_PWM6PHL7_MASK                              0x80
#define _PWM6PHL_PWM6PHL_POSN                               0x0
#define _PWM6PHL_PWM6PHL_POSITION                           0x0
#define _PWM6PHL_PWM6PHL_SIZE                               0x8
#define _PWM6PHL_PWM6PHL_LENGTH                             0x8
#define _PWM6PHL_PWM6PHL_MASK                               0xFF

