MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile PWM11PRLbits_t PWM11PRLbits __at(0xDB5);
// bitfield macros
#define _PWM11PRL_PR_POSN                                   0x0
#define _PWM11PRL_PR_POSITION                               0x0
#define _PWM11PRL_PR_SIZE                                   0x8
#define _PWM11PRL_PR_LENGTH                                 0x8
#define _PWM11PRL_PR_MASK                                   0xFF
#define _PWM11PRL_PWM11PRL0_POSN                            0x0
#define _PWM11PRL_PWM11PRL0_POSITION                        0x0
#define _PWM11PRL_PWM11PRL0_SIZE                            0x1
#define _PWM11PRL_PWM11PRL0_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL0_MASK                            0x1
#define _PWM11PRL_PWM11PRL1_POSN                            0x1
#define _PWM11PRL_PWM11PRL1_POSITION                        0x1
#define _PWM11PRL_PWM11PRL1_SIZE                            0x1
#define _PWM11PRL_PWM11PRL1_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL1_MASK                            0x2
#define _PWM11PRL_PWM11PRL2_POSN                            0x2
#define _PWM11PRL_PWM11PRL2_POSITION                        0x2
#define _PWM11PRL_PWM11PRL2_SIZE                            0x1
#define _PWM11PRL_PWM11PRL2_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL2_MASK                            0x4
#define _PWM11PRL_PWM11PRL3_POSN                            0x3
#define _PWM11PRL_PWM11PRL3_POSITION                        0x3
#define _PWM11PRL_PWM11PRL3_SIZE                            0x1
#define _PWM11PRL_PWM11PRL3_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL3_MASK                            0x8
#define _PWM11PRL_PWM11PRL4_POSN                            0x4
#define _PWM11PRL_PWM11PRL4_POSITION                        0x4
#define _PWM11PRL_PWM11PRL4_SIZE                            0x1
#define _PWM11PRL_PWM11PRL4_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL4_MASK                            0x10
#define _PWM11PRL_PWM11PRL5_POSN                            0x5
#define _PWM11PRL_PWM11PRL5_POSITION                        0x5
#define _PWM11PRL_PWM11PRL5_SIZE                            0x1
#define _PWM11PRL_PWM11PRL5_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL5_MASK                            0x20
#define _PWM11PRL_PWM11PRL6_POSN                            0x6
#define _PWM11PRL_PWM11PRL6_POSITION                        0x6
#define _PWM11PRL_PWM11PRL6_SIZE                            0x1
#define _PWM11PRL_PWM11PRL6_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL6_MASK                            0x40
#define _PWM11PRL_PWM11PRL7_POSN                            0x7
#define _PWM11PRL_PWM11PRL7_POSITION                        0x7
#define _PWM11PRL_PWM11PRL7_SIZE                            0x1
#define _PWM11PRL_PWM11PRL7_LENGTH                          0x1
#define _PWM11PRL_PWM11PRL7_MASK                            0x80
#define _PWM11PRL_PWM11PRL_POSN                             0x0
#define _PWM11PRL_PWM11PRL_POSITION                         0x0
#define _PWM11PRL_PWM11PRL_SIZE                             0x8
#define _PWM11PRL_PWM11PRL_LENGTH                           0x8
#define _PWM11PRL_PWM11PRL_MASK                             0xFF

// Register: PWM11PRH
#define PWM11PRH PWM11PRH
extern volatile unsigned char           PWM11PRH            __at(0xDB6);
#ifndef _LIB_BUILD
asm("PWM11PRH equ 0DB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM11PRH0              :1;
        unsigned PWM11PRH1              :1;
        unsigned PWM11PRH2              :1;
        unsigned PWM11PRH3              :1;
        unsigned PWM11PRH4              :1;
        unsigned PWM11PRH5              :1;
        unsigned PWM11PRH6              :1;
        unsigned PWM11PRH7              :1;
    };
    struct {
        unsigned PWM11PRH               :8;
    };
} PWM11PRHbits_t;
extern volatile PWM11PRHbits_t PWM11PRHbits __at(0xDB6);
// bitfield macros
#define _PWM11PRH_PR_POSN                                   0x0
#define _PWM11PRH_PR_POSITION                               0x0
#define _PWM11PRH_PR_SIZE                                   0x8
#define _PWM11PRH_PR_LENGTH                                 0x8
#define _PWM11PRH_PR_MASK                                   0xFF
#define _PWM11PRH_PWM11PRH0_POSN                            0x0
#define _PWM11PRH_PWM11PRH0_POSITION                        0x0
#define _PWM11PRH_PWM11PRH0_SIZE                            0x1
#define _PWM11PRH_PWM11PRH0_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH0_MASK                            0x1
#define _PWM11PRH_PWM11PRH1_POSN                            0x1
#define _PWM11PRH_PWM11PRH1_POSITION                        0x1
#define _PWM11PRH_PWM11PRH1_SIZE                            0x1
#define _PWM11PRH_PWM11PRH1_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH1_MASK                            0x2
#define _PWM11PRH_PWM11PRH2_POSN                            0x2
#define _PWM11PRH_PWM11PRH2_POSITION                        0x2
#define _PWM11PRH_PWM11PRH2_SIZE                            0x1
#define _PWM11PRH_PWM11PRH2_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH2_MASK                            0x4
#define _PWM11PRH_PWM11PRH3_POSN                            0x3
#define _PWM11PRH_PWM11PRH3_POSITION                        0x3
#define _PWM11PRH_PWM11PRH3_SIZE                            0x1
#define _PWM11PRH_PWM11PRH3_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH3_MASK                            0x8
#define _PWM11PRH_PWM11PRH4_POSN                            0x4
#define _PWM11PRH_PWM11PRH4_POSITION                        0x4
#define _PWM11PRH_PWM11PRH4_SIZE                            0x1
#define _PWM11PRH_PWM11PRH4_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH4_MASK                            0x10
#define _PWM11PRH_PWM11PRH5_POSN                            0x5
#define _PWM11PRH_PWM11PRH5_POSITION                        0x5
#define _PWM11PRH_PWM11PRH5_SIZE                            0x1
#define _PWM11PRH_PWM11PRH5_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH5_MASK                            0x20
#define _PWM11PRH_PWM11PRH6_POSN                            0x6
#define _PWM11PRH_PWM11PRH6_POSITION                        0x6
#define _PWM11PRH_PWM11PRH6_SIZE                            0x1
#define _PWM11PRH_PWM11PRH6_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH6_MASK                            0x40
#define _PWM11PRH_PWM11PRH7_POSN                            0x7
#define _PWM11PRH_PWM11PRH7_POSITION                        0x7
#define _PWM11PRH_PWM11PRH7_SIZE                            0x1
#define _PWM11PRH_PWM11PRH7_LENGTH                          0x1
#define _PWM11PRH_PWM11PRH7_MASK                            0x80
#define _PWM11PRH_PWM11PRH_POSN                             0x0
#define _PWM11PRH_PWM11PRH_POSITION                         0x0
#define _PWM11PRH_PWM11PRH_SIZE                             0x8
#define _PWM11PRH_PWM11PRH_LENGTH                           0x8
#define _PWM11PRH_PWM11PRH_MASK                             0xFF

// Register: PWM11OF
#define PWM11OF PWM11OF
extern volatile unsigned short          PWM11OF             __at(0xDB7);
#ifndef _LIB_BUILD
asm("PWM11OF equ 0DB7h");
#endif

// Register: PWM11OFL
#define PWM11OFL PWM11OFL
extern volatile unsigned char           PWM11OFL            __at(0xDB7);
#ifndef _LIB_BUILD
asm("PWM11OFL equ 0DB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM11OFL0              :1;
        unsigned PWM11OFL1              :1;
        unsigned PWM11OFL2              :1;
        unsigned PWM11OFL3              :1;
        unsigned PWM11OFL4              :1;
        unsigned PWM11OFL5              :1;
        unsigned PWM11OFL6              :1;
        unsigned PWM11OFL7              :1;
    };
    struct {
        unsigned PWM11OFL               :8;
    };
} PWM11OFLbits_t;
