MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
// Register: PWM12PR
#define PWM12PR PWM12PR
extern volatile unsigned short          PWM12PR             __at(0xDC5);
#ifndef _LIB_BUILD
asm("PWM12PR equ 0DC5h");
#endif

// Register: PWM12PRL
#define PWM12PRL PWM12PRL
extern volatile unsigned char           PWM12PRL            __at(0xDC5);
#ifndef _LIB_BUILD
asm("PWM12PRL equ 0DC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM12PRL0              :1;
        unsigned PWM12PRL1              :1;
        unsigned PWM12PRL2              :1;
        unsigned PWM12PRL3              :1;
        unsigned PWM12PRL4              :1;
        unsigned PWM12PRL5              :1;
        unsigned PWM12PRL6              :1;
        unsigned PWM12PRL7              :1;
    };
    struct {
        unsigned PWM12PRL               :8;
    };
} PWM12PRLbits_t;
extern volatile PWM12PRLbits_t PWM12PRLbits __at(0xDC5);
// bitfield macros
#define _PWM12PRL_PR_POSN                                   0x0
#define _PWM12PRL_PR_POSITION                               0x0
#define _PWM12PRL_PR_SIZE                                   0x8
#define _PWM12PRL_PR_LENGTH                                 0x8
#define _PWM12PRL_PR_MASK                                   0xFF
#define _PWM12PRL_PWM12PRL0_POSN                            0x0
#define _PWM12PRL_PWM12PRL0_POSITION                        0x0
#define _PWM12PRL_PWM12PRL0_SIZE                            0x1
#define _PWM12PRL_PWM12PRL0_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL0_MASK                            0x1
#define _PWM12PRL_PWM12PRL1_POSN                            0x1
#define _PWM12PRL_PWM12PRL1_POSITION                        0x1
#define _PWM12PRL_PWM12PRL1_SIZE                            0x1
#define _PWM12PRL_PWM12PRL1_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL1_MASK                            0x2
#define _PWM12PRL_PWM12PRL2_POSN                            0x2
#define _PWM12PRL_PWM12PRL2_POSITION                        0x2
#define _PWM12PRL_PWM12PRL2_SIZE                            0x1
#define _PWM12PRL_PWM12PRL2_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL2_MASK                            0x4
#define _PWM12PRL_PWM12PRL3_POSN                            0x3
#define _PWM12PRL_PWM12PRL3_POSITION                        0x3
#define _PWM12PRL_PWM12PRL3_SIZE                            0x1
#define _PWM12PRL_PWM12PRL3_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL3_MASK                            0x8
#define _PWM12PRL_PWM12PRL4_POSN                            0x4
#define _PWM12PRL_PWM12PRL4_POSITION                        0x4
#define _PWM12PRL_PWM12PRL4_SIZE                            0x1
#define _PWM12PRL_PWM12PRL4_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL4_MASK                            0x10
#define _PWM12PRL_PWM12PRL5_POSN                            0x5
#define _PWM12PRL_PWM12PRL5_POSITION                        0x5
#define _PWM12PRL_PWM12PRL5_SIZE                            0x1
#define _PWM12PRL_PWM12PRL5_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL5_MASK                            0x20
#define _PWM12PRL_PWM12PRL6_POSN                            0x6
#define _PWM12PRL_PWM12PRL6_POSITION                        0x6
#define _PWM12PRL_PWM12PRL6_SIZE                            0x1
#define _PWM12PRL_PWM12PRL6_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL6_MASK                            0x40
#define _PWM12PRL_PWM12PRL7_POSN                            0x7
#define _PWM12PRL_PWM12PRL7_POSITION                        0x7
#define _PWM12PRL_PWM12PRL7_SIZE                            0x1
#define _PWM12PRL_PWM12PRL7_LENGTH                          0x1
#define _PWM12PRL_PWM12PRL7_MASK                            0x80
#define _PWM12PRL_PWM12PRL_POSN                             0x0
#define _PWM12PRL_PWM12PRL_POSITION                         0x0
#define _PWM12PRL_PWM12PRL_SIZE                             0x8
#define _PWM12PRL_PWM12PRL_LENGTH                           0x8
#define _PWM12PRL_PWM12PRL_MASK                             0xFF

// Register: PWM12PRH
#define PWM12PRH PWM12PRH
extern volatile unsigned char           PWM12PRH            __at(0xDC6);
#ifndef _LIB_BUILD
asm("PWM12PRH equ 0DC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM12PRH0              :1;
        unsigned PWM12PRH1              :1;
        unsigned PWM12PRH2              :1;
        unsigned PWM12PRH3              :1;
        unsigned PWM12PRH4              :1;
        unsigned PWM12PRH5              :1;
        unsigned PWM12PRH6              :1;
        unsigned PWM12PRH7              :1;
    };
    struct {
        unsigned PWM12PRH               :8;
    };
} PWM12PRHbits_t;
extern volatile PWM12PRHbits_t PWM12PRHbits __at(0xDC6);
// bitfield macros
#define _PWM12PRH_PR_POSN                                   0x0
#define _PWM12PRH_PR_POSITION                               0x0
#define _PWM12PRH_PR_SIZE                                   0x8
#define _PWM12PRH_PR_LENGTH                                 0x8
#define _PWM12PRH_PR_MASK                                   0xFF
#define _PWM12PRH_PWM12PRH0_POSN                            0x0
#define _PWM12PRH_PWM12PRH0_POSITION                        0x0
#define _PWM12PRH_PWM12PRH0_SIZE                            0x1
#define _PWM12PRH_PWM12PRH0_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH0_MASK                            0x1
#define _PWM12PRH_PWM12PRH1_POSN                            0x1
#define _PWM12PRH_PWM12PRH1_POSITION                        0x1
#define _PWM12PRH_PWM12PRH1_SIZE                            0x1
#define _PWM12PRH_PWM12PRH1_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH1_MASK                            0x2
#define _PWM12PRH_PWM12PRH2_POSN                            0x2
#define _PWM12PRH_PWM12PRH2_POSITION                        0x2
#define _PWM12PRH_PWM12PRH2_SIZE                            0x1
#define _PWM12PRH_PWM12PRH2_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH2_MASK                            0x4
#define _PWM12PRH_PWM12PRH3_POSN                            0x3
#define _PWM12PRH_PWM12PRH3_POSITION                        0x3
#define _PWM12PRH_PWM12PRH3_SIZE                            0x1
#define _PWM12PRH_PWM12PRH3_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH3_MASK                            0x8
#define _PWM12PRH_PWM12PRH4_POSN                            0x4
#define _PWM12PRH_PWM12PRH4_POSITION                        0x4
#define _PWM12PRH_PWM12PRH4_SIZE                            0x1
#define _PWM12PRH_PWM12PRH4_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH4_MASK                            0x10
#define _PWM12PRH_PWM12PRH5_POSN                            0x5
#define _PWM12PRH_PWM12PRH5_POSITION                        0x5
#define _PWM12PRH_PWM12PRH5_SIZE                            0x1
#define _PWM12PRH_PWM12PRH5_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH5_MASK                            0x20
#define _PWM12PRH_PWM12PRH6_POSN                            0x6
#define _PWM12PRH_PWM12PRH6_POSITION                        0x6
#define _PWM12PRH_PWM12PRH6_SIZE                            0x1
#define _PWM12PRH_PWM12PRH6_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH6_MASK                            0x40
#define _PWM12PRH_PWM12PRH7_POSN                            0x7
#define _PWM12PRH_PWM12PRH7_POSITION                        0x7
#define _PWM12PRH_PWM12PRH7_SIZE                            0x1
#define _PWM12PRH_PWM12PRH7_LENGTH                          0x1
#define _PWM12PRH_PWM12PRH7_MASK                            0x80
#define _PWM12PRH_PWM12PRH_POSN                             0x0
#define _PWM12PRH_PWM12PRH_POSITION                         0x0
#define _PWM12PRH_PWM12PRH_SIZE                             0x8
#define _PWM12PRH_PWM12PRH_LENGTH                           0x8
#define _PWM12PRH_PWM12PRH_MASK                             0xFF

// Register: PWM12OF
#define PWM12OF PWM12OF
extern volatile unsigned short          PWM12OF             __at(0xDC7);
#ifndef _LIB_BUILD
asm("PWM12OF equ 0DC7h");
#endif

