MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
extern volatile PWM12CONbits_t PWM12CONbits __at(0xDCB);
// bitfield macros
#define _PWM12CON_MODE_POSN                                 0x2
#define _PWM12CON_MODE_POSITION                             0x2
#define _PWM12CON_MODE_SIZE                                 0x2
#define _PWM12CON_MODE_LENGTH                               0x2
#define _PWM12CON_MODE_MASK                                 0xC
#define _PWM12CON_POL_POSN                                  0x4
#define _PWM12CON_POL_POSITION                              0x4
#define _PWM12CON_POL_SIZE                                  0x1
#define _PWM12CON_POL_LENGTH                                0x1
#define _PWM12CON_POL_MASK                                  0x10
#define _PWM12CON_OUT_POSN                                  0x5
#define _PWM12CON_OUT_POSITION                              0x5
#define _PWM12CON_OUT_SIZE                                  0x1
#define _PWM12CON_OUT_LENGTH                                0x1
#define _PWM12CON_OUT_MASK                                  0x20
#define _PWM12CON_EN_POSN                                   0x7
#define _PWM12CON_EN_POSITION                               0x7
#define _PWM12CON_EN_SIZE                                   0x1
#define _PWM12CON_EN_LENGTH                                 0x1
#define _PWM12CON_EN_MASK                                   0x80
#define _PWM12CON_PWM12MODE0_POSN                           0x2
#define _PWM12CON_PWM12MODE0_POSITION                       0x2
#define _PWM12CON_PWM12MODE0_SIZE                           0x1
#define _PWM12CON_PWM12MODE0_LENGTH                         0x1
#define _PWM12CON_PWM12MODE0_MASK                           0x4
#define _PWM12CON_PWM12MODE1_POSN                           0x3
#define _PWM12CON_PWM12MODE1_POSITION                       0x3
#define _PWM12CON_PWM12MODE1_SIZE                           0x1
#define _PWM12CON_PWM12MODE1_LENGTH                         0x1
#define _PWM12CON_PWM12MODE1_MASK                           0x8
#define _PWM12CON_PWM12MODE_POSN                            0x2
#define _PWM12CON_PWM12MODE_POSITION                        0x2
#define _PWM12CON_PWM12MODE_SIZE                            0x2
#define _PWM12CON_PWM12MODE_LENGTH                          0x2
#define _PWM12CON_PWM12MODE_MASK                            0xC
#define _PWM12CON_PWM12POL_POSN                             0x4
#define _PWM12CON_PWM12POL_POSITION                         0x4
#define _PWM12CON_PWM12POL_SIZE                             0x1
#define _PWM12CON_PWM12POL_LENGTH                           0x1
#define _PWM12CON_PWM12POL_MASK                             0x10
#define _PWM12CON_PWM12OUT_POSN                             0x5
#define _PWM12CON_PWM12OUT_POSITION                         0x5
#define _PWM12CON_PWM12OUT_SIZE                             0x1
#define _PWM12CON_PWM12OUT_LENGTH                           0x1
#define _PWM12CON_PWM12OUT_MASK                             0x20
#define _PWM12CON_PWM12EN_POSN                              0x7
#define _PWM12CON_PWM12EN_POSITION                          0x7
#define _PWM12CON_PWM12EN_SIZE                              0x1
#define _PWM12CON_PWM12EN_LENGTH                            0x1
#define _PWM12CON_PWM12EN_MASK                              0x80
#define _PWM12CON_MODE0_POSN                                0x2
#define _PWM12CON_MODE0_POSITION                            0x2
#define _PWM12CON_MODE0_SIZE                                0x1
#define _PWM12CON_MODE0_LENGTH                              0x1
#define _PWM12CON_MODE0_MASK                                0x4
#define _PWM12CON_MODE1_POSN                                0x3
#define _PWM12CON_MODE1_POSITION                            0x3
#define _PWM12CON_MODE1_SIZE                                0x1
#define _PWM12CON_MODE1_LENGTH                              0x1
#define _PWM12CON_MODE1_MASK                                0x8

// Register: PWM12INTE
#define PWM12INTE PWM12INTE
extern volatile unsigned char           PWM12INTE           __at(0xDCC);
#ifndef _LIB_BUILD
asm("PWM12INTE equ 0DCCh");
#endif
// aliases
extern volatile unsigned char           PWM12INTCON         __at(0xDCC);
#ifndef _LIB_BUILD
asm("PWM12INTCON equ 0DCCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM12PRIE              :1;
        unsigned PWM12DCIE              :1;
        unsigned PWM12PHIE              :1;
        unsigned PWM12OFIE              :1;
    };
} PWM12INTEbits_t;
extern volatile PWM12INTEbits_t PWM12INTEbits __at(0xDCC);
// bitfield macros
#define _PWM12INTE_PRIE_POSN                                0x0
#define _PWM12INTE_PRIE_POSITION                            0x0
#define _PWM12INTE_PRIE_SIZE                                0x1
#define _PWM12INTE_PRIE_LENGTH                              0x1
#define _PWM12INTE_PRIE_MASK                                0x1
#define _PWM12INTE_DCIE_POSN                                0x1
#define _PWM12INTE_DCIE_POSITION                            0x1
#define _PWM12INTE_DCIE_SIZE                                0x1
#define _PWM12INTE_DCIE_LENGTH                              0x1
#define _PWM12INTE_DCIE_MASK                                0x2
#define _PWM12INTE_PHIE_POSN                                0x2
#define _PWM12INTE_PHIE_POSITION                            0x2
#define _PWM12INTE_PHIE_SIZE                                0x1
#define _PWM12INTE_PHIE_LENGTH                              0x1
#define _PWM12INTE_PHIE_MASK                                0x4
#define _PWM12INTE_OFIE_POSN                                0x3
#define _PWM12INTE_OFIE_POSITION                            0x3
#define _PWM12INTE_OFIE_SIZE                                0x1
#define _PWM12INTE_OFIE_LENGTH                              0x1
#define _PWM12INTE_OFIE_MASK                                0x8
#define _PWM12INTE_PWM12PRIE_POSN                           0x0
#define _PWM12INTE_PWM12PRIE_POSITION                       0x0
#define _PWM12INTE_PWM12PRIE_SIZE                           0x1
#define _PWM12INTE_PWM12PRIE_LENGTH                         0x1
#define _PWM12INTE_PWM12PRIE_MASK                           0x1
#define _PWM12INTE_PWM12DCIE_POSN                           0x1
#define _PWM12INTE_PWM12DCIE_POSITION                       0x1
#define _PWM12INTE_PWM12DCIE_SIZE                           0x1
#define _PWM12INTE_PWM12DCIE_LENGTH                         0x1
#define _PWM12INTE_PWM12DCIE_MASK                           0x2
#define _PWM12INTE_PWM12PHIE_POSN                           0x2
#define _PWM12INTE_PWM12PHIE_POSITION                       0x2
#define _PWM12INTE_PWM12PHIE_SIZE                           0x1
#define _PWM12INTE_PWM12PHIE_LENGTH                         0x1
#define _PWM12INTE_PWM12PHIE_MASK                           0x4
#define _PWM12INTE_PWM12OFIE_POSN                           0x3
#define _PWM12INTE_PWM12OFIE_POSITION                       0x3
#define _PWM12INTE_PWM12OFIE_SIZE                           0x1
#define _PWM12INTE_PWM12OFIE_LENGTH                         0x1
#define _PWM12INTE_PWM12OFIE_MASK                           0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM12PRIE              :1;
        unsigned PWM12DCIE              :1;
        unsigned PWM12PHIE              :1;
        unsigned PWM12OFIE              :1;
    };
} PWM12INTCONbits_t;
extern volatile PWM12INTCONbits_t PWM12INTCONbits __at(0xDCC);
// bitfield macros
#define _PWM12INTCON_PRIE_POSN                              0x0
#define _PWM12INTCON_PRIE_POSITION                          0x0
#define _PWM12INTCON_PRIE_SIZE                              0x1
#define _PWM12INTCON_PRIE_LENGTH                            0x1
#define _PWM12INTCON_PRIE_MASK                              0x1
#define _PWM12INTCON_DCIE_POSN                              0x1
#define _PWM12INTCON_DCIE_POSITION                          0x1
#define _PWM12INTCON_DCIE_SIZE                              0x1
#define _PWM12INTCON_DCIE_LENGTH                            0x1
#define _PWM12INTCON_DCIE_MASK                              0x2
#define _PWM12INTCON_PHIE_POSN                              0x2
#define _PWM12INTCON_PHIE_POSITION                          0x2
#define _PWM12INTCON_PHIE_SIZE                              0x1
#define _PWM12INTCON_PHIE_LENGTH                            0x1
#define _PWM12INTCON_PHIE_MASK                              0x4
#define _PWM12INTCON_OFIE_POSN                              0x3
#define _PWM12INTCON_OFIE_POSITION                          0x3
#define _PWM12INTCON_OFIE_SIZE                              0x1
#define _PWM12INTCON_OFIE_LENGTH                            0x1
#define _PWM12INTCON_OFIE_MASK                              0x8
#define _PWM12INTCON_PWM12PRIE_POSN                         0x0
#define _PWM12INTCON_PWM12PRIE_POSITION                     0x0
#define _PWM12INTCON_PWM12PRIE_SIZE                         0x1
#define _PWM12INTCON_PWM12PRIE_LENGTH                       0x1
#define _PWM12INTCON_PWM12PRIE_MASK                         0x1
#define _PWM12INTCON_PWM12DCIE_POSN                         0x1
#define _PWM12INTCON_PWM12DCIE_POSITION                     0x1
#define _PWM12INTCON_PWM12DCIE_SIZE                         0x1
#define _PWM12INTCON_PWM12DCIE_LENGTH                       0x1
#define _PWM12INTCON_PWM12DCIE_MASK                         0x2
#define _PWM12INTCON_PWM12PHIE_POSN                         0x2
#define _PWM12INTCON_PWM12PHIE_POSITION                     0x2
#define _PWM12INTCON_PWM12PHIE_SIZE                         0x1
#define _PWM12INTCON_PWM12PHIE_LENGTH                       0x1
#define _PWM12INTCON_PWM12PHIE_MASK                         0x4
#define _PWM12INTCON_PWM12OFIE_POSN                         0x3
#define _PWM12INTCON_PWM12OFIE_POSITION                     0x3
#define _PWM12INTCON_PWM12OFIE_SIZE                         0x1
#define _PWM12INTCON_PWM12OFIE_LENGTH                       0x1
#define _PWM12INTCON_PWM12OFIE_MASK                         0x8

// Register: PWM12INTF
#define PWM12INTF PWM12INTF
extern volatile unsigned char           PWM12INTF           __at(0xDCD);
#ifndef _LIB_BUILD
asm("PWM12INTF equ 0DCDh");
#endif
// aliases
extern volatile unsigned char           PWM12INTFLG         __at(0xDCD);
#ifndef _LIB_BUILD
asm("PWM12INTFLG equ 0DCDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM12PRIF              :1;
        unsigned PWM12DCIF              :1;
        unsigned PWM12PHIF              :1;
        unsigned PWM12OFIF              :1;
    };
} PWM12INTFbits_t;
extern volatile PWM12INTFbits_t PWM12INTFbits __at(0xDCD);
// bitfield macros
#define _PWM12INTF_PRIF_POSN                                0x0
#define _PWM12INTF_PRIF_POSITION                            0x0
#define _PWM12INTF_PRIF_SIZE                                0x1
#define _PWM12INTF_PRIF_LENGTH                              0x1
#define _PWM12INTF_PRIF_MASK                                0x1
#define _PWM12INTF_DCIF_POSN                                0x1
#define _PWM12INTF_DCIF_POSITION                            0x1
#define _PWM12INTF_DCIF_SIZE                                0x1
#define _PWM12INTF_DCIF_LENGTH                              0x1
#define _PWM12INTF_DCIF_MASK                                0x2
#define _PWM12INTF_PHIF_POSN                                0x2
#define _PWM12INTF_PHIF_POSITION                            0x2
#define _PWM12INTF_PHIF_SIZE                                0x1
#define _PWM12INTF_PHIF_LENGTH                              0x1
#define _PWM12INTF_PHIF_MASK                                0x4
#define _PWM12INTF_OFIF_POSN                                0x3
#define _PWM12INTF_OFIF_POSITION                            0x3
#define _PWM12INTF_OFIF_SIZE                                0x1
#define _PWM12INTF_OFIF_LENGTH                              0x1
#define _PWM12INTF_OFIF_MASK                                0x8
#define _PWM12INTF_PWM12PRIF_POSN                           0x0
#define _PWM12INTF_PWM12PRIF_POSITION                       0x0
#define _PWM12INTF_PWM12PRIF_SIZE                           0x1
#define _PWM12INTF_PWM12PRIF_LENGTH                         0x1
#define _PWM12INTF_PWM12PRIF_MASK                           0x1
#define _PWM12INTF_PWM12DCIF_POSN                           0x1
#define _PWM12INTF_PWM12DCIF_POSITION                       0x1
#define _PWM12INTF_PWM12DCIF_SIZE                           0x1
#define _PWM12INTF_PWM12DCIF_LENGTH                         0x1
#define _PWM12INTF_PWM12DCIF_MASK                           0x2
#define _PWM12INTF_PWM12PHIF_POSN                           0x2
#define _PWM12INTF_PWM12PHIF_POSITION                       0x2
#define _PWM12INTF_PWM12PHIF_SIZE                           0x1
#define _PWM12INTF_PWM12PHIF_LENGTH                         0x1
#define _PWM12INTF_PWM12PHIF_MASK                           0x4
#define _PWM12INTF_PWM12OFIF_POSN                           0x3
#define _PWM12INTF_PWM12OFIF_POSITION                       0x3
#define _PWM12INTF_PWM12OFIF_SIZE                           0x1
#define _PWM12INTF_PWM12OFIF_LENGTH                         0x1
#define _PWM12INTF_PWM12OFIF_MASK                           0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM12PRIF              :1;
        unsigned PWM12DCIF              :1;
        unsigned PWM12PHIF              :1;
        unsigned PWM12OFIF              :1;
    };
} PWM12INTFLGbits_t;
extern volatile PWM12INTFLGbits_t PWM12INTFLGbits __at(0xDCD);
// bitfield macros
#define _PWM12INTFLG_PRIF_POSN                              0x0
#define _PWM12INTFLG_PRIF_POSITION                          0x0
#define _PWM12INTFLG_PRIF_SIZE                              0x1
#define _PWM12INTFLG_PRIF_LENGTH                            0x1
#define _PWM12INTFLG_PRIF_MASK                              0x1
#define _PWM12INTFLG_DCIF_POSN                              0x1
#define _PWM12INTFLG_DCIF_POSITION                          0x1
#define _PWM12INTFLG_DCIF_SIZE                              0x1
#define _PWM12INTFLG_DCIF_LENGTH                            0x1
#define _PWM12INTFLG_DCIF_MASK                              0x2
#define _PWM12INTFLG_PHIF_POSN                              0x2
#define _PWM12INTFLG_PHIF_POSITION                          0x2
#define _PWM12INTFLG_PHIF_SIZE                              0x1
#define _PWM12INTFLG_PHIF_LENGTH                            0x1
#define _PWM12INTFLG_PHIF_MASK                              0x4
#define _PWM12INTFLG_OFIF_POSN                              0x3
#define _PWM12INTFLG_OFIF_POSITION                          0x3
#define _PWM12INTFLG_OFIF_SIZE                              0x1
#define _PWM12INTFLG_OFIF_LENGTH                            0x1
#define _PWM12INTFLG_OFIF_MASK                              0x8
#define _PWM12INTFLG_PWM12PRIF_POSN                         0x0
#define _PWM12INTFLG_PWM12PRIF_POSITION                     0x0
#define _PWM12INTFLG_PWM12PRIF_SIZE                         0x1
#define _PWM12INTFLG_PWM12PRIF_LENGTH                       0x1
#define _PWM12INTFLG_PWM12PRIF_MASK                         0x1
#define _PWM12INTFLG_PWM12DCIF_POSN                         0x1
#define _PWM12INTFLG_PWM12DCIF_POSITION                     0x1
#define _PWM12INTFLG_PWM12DCIF_SIZE                         0x1
#define _PWM12INTFLG_PWM12DCIF_LENGTH                       0x1
#define _PWM12INTFLG_PWM12DCIF_MASK                         0x2
#define _PWM12INTFLG_PWM12PHIF_POSN                         0x2
#define _PWM12INTFLG_PWM12PHIF_POSITION                     0x2
#define _PWM12INTFLG_PWM12PHIF_SIZE                         0x1
#define _PWM12INTFLG_PWM12PHIF_LENGTH                       0x1
#define _PWM12INTFLG_PWM12PHIF_MASK                         0x4
#define _PWM12INTFLG_PWM12OFIF_POSN                         0x3
#define _PWM12INTFLG_PWM12OFIF_POSITION                     0x3
#define _PWM12INTFLG_PWM12OFIF_SIZE                         0x1
#define _PWM12INTFLG_PWM12OFIF_LENGTH                       0x1
#define _PWM12INTFLG_PWM12OFIF_MASK                         0x8

// Register: PWM12CLKCON
#define PWM12CLKCON PWM12CLKCON
extern volatile unsigned char           PWM12CLKCON         __at(0xDCE);
#ifndef _LIB_BUILD
asm("PWM12CLKCON equ 0DCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM12CS0               :1;
        unsigned PWM12CS1               :1;
        unsigned PWM12CS2               :1;
        unsigned                        :1;
        unsigned PWM12PS0               :1;
        unsigned PWM12PS1               :1;
        unsigned PWM12PS2               :1;
    };
    struct {
        unsigned PWM12CS                :3;
        unsigned                        :1;
        unsigned PWM12PS                :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned                        :1;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM12CLKCONbits_t;
extern volatile PWM12CLKCONbits_t PWM12CLKCONbits __at(0xDCE);
// bitfield macros
#define _PWM12CLKCON_CS_POSN                                0x0
#define _PWM12CLKCON_CS_POSITION                            0x0
#define _PWM12CLKCON_CS_SIZE                                0x2
#define _PWM12CLKCON_CS_LENGTH                              0x2
#define _PWM12CLKCON_CS_MASK                                0x3
#define _PWM12CLKCON_PS_POSN                                0x4
#define _PWM12CLKCON_PS_POSITION                            0x4
#define _PWM12CLKCON_PS_SIZE                                0x3
#define _PWM12CLKCON_PS_LENGTH                              0x3
#define _PWM12CLKCON_PS_MASK                                0x70
#define _PWM12CLKCON_PWM12CS0_POSN                          0x0
#define _PWM12CLKCON_PWM12CS0_POSITION                      0x0
#define _PWM12CLKCON_PWM12CS0_SIZE                          0x1
#define _PWM12CLKCON_PWM12CS0_LENGTH                        0x1
#define _PWM12CLKCON_PWM12CS0_MASK                          0x1
#define _PWM12CLKCON_PWM12CS1_POSN                          0x1
#define _PWM12CLKCON_PWM12CS1_POSITION                      0x1
#define _PWM12CLKCON_PWM12CS1_SIZE                          0x1
#define _PWM12CLKCON_PWM12CS1_LENGTH                        0x1
#define _PWM12CLKCON_PWM12CS1_MASK                          0x2
#define _PWM12CLKCON_PWM12CS2_POSN                          0x2
#define _PWM12CLKCON_PWM12CS2_POSITION                      0x2
#define _PWM12CLKCON_PWM12CS2_SIZE                          0x1
#define _PWM12CLKCON_PWM12CS2_LENGTH                        0x1
#define _PWM12CLKCON_PWM12CS2_MASK                          0x4
#define _PWM12CLKCON_PWM12PS0_POSN                          0x4
#define _PWM12CLKCON_PWM12PS0_POSITION                      0x4
#define _PWM12CLKCON_PWM12PS0_SIZE                          0x1
#define _PWM12CLKCON_PWM12PS0_LENGTH                        0x1
#define _PWM12CLKCON_PWM12PS0_MASK                          0x10
#define _PWM12CLKCON_PWM12PS1_POSN                          0x5
#define _PWM12CLKCON_PWM12PS1_POSITION                      0x5
#define _PWM12CLKCON_PWM12PS1_SIZE                          0x1
#define _PWM12CLKCON_PWM12PS1_LENGTH                        0x1
#define _PWM12CLKCON_PWM12PS1_MASK                          0x20
#define _PWM12CLKCON_PWM12PS2_POSN                          0x6
#define _PWM12CLKCON_PWM12PS2_POSITION                      0x6
#define _PWM12CLKCON_PWM12PS2_SIZE                          0x1
#define _PWM12CLKCON_PWM12PS2_LENGTH                        0x1
#define _PWM12CLKCON_PWM12PS2_MASK                          0x40
#define _PWM12CLKCON_PWM12CS_POSN                           0x0
#define _PWM12CLKCON_PWM12CS_POSITION                       0x0
#define _PWM12CLKCON_PWM12CS_SIZE                           0x3
#define _PWM12CLKCON_PWM12CS_LENGTH                         0x3
#define _PWM12CLKCON_PWM12CS_MASK                           0x7
#define _PWM12CLKCON_PWM12PS_POSN                           0x4
#define _PWM12CLKCON_PWM12PS_POSITION                       0x4
#define _PWM12CLKCON_PWM12PS_SIZE                           0x3
#define _PWM12CLKCON_PWM12PS_LENGTH                         0x3
#define _PWM12CLKCON_PWM12PS_MASK                           0x70
#define _PWM12CLKCON_CS0_POSN                               0x0
#define _PWM12CLKCON_CS0_POSITION                           0x0
#define _PWM12CLKCON_CS0_SIZE                               0x1
#define _PWM12CLKCON_CS0_LENGTH                             0x1
#define _PWM12CLKCON_CS0_MASK                               0x1
#define _PWM12CLKCON_CS1_POSN                               0x1
#define _PWM12CLKCON_CS1_POSITION                           0x1
#define _PWM12CLKCON_CS1_SIZE                               0x1
#define _PWM12CLKCON_CS1_LENGTH                             0x1
#define _PWM12CLKCON_CS1_MASK                               0x2
#define _PWM12CLKCON_CS2_POSN                               0x2
#define _PWM12CLKCON_CS2_POSITION                           0x2
#define _PWM12CLKCON_CS2_SIZE                               0x1
#define _PWM12CLKCON_CS2_LENGTH                             0x1
#define _PWM12CLKCON_CS2_MASK                               0x4
#define _PWM12CLKCON_PS0_POSN                               0x4
#define _PWM12CLKCON_PS0_POSITION                           0x4
#define _PWM12CLKCON_PS0_SIZE                               0x1
#define _PWM12CLKCON_PS0_LENGTH                             0x1
#define _PWM12CLKCON_PS0_MASK                               0x10
#define _PWM12CLKCON_PS1_POSN                               0x5
#define _PWM12CLKCON_PS1_POSITION                           0x5
#define _PWM12CLKCON_PS1_SIZE                               0x1
#define _PWM12CLKCON_PS1_LENGTH                             0x1
#define _PWM12CLKCON_PS1_MASK                               0x20
#define _PWM12CLKCON_PS2_POSN                               0x6
#define _PWM12CLKCON_PS2_POSITION                           0x6
#define _PWM12CLKCON_PS2_SIZE                               0x1
#define _PWM12CLKCON_PS2_LENGTH                             0x1
#define _PWM12CLKCON_PS2_MASK                               0x40

