MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x14BB);	// @ (0x297 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP7CAP<CCP7CTS0>
extern volatile __bit                   CCP7CTS0            __at(0x14E0);	// @ (0x29C * 8 + 0)
#define                                 CCP7CTS0_bit        _BIT_ACCESS(CCP7CAP,0)
// CCP7CAP<CCP7CTS1>
extern volatile __bit                   CCP7CTS1            __at(0x14E1);	// @ (0x29C * 8 + 1)
#define                                 CCP7CTS1_bit        _BIT_ACCESS(CCP7CAP,1)
// CCP7CAP<CCP7CTS2>
extern volatile __bit                   CCP7CTS2            __at(0x14E2);	// @ (0x29C * 8 + 2)
#define                                 CCP7CTS2_bit        _BIT_ACCESS(CCP7CAP,2)
// CCP7CAP<CCP7CTS3>
extern volatile __bit                   CCP7CTS3            __at(0x14E3);	// @ (0x29C * 8 + 3)
#define                                 CCP7CTS3_bit        _BIT_ACCESS(CCP7CAP,3)
// CCP7CON<CCP7EN>
extern volatile __bit                   CCP7EN              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CCP7EN_bit          _BIT_ACCESS(CCP7CON,7)
// CCP7CON<CCP7FMT>
extern volatile __bit                   CCP7FMT             __at(0x14DC);	// @ (0x29B * 8 + 4)
#define                                 CCP7FMT_bit         _BIT_ACCESS(CCP7CON,4)
// PIE5<CCP7IE>
extern volatile __bit                   CCP7IE              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 CCP7IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CCP7IF>
extern volatile __bit                   CCP7IF              __at(0xAE);	// @ (0x15 * 8 + 6)
#define                                 CCP7IF_bit          _BIT_ACCESS(PIR5,6)
// CCP7CON<CCP7MODE0>
extern volatile __bit                   CCP7MODE0           __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 CCP7MODE0_bit       _BIT_ACCESS(CCP7CON,0)
// CCP7CON<CCP7MODE1>
extern volatile __bit                   CCP7MODE1           __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 CCP7MODE1_bit       _BIT_ACCESS(CCP7CON,1)
// CCP7CON<CCP7MODE2>
extern volatile __bit                   CCP7MODE2           __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 CCP7MODE2_bit       _BIT_ACCESS(CCP7CON,2)
// CCP7CON<CCP7MODE3>
extern volatile __bit                   CCP7MODE3           __at(0x14DB);	// @ (0x29B * 8 + 3)
#define                                 CCP7MODE3_bit       _BIT_ACCESS(CCP7CON,3)
// CCP7CON<CCP7OUT>
extern volatile __bit                   CCP7OUT             __at(0x14DD);	// @ (0x29B * 8 + 5)
#define                                 CCP7OUT_bit         _BIT_ACCESS(CCP7CON,5)
// CCP8CAP<CCP8CTS0>
extern volatile __bit                   CCP8CTS0            __at(0x18A0);	// @ (0x314 * 8 + 0)
#define                                 CCP8CTS0_bit        _BIT_ACCESS(CCP8CAP,0)
// CCP8CAP<CCP8CTS1>
extern volatile __bit                   CCP8CTS1            __at(0x18A1);	// @ (0x314 * 8 + 1)
#define                                 CCP8CTS1_bit        _BIT_ACCESS(CCP8CAP,1)
// CCP8CAP<CCP8CTS2>
extern volatile __bit                   CCP8CTS2            __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 CCP8CTS2_bit        _BIT_ACCESS(CCP8CAP,2)
// CCP8CAP<CCP8CTS3>
extern volatile __bit                   CCP8CTS3            __at(0x18A3);	// @ (0x314 * 8 + 3)
#define                                 CCP8CTS3_bit        _BIT_ACCESS(CCP8CAP,3)
// CCP8CON<CCP8EN>
extern volatile __bit                   CCP8EN              __at(0x189F);	// @ (0x313 * 8 + 7)
#define                                 CCP8EN_bit          _BIT_ACCESS(CCP8CON,7)
// CCP8CON<CCP8FMT>
extern volatile __bit                   CCP8FMT             __at(0x189C);	// @ (0x313 * 8 + 4)
#define                                 CCP8FMT_bit         _BIT_ACCESS(CCP8CON,4)
// PIE5<CCP8IE>
extern volatile __bit                   CCP8IE              __at(0x4AF);	// @ (0x95 * 8 + 7)
#define                                 CCP8IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<CCP8IF>
extern volatile __bit                   CCP8IF              __at(0xAF);	// @ (0x15 * 8 + 7)
#define                                 CCP8IF_bit          _BIT_ACCESS(PIR5,7)
// CCP8CON<CCP8MODE0>
extern volatile __bit                   CCP8MODE0           __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP8MODE0_bit       _BIT_ACCESS(CCP8CON,0)
// CCP8CON<CCP8MODE1>
extern volatile __bit                   CCP8MODE1           __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP8MODE1_bit       _BIT_ACCESS(CCP8CON,1)
// CCP8CON<CCP8MODE2>
extern volatile __bit                   CCP8MODE2           __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP8MODE2_bit       _BIT_ACCESS(CCP8CON,2)
// CCP8CON<CCP8MODE3>
extern volatile __bit                   CCP8MODE3           __at(0x189B);	// @ (0x313 * 8 + 3)
#define                                 CCP8MODE3_bit       _BIT_ACCESS(CCP8CON,3)
// CCP8CON<CCP8OUT>
extern volatile __bit                   CCP8OUT             __at(0x189D);	// @ (0x313 * 8 + 5)
#define                                 CCP8OUT_bit         _BIT_ACCESS(CCP8CON,5)
// PIE1<CCPIE>
extern volatile __bit                   CCPIE               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCPIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<CCPIF>
extern volatile __bit                   CCPIF               __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCPIF_bit           _BIT_ACCESS(PIR1,2)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,2)
// PIE3<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR3,3)
// PIR2<COG1IF>
extern volatile __bit                   COG1IF              __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR2,4)
// PIE3<COG2IE>
extern volatile __bit                   COG2IE              __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 COG2IE_bit          _BIT_ACCESS(PIE3,5)
// PIR3<COG2IF>
extern volatile __bit                   COG2IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 COG2IF_bit          _BIT_ACCESS(PIR3,5)
// PIE5<COG3IE>
extern volatile __bit                   COG3IE              __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 COG3IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<COG3IF>
extern volatile __bit                   COG3IF              __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 COG3IF_bit          _BIT_ACCESS(PIR5,4)
// PIE5<COG4IE>
extern volatile __bit                   COG4IE              __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 COG4IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<COG4IF>
extern volatile __bit                   COG4IF              __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 COG4IF_bit          _BIT_ACCESS(PIR5,5)
// PIE2<COGIE>
extern volatile __bit                   COGIE               __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 COGIE_bit           _BIT_ACCESS(PIE2,4)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x2C77);	// @ (0x58E * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1FM>
extern volatile __bit                   DAC1FM              __at(0x2C76);	// @ (0x58E * 8 + 6)
#define                                 DAC1FM_bit          _BIT_ACCESS(DAC1CON0,6)
// DACLD<DAC1LD>
extern volatile __bit                   DAC1LD              __at(0x2C68);	// @ (0x58D * 8 + 0)
#define                                 DAC1LD_bit          _BIT_ACCESS(DACLD,0)
// DAC1CON0<DAC1NSS0>
extern volatile __bit                   DAC1NSS0            __at(0x2C70);	// @ (0x58E * 8 + 0)
#define                                 DAC1NSS0_bit        _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1NSS1>
extern volatile __bit                   DAC1NSS1            __at(0x2C71);	// @ (0x58E * 8 + 1)
#define                                 DAC1NSS1_bit        _BIT_ACCESS(DAC1CON0,1)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x2C75);	// @ (0x58E * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x2C74);	// @ (0x58E * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x2C72);	// @ (0x58E * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x2C73);	// @ (0x58E * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1REFL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1R10>
extern volatile __bit                   DAC1R10             __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 DAC1R10_bit         _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1R11>
extern volatile __bit                   DAC1R11             __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 DAC1R11_bit         _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1R12>
extern volatile __bit                   DAC1R12             __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 DAC1R12_bit         _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1R13>
extern volatile __bit                   DAC1R13             __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 DAC1R13_bit         _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1R14>
extern volatile __bit                   DAC1R14             __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 DAC1R14_bit         _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1R15>
extern volatile __bit                   DAC1R15             __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 DAC1R15_bit         _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1R8>
extern volatile __bit                   DAC1R8              __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1R8_bit          _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1R9>
extern volatile __bit                   DAC1R9              __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 DAC1R9_bit          _BIT_ACCESS(DAC1REFH,1)
// DAC1REFL<DAC1REF0>
extern volatile __bit                   DAC1REF0            __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 DAC1REF0_bit        _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1REF1>
extern volatile __bit                   DAC1REF1            __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 DAC1REF1_bit        _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1REF10>
extern volatile __bit                   DAC1REF10           __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 DAC1REF10_bit       _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1REF11>
extern volatile __bit                   DAC1REF11           __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 DAC1REF11_bit       _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1REF12>
extern volatile __bit                   DAC1REF12           __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 DAC1REF12_bit       _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1REF13>
extern volatile __bit                   DAC1REF13           __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 DAC1REF13_bit       _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1REF14>
extern volatile __bit                   DAC1REF14           __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 DAC1REF14_bit       _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1REF15>
extern volatile __bit                   DAC1REF15           __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 DAC1REF15_bit       _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1REF2>
extern volatile __bit                   DAC1REF2            __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 DAC1REF2_bit        _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1REF3>
extern volatile __bit                   DAC1REF3            __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 DAC1REF3_bit        _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1REF4>
extern volatile __bit                   DAC1REF4            __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 DAC1REF4_bit        _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1REF5>
extern volatile __bit                   DAC1REF5            __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 DAC1REF5_bit        _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1REF6>
extern volatile __bit                   DAC1REF6            __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 DAC1REF6_bit        _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1REF7>
extern volatile __bit                   DAC1REF7            __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 DAC1REF7_bit        _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1REF8>
extern volatile __bit                   DAC1REF8            __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1REF8_bit        _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1REF9>
extern volatile __bit                   DAC1REF9            __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 DAC1REF9_bit        _BIT_ACCESS(DAC1REFH,1)
// DAC2CON0<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON0,7)
// DAC2CON0<DAC2FM>
extern volatile __bit                   DAC2FM              __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 DAC2FM_bit          _BIT_ACCESS(DAC2CON0,6)
// DACLD<DAC2LD>
extern volatile __bit                   DAC2LD              __at(0x2C69);	// @ (0x58D * 8 + 1)
#define                                 DAC2LD_bit          _BIT_ACCESS(DACLD,1)
// DAC2CON0<DAC2NSS0>
extern volatile __bit                   DAC2NSS0            __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 DAC2NSS0_bit        _BIT_ACCESS(DAC2CON0,0)
// DAC2CON0<DAC2NSS1>
extern volatile __bit                   DAC2NSS1            __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 DAC2NSS1_bit        _BIT_ACCESS(DAC2CON0,1)
// DAC2CON0<DAC2OE1>
extern volatile __bit                   DAC2OE1             __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DAC2OE1_bit         _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<DAC2OE2>
extern volatile __bit                   DAC2OE2             __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 DAC2OE2_bit         _BIT_ACCESS(DAC2CON0,4)
// DAC2CON0<DAC2PSS0>
extern volatile __bit                   DAC2PSS0            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 DAC2PSS0_bit        _BIT_ACCESS(DAC2CON0,2)
// DAC2CON0<DAC2PSS1>
extern volatile __bit                   DAC2PSS1            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 DAC2PSS1_bit        _BIT_ACCESS(DAC2CON0,3)
// DAC2REFL<DAC2R0>
extern volatile __bit                   DAC2R0              __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2R10>
extern volatile __bit                   DAC2R10             __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC2R10_bit         _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2R11>
extern volatile __bit                   DAC2R11             __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC2R11_bit         _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2R12>
extern volatile __bit                   DAC2R12             __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC2R12_bit         _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2R13>
extern volatile __bit                   DAC2R13             __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC2R13_bit         _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2R14>
extern volatile __bit                   DAC2R14             __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC2R14_bit         _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2R15>
extern volatile __bit                   DAC2R15             __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC2R15_bit         _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2R5>
extern volatile __bit                   DAC2R5              __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC2R5_bit          _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2R6>
extern volatile __bit                   DAC2R6              __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC2R6_bit          _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2R7>
extern volatile __bit                   DAC2R7              __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC2R7_bit          _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2R8>
extern volatile __bit                   DAC2R8              __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC2R8_bit          _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2R9>
extern volatile __bit                   DAC2R9              __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC2R9_bit          _BIT_ACCESS(DAC2REFH,1)
// DAC2REFL<DAC2REF0>
extern volatile __bit                   DAC2REF0            __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC2REF0_bit        _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2REF1>
extern volatile __bit                   DAC2REF1            __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC2REF1_bit        _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2REF10>
