MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
#define                                 PWM11PRL4_bit       _BIT_ACCESS(PWM11PRL,4)
// PWM11PRL<PWM11PRL5>
extern volatile __bit                   PWM11PRL5           __at(0x6DAD);	// @ (0xDB5 * 8 + 5)
#define                                 PWM11PRL5_bit       _BIT_ACCESS(PWM11PRL,5)
// PWM11PRL<PWM11PRL6>
extern volatile __bit                   PWM11PRL6           __at(0x6DAE);	// @ (0xDB5 * 8 + 6)
#define                                 PWM11PRL6_bit       _BIT_ACCESS(PWM11PRL,6)
// PWM11PRL<PWM11PRL7>
extern volatile __bit                   PWM11PRL7           __at(0x6DAF);	// @ (0xDB5 * 8 + 7)
#define                                 PWM11PRL7_bit       _BIT_ACCESS(PWM11PRL,7)
// PWM11CLKCON<PWM11PS0>
extern volatile __bit                   PWM11PS0            __at(0x6DF4);	// @ (0xDBE * 8 + 4)
#define                                 PWM11PS0_bit        _BIT_ACCESS(PWM11CLKCON,4)
// PWM11CLKCON<PWM11PS1>
extern volatile __bit                   PWM11PS1            __at(0x6DF5);	// @ (0xDBE * 8 + 5)
#define                                 PWM11PS1_bit        _BIT_ACCESS(PWM11CLKCON,5)
// PWM11CLKCON<PWM11PS2>
extern volatile __bit                   PWM11PS2            __at(0x6DF6);	// @ (0xDBE * 8 + 6)
#define                                 PWM11PS2_bit        _BIT_ACCESS(PWM11CLKCON,6)
// PWM11TMRH<PWM11TMRH0>
extern volatile __bit                   PWM11TMRH0          __at(0x6DD0);	// @ (0xDBA * 8 + 0)
#define                                 PWM11TMRH0_bit      _BIT_ACCESS(PWM11TMRH,0)
// PWM11TMRH<PWM11TMRH1>
extern volatile __bit                   PWM11TMRH1          __at(0x6DD1);	// @ (0xDBA * 8 + 1)
#define                                 PWM11TMRH1_bit      _BIT_ACCESS(PWM11TMRH,1)
// PWM11TMRH<PWM11TMRH2>
extern volatile __bit                   PWM11TMRH2          __at(0x6DD2);	// @ (0xDBA * 8 + 2)
#define                                 PWM11TMRH2_bit      _BIT_ACCESS(PWM11TMRH,2)
// PWM11TMRH<PWM11TMRH3>
extern volatile __bit                   PWM11TMRH3          __at(0x6DD3);	// @ (0xDBA * 8 + 3)
#define                                 PWM11TMRH3_bit      _BIT_ACCESS(PWM11TMRH,3)
// PWM11TMRH<PWM11TMRH4>
extern volatile __bit                   PWM11TMRH4          __at(0x6DD4);	// @ (0xDBA * 8 + 4)
#define                                 PWM11TMRH4_bit      _BIT_ACCESS(PWM11TMRH,4)
// PWM11TMRH<PWM11TMRH5>
extern volatile __bit                   PWM11TMRH5          __at(0x6DD5);	// @ (0xDBA * 8 + 5)
#define                                 PWM11TMRH5_bit      _BIT_ACCESS(PWM11TMRH,5)
// PWM11TMRH<PWM11TMRH6>
extern volatile __bit                   PWM11TMRH6          __at(0x6DD6);	// @ (0xDBA * 8 + 6)
#define                                 PWM11TMRH6_bit      _BIT_ACCESS(PWM11TMRH,6)
// PWM11TMRH<PWM11TMRH7>
extern volatile __bit                   PWM11TMRH7          __at(0x6DD7);	// @ (0xDBA * 8 + 7)
#define                                 PWM11TMRH7_bit      _BIT_ACCESS(PWM11TMRH,7)
// PWM11TMRL<PWM11TMRL0>
extern volatile __bit                   PWM11TMRL0          __at(0x6DC8);	// @ (0xDB9 * 8 + 0)
#define                                 PWM11TMRL0_bit      _BIT_ACCESS(PWM11TMRL,0)
// PWM11TMRL<PWM11TMRL1>
extern volatile __bit                   PWM11TMRL1          __at(0x6DC9);	// @ (0xDB9 * 8 + 1)
#define                                 PWM11TMRL1_bit      _BIT_ACCESS(PWM11TMRL,1)
// PWM11TMRL<PWM11TMRL2>
extern volatile __bit                   PWM11TMRL2          __at(0x6DCA);	// @ (0xDB9 * 8 + 2)
#define                                 PWM11TMRL2_bit      _BIT_ACCESS(PWM11TMRL,2)
// PWM11TMRL<PWM11TMRL3>
extern volatile __bit                   PWM11TMRL3          __at(0x6DCB);	// @ (0xDB9 * 8 + 3)
#define                                 PWM11TMRL3_bit      _BIT_ACCESS(PWM11TMRL,3)
// PWM11TMRL<PWM11TMRL4>
extern volatile __bit                   PWM11TMRL4          __at(0x6DCC);	// @ (0xDB9 * 8 + 4)
#define                                 PWM11TMRL4_bit      _BIT_ACCESS(PWM11TMRL,4)
// PWM11TMRL<PWM11TMRL5>
extern volatile __bit                   PWM11TMRL5          __at(0x6DCD);	// @ (0xDB9 * 8 + 5)
#define                                 PWM11TMRL5_bit      _BIT_ACCESS(PWM11TMRL,5)
// PWM11TMRL<PWM11TMRL6>
extern volatile __bit                   PWM11TMRL6          __at(0x6DCE);	// @ (0xDB9 * 8 + 6)
#define                                 PWM11TMRL6_bit      _BIT_ACCESS(PWM11TMRL,6)
// PWM11TMRL<PWM11TMRL7>
extern volatile __bit                   PWM11TMRL7          __at(0x6DCF);	// @ (0xDB9 * 8 + 7)
#define                                 PWM11TMRL7_bit      _BIT_ACCESS(PWM11TMRL,7)
// PWM12CLKCON<PWM12CS0>
extern volatile __bit                   PWM12CS0            __at(0x6E70);	// @ (0xDCE * 8 + 0)
#define                                 PWM12CS0_bit        _BIT_ACCESS(PWM12CLKCON,0)
// PWM12CLKCON<PWM12CS1>
extern volatile __bit                   PWM12CS1            __at(0x6E71);	// @ (0xDCE * 8 + 1)
#define                                 PWM12CS1_bit        _BIT_ACCESS(PWM12CLKCON,1)
// PWM12CLKCON<PWM12CS2>
extern volatile __bit                   PWM12CS2            __at(0x6E72);	// @ (0xDCE * 8 + 2)
#define                                 PWM12CS2_bit        _BIT_ACCESS(PWM12CLKCON,2)
// PWM12DCH<PWM12DCH0>
extern volatile __bit                   PWM12DCH0           __at(0x6E20);	// @ (0xDC4 * 8 + 0)
#define                                 PWM12DCH0_bit       _BIT_ACCESS(PWM12DCH,0)
// PWM12DCH<PWM12DCH1>
extern volatile __bit                   PWM12DCH1           __at(0x6E21);	// @ (0xDC4 * 8 + 1)
#define                                 PWM12DCH1_bit       _BIT_ACCESS(PWM12DCH,1)
// PWM12DCH<PWM12DCH2>
extern volatile __bit                   PWM12DCH2           __at(0x6E22);	// @ (0xDC4 * 8 + 2)
#define                                 PWM12DCH2_bit       _BIT_ACCESS(PWM12DCH,2)
// PWM12DCH<PWM12DCH3>
extern volatile __bit                   PWM12DCH3           __at(0x6E23);	// @ (0xDC4 * 8 + 3)
#define                                 PWM12DCH3_bit       _BIT_ACCESS(PWM12DCH,3)
// PWM12DCH<PWM12DCH4>
extern volatile __bit                   PWM12DCH4           __at(0x6E24);	// @ (0xDC4 * 8 + 4)
#define                                 PWM12DCH4_bit       _BIT_ACCESS(PWM12DCH,4)
// PWM12DCH<PWM12DCH5>
extern volatile __bit                   PWM12DCH5           __at(0x6E25);	// @ (0xDC4 * 8 + 5)
#define                                 PWM12DCH5_bit       _BIT_ACCESS(PWM12DCH,5)
// PWM12DCH<PWM12DCH6>
extern volatile __bit                   PWM12DCH6           __at(0x6E26);	// @ (0xDC4 * 8 + 6)
#define                                 PWM12DCH6_bit       _BIT_ACCESS(PWM12DCH,6)
// PWM12DCH<PWM12DCH7>
extern volatile __bit                   PWM12DCH7           __at(0x6E27);	// @ (0xDC4 * 8 + 7)
#define                                 PWM12DCH7_bit       _BIT_ACCESS(PWM12DCH,7)
// PWM12INTE<PWM12DCIE>
extern volatile __bit                   PWM12DCIE           __at(0x6E61);	// @ (0xDCC * 8 + 1)
#define                                 PWM12DCIE_bit       _BIT_ACCESS(PWM12INTE,1)
// PWM12INTF<PWM12DCIF>
extern volatile __bit                   PWM12DCIF           __at(0x6E69);	// @ (0xDCD * 8 + 1)
#define                                 PWM12DCIF_bit       _BIT_ACCESS(PWM12INTF,1)
// PWM12DCL<PWM12DCL0>
extern volatile __bit                   PWM12DCL0           __at(0x6E18);	// @ (0xDC3 * 8 + 0)
#define                                 PWM12DCL0_bit       _BIT_ACCESS(PWM12DCL,0)
// PWM12DCL<PWM12DCL1>
extern volatile __bit                   PWM12DCL1           __at(0x6E19);	// @ (0xDC3 * 8 + 1)
#define                                 PWM12DCL1_bit       _BIT_ACCESS(PWM12DCL,1)
// PWM12DCL<PWM12DCL2>
extern volatile __bit                   PWM12DCL2           __at(0x6E1A);	// @ (0xDC3 * 8 + 2)
#define                                 PWM12DCL2_bit       _BIT_ACCESS(PWM12DCL,2)
// PWM12DCL<PWM12DCL3>
extern volatile __bit                   PWM12DCL3           __at(0x6E1B);	// @ (0xDC3 * 8 + 3)
#define                                 PWM12DCL3_bit       _BIT_ACCESS(PWM12DCL,3)
// PWM12DCL<PWM12DCL4>
extern volatile __bit                   PWM12DCL4           __at(0x6E1C);	// @ (0xDC3 * 8 + 4)
#define                                 PWM12DCL4_bit       _BIT_ACCESS(PWM12DCL,4)
// PWM12DCL<PWM12DCL5>
extern volatile __bit                   PWM12DCL5           __at(0x6E1D);	// @ (0xDC3 * 8 + 5)
#define                                 PWM12DCL5_bit       _BIT_ACCESS(PWM12DCL,5)
// PWM12DCL<PWM12DCL6>
extern volatile __bit                   PWM12DCL6           __at(0x6E1E);	// @ (0xDC3 * 8 + 6)
#define                                 PWM12DCL6_bit       _BIT_ACCESS(PWM12DCL,6)
// PWM12DCL<PWM12DCL7>
extern volatile __bit                   PWM12DCL7           __at(0x6E1F);	// @ (0xDC3 * 8 + 7)
#define                                 PWM12DCL7_bit       _BIT_ACCESS(PWM12DCL,7)
// PWM12CON<PWM12EN>
extern volatile __bit                   PWM12EN             __at(0x6E5F);	// @ (0xDCB * 8 + 7)
#define                                 PWM12EN_bit         _BIT_ACCESS(PWM12CON,7)
// PIE6<PWM12IE>
extern volatile __bit                   PWM12IE             __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 PWM12IE_bit         _BIT_ACCESS(PIE6,3)
// PIR6<PWM12IF>
extern volatile __bit                   PWM12IF             __at(0xB3);	// @ (0x16 * 8 + 3)
#define                                 PWM12IF_bit         _BIT_ACCESS(PIR6,3)
// PWM12LDCON<PWM12LD>
extern volatile __bit                   PWM12LD             __at(0x6E7F);	// @ (0xDCF * 8 + 7)
#define                                 PWM12LD_bit         _BIT_ACCESS(PWM12LDCON,7)
// PWM12LDCON<PWM12LDM>
extern volatile __bit                   PWM12LDM            __at(0x6E7E);	// @ (0xDCF * 8 + 6)
#define                                 PWM12LDM_bit        _BIT_ACCESS(PWM12LDCON,6)
// PWM12LDCON<PWM12LDS0>
extern volatile __bit                   PWM12LDS0           __at(0x6E78);	// @ (0xDCF * 8 + 0)
#define                                 PWM12LDS0_bit       _BIT_ACCESS(PWM12LDCON,0)
// PWM12LDCON<PWM12LDS1>
extern volatile __bit                   PWM12LDS1           __at(0x6E79);	// @ (0xDCF * 8 + 1)
#define                                 PWM12LDS1_bit       _BIT_ACCESS(PWM12LDCON,1)
// PWM12CON<PWM12MODE0>
extern volatile __bit                   PWM12MODE0          __at(0x6E5A);	// @ (0xDCB * 8 + 2)
#define                                 PWM12MODE0_bit      _BIT_ACCESS(PWM12CON,2)
// PWM12CON<PWM12MODE1>
extern volatile __bit                   PWM12MODE1          __at(0x6E5B);	// @ (0xDCB * 8 + 3)
#define                                 PWM12MODE1_bit      _BIT_ACCESS(PWM12CON,3)
// PWM12OFH<PWM12OFH0>
extern volatile __bit                   PWM12OFH0           __at(0x6E40);	// @ (0xDC8 * 8 + 0)
#define                                 PWM12OFH0_bit       _BIT_ACCESS(PWM12OFH,0)
// PWM12OFH<PWM12OFH1>
extern volatile __bit                   PWM12OFH1           __at(0x6E41);	// @ (0xDC8 * 8 + 1)
#define                                 PWM12OFH1_bit       _BIT_ACCESS(PWM12OFH,1)
// PWM12OFH<PWM12OFH2>
extern volatile __bit                   PWM12OFH2           __at(0x6E42);	// @ (0xDC8 * 8 + 2)
#define                                 PWM12OFH2_bit       _BIT_ACCESS(PWM12OFH,2)
// PWM12OFH<PWM12OFH3>
extern volatile __bit                   PWM12OFH3           __at(0x6E43);	// @ (0xDC8 * 8 + 3)
#define                                 PWM12OFH3_bit       _BIT_ACCESS(PWM12OFH,3)
// PWM12OFH<PWM12OFH4>
extern volatile __bit                   PWM12OFH4           __at(0x6E44);	// @ (0xDC8 * 8 + 4)
#define                                 PWM12OFH4_bit       _BIT_ACCESS(PWM12OFH,4)
// PWM12OFH<PWM12OFH5>
extern volatile __bit                   PWM12OFH5           __at(0x6E45);	// @ (0xDC8 * 8 + 5)
#define                                 PWM12OFH5_bit       _BIT_ACCESS(PWM12OFH,5)
// PWM12OFH<PWM12OFH6>
extern volatile __bit                   PWM12OFH6           __at(0x6E46);	// @ (0xDC8 * 8 + 6)
#define                                 PWM12OFH6_bit       _BIT_ACCESS(PWM12OFH,6)
// PWM12OFH<PWM12OFH7>
extern volatile __bit                   PWM12OFH7           __at(0x6E47);	// @ (0xDC8 * 8 + 7)
#define                                 PWM12OFH7_bit       _BIT_ACCESS(PWM12OFH,7)
// PWM12INTE<PWM12OFIE>
extern volatile __bit                   PWM12OFIE           __at(0x6E63);	// @ (0xDCC * 8 + 3)
#define                                 PWM12OFIE_bit       _BIT_ACCESS(PWM12INTE,3)
// PWM12INTF<PWM12OFIF>
extern volatile __bit                   PWM12OFIF           __at(0x6E6B);	// @ (0xDCD * 8 + 3)
#define                                 PWM12OFIF_bit       _BIT_ACCESS(PWM12INTF,3)
// PWM12OFL<PWM12OFL0>
extern volatile __bit                   PWM12OFL0           __at(0x6E38);	// @ (0xDC7 * 8 + 0)
#define                                 PWM12OFL0_bit       _BIT_ACCESS(PWM12OFL,0)
// PWM12OFL<PWM12OFL1>
extern volatile __bit                   PWM12OFL1           __at(0x6E39);	// @ (0xDC7 * 8 + 1)
#define                                 PWM12OFL1_bit       _BIT_ACCESS(PWM12OFL,1)
// PWM12OFL<PWM12OFL2>
extern volatile __bit                   PWM12OFL2           __at(0x6E3A);	// @ (0xDC7 * 8 + 2)
#define                                 PWM12OFL2_bit       _BIT_ACCESS(PWM12OFL,2)
// PWM12OFL<PWM12OFL3>
extern volatile __bit                   PWM12OFL3           __at(0x6E3B);	// @ (0xDC7 * 8 + 3)
#define                                 PWM12OFL3_bit       _BIT_ACCESS(PWM12OFL,3)
// PWM12OFL<PWM12OFL4>
extern volatile __bit                   PWM12OFL4           __at(0x6E3C);	// @ (0xDC7 * 8 + 4)
#define                                 PWM12OFL4_bit       _BIT_ACCESS(PWM12OFL,4)
// PWM12OFL<PWM12OFL5>
extern volatile __bit                   PWM12OFL5           __at(0x6E3D);	// @ (0xDC7 * 8 + 5)
#define                                 PWM12OFL5_bit       _BIT_ACCESS(PWM12OFL,5)
// PWM12OFL<PWM12OFL6>
extern volatile __bit                   PWM12OFL6           __at(0x6E3E);	// @ (0xDC7 * 8 + 6)
#define                                 PWM12OFL6_bit       _BIT_ACCESS(PWM12OFL,6)
// PWM12OFL<PWM12OFL7>
extern volatile __bit                   PWM12OFL7           __at(0x6E3F);	// @ (0xDC7 * 8 + 7)
#define                                 PWM12OFL7_bit       _BIT_ACCESS(PWM12OFL,7)
// PWM12OFCON<PWM12OFM0>
extern volatile __bit                   PWM12OFM0           __at(0x6E85);	// @ (0xDD0 * 8 + 5)
#define                                 PWM12OFM0_bit       _BIT_ACCESS(PWM12OFCON,5)
// PWM12OFCON<PWM12OFM1>
extern volatile __bit                   PWM12OFM1           __at(0x6E86);	// @ (0xDD0 * 8 + 6)
#define                                 PWM12OFM1_bit       _BIT_ACCESS(PWM12OFCON,6)
// PWM12OFCON<PWM12OFMC>
extern volatile __bit                   PWM12OFMC           __at(0x6E84);	// @ (0xDD0 * 8 + 4)
#define                                 PWM12OFMC_bit       _BIT_ACCESS(PWM12OFCON,4)
// PWM12OFCON<PWM12OFS0>
extern volatile __bit                   PWM12OFS0           __at(0x6E80);	// @ (0xDD0 * 8 + 0)
#define                                 PWM12OFS0_bit       _BIT_ACCESS(PWM12OFCON,0)
// PWM12OFCON<PWM12OFS1>
extern volatile __bit                   PWM12OFS1           __at(0x6E81);	// @ (0xDD0 * 8 + 1)
#define                                 PWM12OFS1_bit       _BIT_ACCESS(PWM12OFCON,1)
// PWM12CON<PWM12OUT>
extern volatile __bit                   PWM12OUT            __at(0x6E5D);	// @ (0xDCB * 8 + 5)
#define                                 PWM12OUT_bit        _BIT_ACCESS(PWM12CON,5)
// PWM12PHH<PWM12PHH0>
extern volatile __bit                   PWM12PHH0           __at(0x6E10);	// @ (0xDC2 * 8 + 0)
#define                                 PWM12PHH0_bit       _BIT_ACCESS(PWM12PHH,0)
// PWM12PHH<PWM12PHH1>
extern volatile __bit                   PWM12PHH1           __at(0x6E11);	// @ (0xDC2 * 8 + 1)
#define                                 PWM12PHH1_bit       _BIT_ACCESS(PWM12PHH,1)
// PWM12PHH<PWM12PHH2>
extern volatile __bit                   PWM12PHH2           __at(0x6E12);	// @ (0xDC2 * 8 + 2)
#define                                 PWM12PHH2_bit       _BIT_ACCESS(PWM12PHH,2)
// PWM12PHH<PWM12PHH3>
extern volatile __bit                   PWM12PHH3           __at(0x6E13);	// @ (0xDC2 * 8 + 3)
#define                                 PWM12PHH3_bit       _BIT_ACCESS(PWM12PHH,3)
// PWM12PHH<PWM12PHH4>
extern volatile __bit                   PWM12PHH4           __at(0x6E14);	// @ (0xDC2 * 8 + 4)
#define                                 PWM12PHH4_bit       _BIT_ACCESS(PWM12PHH,4)
// PWM12PHH<PWM12PHH5>
extern volatile __bit                   PWM12PHH5           __at(0x6E15);	// @ (0xDC2 * 8 + 5)
#define                                 PWM12PHH5_bit       _BIT_ACCESS(PWM12PHH,5)
// PWM12PHH<PWM12PHH6>
extern volatile __bit                   PWM12PHH6           __at(0x6E16);	// @ (0xDC2 * 8 + 6)
#define                                 PWM12PHH6_bit       _BIT_ACCESS(PWM12PHH,6)
// PWM12PHH<PWM12PHH7>
extern volatile __bit                   PWM12PHH7           __at(0x6E17);	// @ (0xDC2 * 8 + 7)
#define                                 PWM12PHH7_bit       _BIT_ACCESS(PWM12PHH,7)
// PWM12INTE<PWM12PHIE>
extern volatile __bit                   PWM12PHIE           __at(0x6E62);	// @ (0xDCC * 8 + 2)
#define                                 PWM12PHIE_bit       _BIT_ACCESS(PWM12INTE,2)
// PWM12INTF<PWM12PHIF>
extern volatile __bit                   PWM12PHIF           __at(0x6E6A);	// @ (0xDCD * 8 + 2)
#define                                 PWM12PHIF_bit       _BIT_ACCESS(PWM12INTF,2)
// PWM12PHL<PWM12PHL0>
extern volatile __bit                   PWM12PHL0           __at(0x6E08);	// @ (0xDC1 * 8 + 0)
#define                                 PWM12PHL0_bit       _BIT_ACCESS(PWM12PHL,0)
// PWM12PHL<PWM12PHL1>
extern volatile __bit                   PWM12PHL1           __at(0x6E09);	// @ (0xDC1 * 8 + 1)
#define                                 PWM12PHL1_bit       _BIT_ACCESS(PWM12PHL,1)
// PWM12PHL<PWM12PHL2>
extern volatile __bit                   PWM12PHL2           __at(0x6E0A);	// @ (0xDC1 * 8 + 2)
#define                                 PWM12PHL2_bit       _BIT_ACCESS(PWM12PHL,2)
// PWM12PHL<PWM12PHL3>
extern volatile __bit                   PWM12PHL3           __at(0x6E0B);	// @ (0xDC1 * 8 + 3)
#define                                 PWM12PHL3_bit       _BIT_ACCESS(PWM12PHL,3)
// PWM12PHL<PWM12PHL4>
extern volatile __bit                   PWM12PHL4           __at(0x6E0C);	// @ (0xDC1 * 8 + 4)
#define                                 PWM12PHL4_bit       _BIT_ACCESS(PWM12PHL,4)
// PWM12PHL<PWM12PHL5>
extern volatile __bit                   PWM12PHL5           __at(0x6E0D);	// @ (0xDC1 * 8 + 5)
#define                                 PWM12PHL5_bit       _BIT_ACCESS(PWM12PHL,5)
// PWM12PHL<PWM12PHL6>
extern volatile __bit                   PWM12PHL6           __at(0x6E0E);	// @ (0xDC1 * 8 + 6)
#define                                 PWM12PHL6_bit       _BIT_ACCESS(PWM12PHL,6)
// PWM12PHL<PWM12PHL7>
extern volatile __bit                   PWM12PHL7           __at(0x6E0F);	// @ (0xDC1 * 8 + 7)
#define                                 PWM12PHL7_bit       _BIT_ACCESS(PWM12PHL,7)
// PWM12CON<PWM12POL>
extern volatile __bit                   PWM12POL            __at(0x6E5C);	// @ (0xDCB * 8 + 4)
#define                                 PWM12POL_bit        _BIT_ACCESS(PWM12CON,4)
// PWM12PRH<PWM12PRH0>
extern volatile __bit                   PWM12PRH0           __at(0x6E30);	// @ (0xDC6 * 8 + 0)
#define                                 PWM12PRH0_bit       _BIT_ACCESS(PWM12PRH,0)
// PWM12PRH<PWM12PRH1>
extern volatile __bit                   PWM12PRH1           __at(0x6E31);	// @ (0xDC6 * 8 + 1)
#define                                 PWM12PRH1_bit       _BIT_ACCESS(PWM12PRH,1)
// PWM12PRH<PWM12PRH2>
extern volatile __bit                   PWM12PRH2           __at(0x6E32);	// @ (0xDC6 * 8 + 2)
#define                                 PWM12PRH2_bit       _BIT_ACCESS(PWM12PRH,2)
// PWM12PRH<PWM12PRH3>
extern volatile __bit                   PWM12PRH3           __at(0x6E33);	// @ (0xDC6 * 8 + 3)
#define                                 PWM12PRH3_bit       _BIT_ACCESS(PWM12PRH,3)
// PWM12PRH<PWM12PRH4>
extern volatile __bit                   PWM12PRH4           __at(0x6E34);	// @ (0xDC6 * 8 + 4)
#define                                 PWM12PRH4_bit       _BIT_ACCESS(PWM12PRH,4)
// PWM12PRH<PWM12PRH5>
extern volatile __bit                   PWM12PRH5           __at(0x6E35);	// @ (0xDC6 * 8 + 5)
#define                                 PWM12PRH5_bit       _BIT_ACCESS(PWM12PRH,5)
// PWM12PRH<PWM12PRH6>
extern volatile __bit                   PWM12PRH6           __at(0x6E36);	// @ (0xDC6 * 8 + 6)
#define                                 PWM12PRH6_bit       _BIT_ACCESS(PWM12PRH,6)
// PWM12PRH<PWM12PRH7>
extern volatile __bit                   PWM12PRH7           __at(0x6E37);	// @ (0xDC6 * 8 + 7)
#define                                 PWM12PRH7_bit       _BIT_ACCESS(PWM12PRH,7)
// PWM12INTE<PWM12PRIE>
extern volatile __bit                   PWM12PRIE           __at(0x6E60);	// @ (0xDCC * 8 + 0)
#define                                 PWM12PRIE_bit       _BIT_ACCESS(PWM12INTE,0)
// PWM12INTF<PWM12PRIF>
extern volatile __bit                   PWM12PRIF           __at(0x6E68);	// @ (0xDCD * 8 + 0)
#define                                 PWM12PRIF_bit       _BIT_ACCESS(PWM12INTF,0)
// PWM12PRL<PWM12PRL0>
extern volatile __bit                   PWM12PRL0           __at(0x6E28);	// @ (0xDC5 * 8 + 0)
#define                                 PWM12PRL0_bit       _BIT_ACCESS(PWM12PRL,0)
// PWM12PRL<PWM12PRL1>
extern volatile __bit                   PWM12PRL1           __at(0x6E29);	// @ (0xDC5 * 8 + 1)
#define                                 PWM12PRL1_bit       _BIT_ACCESS(PWM12PRL,1)
// PWM12PRL<PWM12PRL2>
extern volatile __bit                   PWM12PRL2           __at(0x6E2A);	// @ (0xDC5 * 8 + 2)
#define                                 PWM12PRL2_bit       _BIT_ACCESS(PWM12PRL,2)
// PWM12PRL<PWM12PRL3>
extern volatile __bit                   PWM12PRL3           __at(0x6E2B);	// @ (0xDC5 * 8 + 3)
#define                                 PWM12PRL3_bit       _BIT_ACCESS(PWM12PRL,3)
// PWM12PRL<PWM12PRL4>
extern volatile __bit                   PWM12PRL4           __at(0x6E2C);	// @ (0xDC5 * 8 + 4)
#define                                 PWM12PRL4_bit       _BIT_ACCESS(PWM12PRL,4)
// PWM12PRL<PWM12PRL5>
extern volatile __bit                   PWM12PRL5           __at(0x6E2D);	// @ (0xDC5 * 8 + 5)
#define                                 PWM12PRL5_bit       _BIT_ACCESS(PWM12PRL,5)
// PWM12PRL<PWM12PRL6>
extern volatile __bit                   PWM12PRL6           __at(0x6E2E);	// @ (0xDC5 * 8 + 6)
#define                                 PWM12PRL6_bit       _BIT_ACCESS(PWM12PRL,6)
// PWM12PRL<PWM12PRL7>
extern volatile __bit                   PWM12PRL7           __at(0x6E2F);	// @ (0xDC5 * 8 + 7)
#define                                 PWM12PRL7_bit       _BIT_ACCESS(PWM12PRL,7)
// PWM12CLKCON<PWM12PS0>
extern volatile __bit                   PWM12PS0            __at(0x6E74);	// @ (0xDCE * 8 + 4)
#define                                 PWM12PS0_bit        _BIT_ACCESS(PWM12CLKCON,4)
// PWM12CLKCON<PWM12PS1>
extern volatile __bit                   PWM12PS1            __at(0x6E75);	// @ (0xDCE * 8 + 5)
#define                                 PWM12PS1_bit        _BIT_ACCESS(PWM12CLKCON,5)
// PWM12CLKCON<PWM12PS2>
extern volatile __bit                   PWM12PS2            __at(0x6E76);	// @ (0xDCE * 8 + 6)
#define                                 PWM12PS2_bit        _BIT_ACCESS(PWM12CLKCON,6)
// PWM12TMRH<PWM12TMRH0>
extern volatile __bit                   PWM12TMRH0          __at(0x6E50);	// @ (0xDCA * 8 + 0)
#define                                 PWM12TMRH0_bit      _BIT_ACCESS(PWM12TMRH,0)
// PWM12TMRH<PWM12TMRH1>
extern volatile __bit                   PWM12TMRH1          __at(0x6E51);	// @ (0xDCA * 8 + 1)
