MikroElektronika/core_packages/PIC/XC8/def/PIC16F1777/mcu.h
#define                                 PWM12TMRH1_bit      _BIT_ACCESS(PWM12TMRH,1)
// PWM12TMRH<PWM12TMRH2>
extern volatile __bit                   PWM12TMRH2          __at(0x6E52);	// @ (0xDCA * 8 + 2)
#define                                 PWM12TMRH2_bit      _BIT_ACCESS(PWM12TMRH,2)
// PWM12TMRH<PWM12TMRH3>
extern volatile __bit                   PWM12TMRH3          __at(0x6E53);	// @ (0xDCA * 8 + 3)
#define                                 PWM12TMRH3_bit      _BIT_ACCESS(PWM12TMRH,3)
// PWM12TMRH<PWM12TMRH4>
extern volatile __bit                   PWM12TMRH4          __at(0x6E54);	// @ (0xDCA * 8 + 4)
#define                                 PWM12TMRH4_bit      _BIT_ACCESS(PWM12TMRH,4)
// PWM12TMRH<PWM12TMRH5>
extern volatile __bit                   PWM12TMRH5          __at(0x6E55);	// @ (0xDCA * 8 + 5)
#define                                 PWM12TMRH5_bit      _BIT_ACCESS(PWM12TMRH,5)
// PWM12TMRH<PWM12TMRH6>
extern volatile __bit                   PWM12TMRH6          __at(0x6E56);	// @ (0xDCA * 8 + 6)
#define                                 PWM12TMRH6_bit      _BIT_ACCESS(PWM12TMRH,6)
// PWM12TMRH<PWM12TMRH7>
extern volatile __bit                   PWM12TMRH7          __at(0x6E57);	// @ (0xDCA * 8 + 7)
#define                                 PWM12TMRH7_bit      _BIT_ACCESS(PWM12TMRH,7)
// PWM12TMRL<PWM12TMRL0>
extern volatile __bit                   PWM12TMRL0          __at(0x6E48);	// @ (0xDC9 * 8 + 0)
#define                                 PWM12TMRL0_bit      _BIT_ACCESS(PWM12TMRL,0)
// PWM12TMRL<PWM12TMRL1>
extern volatile __bit                   PWM12TMRL1          __at(0x6E49);	// @ (0xDC9 * 8 + 1)
#define                                 PWM12TMRL1_bit      _BIT_ACCESS(PWM12TMRL,1)
// PWM12TMRL<PWM12TMRL2>
extern volatile __bit                   PWM12TMRL2          __at(0x6E4A);	// @ (0xDC9 * 8 + 2)
#define                                 PWM12TMRL2_bit      _BIT_ACCESS(PWM12TMRL,2)
// PWM12TMRL<PWM12TMRL3>
extern volatile __bit                   PWM12TMRL3          __at(0x6E4B);	// @ (0xDC9 * 8 + 3)
#define                                 PWM12TMRL3_bit      _BIT_ACCESS(PWM12TMRL,3)
// PWM12TMRL<PWM12TMRL4>
extern volatile __bit                   PWM12TMRL4          __at(0x6E4C);	// @ (0xDC9 * 8 + 4)
#define                                 PWM12TMRL4_bit      _BIT_ACCESS(PWM12TMRL,4)
// PWM12TMRL<PWM12TMRL5>
extern volatile __bit                   PWM12TMRL5          __at(0x6E4D);	// @ (0xDC9 * 8 + 5)
#define                                 PWM12TMRL5_bit      _BIT_ACCESS(PWM12TMRL,5)
// PWM12TMRL<PWM12TMRL6>
extern volatile __bit                   PWM12TMRL6          __at(0x6E4E);	// @ (0xDC9 * 8 + 6)
#define                                 PWM12TMRL6_bit      _BIT_ACCESS(PWM12TMRL,6)
// PWM12TMRL<PWM12TMRL7>
extern volatile __bit                   PWM12TMRL7          __at(0x6E4F);	// @ (0xDC9 * 8 + 7)
#define                                 PWM12TMRL7_bit      _BIT_ACCESS(PWM12TMRL,7)
// PWM3DCL<PWM3DC0>
extern volatile __bit                   PWM3DC0             __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 PWM3DC0_bit         _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DC1>
extern volatile __bit                   PWM3DC1             __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 PWM3DC1_bit         _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWM3DC2>
extern volatile __bit                   PWM3DC2             __at(0x30A8);	// @ (0x615 * 8 + 0)
#define                                 PWM3DC2_bit         _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DC3>
extern volatile __bit                   PWM3DC3             __at(0x30A9);	// @ (0x615 * 8 + 1)
#define                                 PWM3DC3_bit         _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DC4>
extern volatile __bit                   PWM3DC4             __at(0x30AA);	// @ (0x615 * 8 + 2)
#define                                 PWM3DC4_bit         _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DC5>
extern volatile __bit                   PWM3DC5             __at(0x30AB);	// @ (0x615 * 8 + 3)
#define                                 PWM3DC5_bit         _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DC6>
extern volatile __bit                   PWM3DC6             __at(0x30AC);	// @ (0x615 * 8 + 4)
#define                                 PWM3DC6_bit         _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DC7>
extern volatile __bit                   PWM3DC7             __at(0x30AD);	// @ (0x615 * 8 + 5)
#define                                 PWM3DC7_bit         _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DC8>
extern volatile __bit                   PWM3DC8             __at(0x30AE);	// @ (0x615 * 8 + 6)
#define                                 PWM3DC8_bit         _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DC9>
extern volatile __bit                   PWM3DC9             __at(0x30AF);	// @ (0x615 * 8 + 7)
#define                                 PWM3DC9_bit         _BIT_ACCESS(PWM3DCH,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x30B7);	// @ (0x616 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x30B5);	// @ (0x616 * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x30B4);	// @ (0x616 * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4DCL<PWM4DC0>
extern volatile __bit                   PWM4DC0             __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM4DC0_bit         _BIT_ACCESS(PWM4DCL,6)
// PWM4DCL<PWM4DC1>
extern volatile __bit                   PWM4DC1             __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM4DC1_bit         _BIT_ACCESS(PWM4DCL,7)
// PWM4DCH<PWM4DC2>
extern volatile __bit                   PWM4DC2             __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM4DC2_bit         _BIT_ACCESS(PWM4DCH,0)
// PWM4DCH<PWM4DC3>
extern volatile __bit                   PWM4DC3             __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM4DC3_bit         _BIT_ACCESS(PWM4DCH,1)
// PWM4DCH<PWM4DC4>
extern volatile __bit                   PWM4DC4             __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM4DC4_bit         _BIT_ACCESS(PWM4DCH,2)
// PWM4DCH<PWM4DC5>
extern volatile __bit                   PWM4DC5             __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM4DC5_bit         _BIT_ACCESS(PWM4DCH,3)
// PWM4DCH<PWM4DC6>
extern volatile __bit                   PWM4DC6             __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM4DC6_bit         _BIT_ACCESS(PWM4DCH,4)
// PWM4DCH<PWM4DC7>
extern volatile __bit                   PWM4DC7             __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM4DC7_bit         _BIT_ACCESS(PWM4DCH,5)
// PWM4DCH<PWM4DC8>
extern volatile __bit                   PWM4DC8             __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM4DC8_bit         _BIT_ACCESS(PWM4DCH,6)
// PWM4DCH<PWM4DC9>
extern volatile __bit                   PWM4DC9             __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM4DC9_bit         _BIT_ACCESS(PWM4DCH,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM5CLKCON<PWM5CS0>
extern volatile __bit                   PWM5CS0             __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 PWM5CS0_bit         _BIT_ACCESS(PWM5CLKCON,0)
// PWM5CLKCON<PWM5CS1>
extern volatile __bit                   PWM5CS1             __at(0x6CF1);	// @ (0xD9E * 8 + 1)
#define                                 PWM5CS1_bit         _BIT_ACCESS(PWM5CLKCON,1)
// PWM5CLKCON<PWM5CS2>
extern volatile __bit                   PWM5CS2             __at(0x6CF2);	// @ (0xD9E * 8 + 2)
#define                                 PWM5CS2_bit         _BIT_ACCESS(PWM5CLKCON,2)
// PWM5DCH<PWM5DCH0>
extern volatile __bit                   PWM5DCH0            __at(0x6CA0);	// @ (0xD94 * 8 + 0)
#define                                 PWM5DCH0_bit        _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DCH1>
extern volatile __bit                   PWM5DCH1            __at(0x6CA1);	// @ (0xD94 * 8 + 1)
#define                                 PWM5DCH1_bit        _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DCH2>
extern volatile __bit                   PWM5DCH2            __at(0x6CA2);	// @ (0xD94 * 8 + 2)
#define                                 PWM5DCH2_bit        _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DCH3>
extern volatile __bit                   PWM5DCH3            __at(0x6CA3);	// @ (0xD94 * 8 + 3)
#define                                 PWM5DCH3_bit        _BIT_ACCESS(PWM5DCH,3)
// PWM5DCH<PWM5DCH4>
extern volatile __bit                   PWM5DCH4            __at(0x6CA4);	// @ (0xD94 * 8 + 4)
#define                                 PWM5DCH4_bit        _BIT_ACCESS(PWM5DCH,4)
// PWM5DCH<PWM5DCH5>
extern volatile __bit                   PWM5DCH5            __at(0x6CA5);	// @ (0xD94 * 8 + 5)
#define                                 PWM5DCH5_bit        _BIT_ACCESS(PWM5DCH,5)
// PWM5DCH<PWM5DCH6>
extern volatile __bit                   PWM5DCH6            __at(0x6CA6);	// @ (0xD94 * 8 + 6)
#define                                 PWM5DCH6_bit        _BIT_ACCESS(PWM5DCH,6)
// PWM5DCH<PWM5DCH7>
extern volatile __bit                   PWM5DCH7            __at(0x6CA7);	// @ (0xD94 * 8 + 7)
#define                                 PWM5DCH7_bit        _BIT_ACCESS(PWM5DCH,7)
// PWM5INTE<PWM5DCIE>
extern volatile __bit                   PWM5DCIE            __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 PWM5DCIE_bit        _BIT_ACCESS(PWM5INTE,1)
// PWM5INTF<PWM5DCIF>
extern volatile __bit                   PWM5DCIF            __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 PWM5DCIF_bit        _BIT_ACCESS(PWM5INTF,1)
// PWM5DCL<PWM5DCL0>
extern volatile __bit                   PWM5DCL0            __at(0x6C98);	// @ (0xD93 * 8 + 0)
#define                                 PWM5DCL0_bit        _BIT_ACCESS(PWM5DCL,0)
// PWM5DCL<PWM5DCL1>
extern volatile __bit                   PWM5DCL1            __at(0x6C99);	// @ (0xD93 * 8 + 1)
#define                                 PWM5DCL1_bit        _BIT_ACCESS(PWM5DCL,1)
// PWM5DCL<PWM5DCL2>
extern volatile __bit                   PWM5DCL2            __at(0x6C9A);	// @ (0xD93 * 8 + 2)
#define                                 PWM5DCL2_bit        _BIT_ACCESS(PWM5DCL,2)
// PWM5DCL<PWM5DCL3>
extern volatile __bit                   PWM5DCL3            __at(0x6C9B);	// @ (0xD93 * 8 + 3)
#define                                 PWM5DCL3_bit        _BIT_ACCESS(PWM5DCL,3)
// PWM5DCL<PWM5DCL4>
extern volatile __bit                   PWM5DCL4            __at(0x6C9C);	// @ (0xD93 * 8 + 4)
#define                                 PWM5DCL4_bit        _BIT_ACCESS(PWM5DCL,4)
// PWM5DCL<PWM5DCL5>
extern volatile __bit                   PWM5DCL5            __at(0x6C9D);	// @ (0xD93 * 8 + 5)
#define                                 PWM5DCL5_bit        _BIT_ACCESS(PWM5DCL,5)
// PWM5DCL<PWM5DCL6>
extern volatile __bit                   PWM5DCL6            __at(0x6C9E);	// @ (0xD93 * 8 + 6)
#define                                 PWM5DCL6_bit        _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DCL7>
extern volatile __bit                   PWM5DCL7            __at(0x6C9F);	// @ (0xD93 * 8 + 7)
#define                                 PWM5DCL7_bit        _BIT_ACCESS(PWM5DCL,7)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x6CDF);	// @ (0xD9B * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PIE6<PWM5IE>
extern volatile __bit                   PWM5IE              __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 PWM5IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<PWM5IF>
extern volatile __bit                   PWM5IF              __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 PWM5IF_bit          _BIT_ACCESS(PIR6,0)
// PWM5LDCON<PWM5LD>
extern volatile __bit                   PWM5LD              __at(0x6CFF);	// @ (0xD9F * 8 + 7)
#define                                 PWM5LD_bit          _BIT_ACCESS(PWM5LDCON,7)
// PWM5LDCON<PWM5LDM>
extern volatile __bit                   PWM5LDM             __at(0x6CFE);	// @ (0xD9F * 8 + 6)
#define                                 PWM5LDM_bit         _BIT_ACCESS(PWM5LDCON,6)
// PWM5LDCON<PWM5LDS0>
extern volatile __bit                   PWM5LDS0            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 PWM5LDS0_bit        _BIT_ACCESS(PWM5LDCON,0)
// PWM5LDCON<PWM5LDS1>
extern volatile __bit                   PWM5LDS1            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 PWM5LDS1_bit        _BIT_ACCESS(PWM5LDCON,1)
// PWM5CON<PWM5MODE0>
extern volatile __bit                   PWM5MODE0           __at(0x6CDA);	// @ (0xD9B * 8 + 2)
#define                                 PWM5MODE0_bit       _BIT_ACCESS(PWM5CON,2)
// PWM5CON<PWM5MODE1>
extern volatile __bit                   PWM5MODE1           __at(0x6CDB);	// @ (0xD9B * 8 + 3)
#define                                 PWM5MODE1_bit       _BIT_ACCESS(PWM5CON,3)
// PWM5OFH<PWM5OFH0>
extern volatile __bit                   PWM5OFH0            __at(0x6CC0);	// @ (0xD98 * 8 + 0)
#define                                 PWM5OFH0_bit        _BIT_ACCESS(PWM5OFH,0)
// PWM5OFH<PWM5OFH1>
extern volatile __bit                   PWM5OFH1            __at(0x6CC1);	// @ (0xD98 * 8 + 1)
#define                                 PWM5OFH1_bit        _BIT_ACCESS(PWM5OFH,1)
// PWM5OFH<PWM5OFH2>
extern volatile __bit                   PWM5OFH2            __at(0x6CC2);	// @ (0xD98 * 8 + 2)
#define                                 PWM5OFH2_bit        _BIT_ACCESS(PWM5OFH,2)
// PWM5OFH<PWM5OFH3>
extern volatile __bit                   PWM5OFH3            __at(0x6CC3);	// @ (0xD98 * 8 + 3)
#define                                 PWM5OFH3_bit        _BIT_ACCESS(PWM5OFH,3)
// PWM5OFH<PWM5OFH4>
extern volatile __bit                   PWM5OFH4            __at(0x6CC4);	// @ (0xD98 * 8 + 4)
#define                                 PWM5OFH4_bit        _BIT_ACCESS(PWM5OFH,4)
// PWM5OFH<PWM5OFH5>
extern volatile __bit                   PWM5OFH5            __at(0x6CC5);	// @ (0xD98 * 8 + 5)
#define                                 PWM5OFH5_bit        _BIT_ACCESS(PWM5OFH,5)
// PWM5OFH<PWM5OFH6>
extern volatile __bit                   PWM5OFH6            __at(0x6CC6);	// @ (0xD98 * 8 + 6)
#define                                 PWM5OFH6_bit        _BIT_ACCESS(PWM5OFH,6)
// PWM5OFH<PWM5OFH7>
extern volatile __bit                   PWM5OFH7            __at(0x6CC7);	// @ (0xD98 * 8 + 7)
#define                                 PWM5OFH7_bit        _BIT_ACCESS(PWM5OFH,7)
// PWM5INTE<PWM5OFIE>
extern volatile __bit                   PWM5OFIE            __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 PWM5OFIE_bit        _BIT_ACCESS(PWM5INTE,3)
// PWM5INTF<PWM5OFIF>
extern volatile __bit                   PWM5OFIF            __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 PWM5OFIF_bit        _BIT_ACCESS(PWM5INTF,3)
// PWM5OFL<PWM5OFL0>
extern volatile __bit                   PWM5OFL0            __at(0x6CB8);	// @ (0xD97 * 8 + 0)
#define                                 PWM5OFL0_bit        _BIT_ACCESS(PWM5OFL,0)
// PWM5OFL<PWM5OFL1>
extern volatile __bit                   PWM5OFL1            __at(0x6CB9);	// @ (0xD97 * 8 + 1)
#define                                 PWM5OFL1_bit        _BIT_ACCESS(PWM5OFL,1)
// PWM5OFL<PWM5OFL2>
extern volatile __bit                   PWM5OFL2            __at(0x6CBA);	// @ (0xD97 * 8 + 2)
#define                                 PWM5OFL2_bit        _BIT_ACCESS(PWM5OFL,2)
// PWM5OFL<PWM5OFL3>
extern volatile __bit                   PWM5OFL3            __at(0x6CBB);	// @ (0xD97 * 8 + 3)
#define                                 PWM5OFL3_bit        _BIT_ACCESS(PWM5OFL,3)
// PWM5OFL<PWM5OFL4>
extern volatile __bit                   PWM5OFL4            __at(0x6CBC);	// @ (0xD97 * 8 + 4)
#define                                 PWM5OFL4_bit        _BIT_ACCESS(PWM5OFL,4)
// PWM5OFL<PWM5OFL5>
extern volatile __bit                   PWM5OFL5            __at(0x6CBD);	// @ (0xD97 * 8 + 5)
#define                                 PWM5OFL5_bit        _BIT_ACCESS(PWM5OFL,5)
// PWM5OFL<PWM5OFL6>
extern volatile __bit                   PWM5OFL6            __at(0x6CBE);	// @ (0xD97 * 8 + 6)
#define                                 PWM5OFL6_bit        _BIT_ACCESS(PWM5OFL,6)
// PWM5OFL<PWM5OFL7>
extern volatile __bit                   PWM5OFL7            __at(0x6CBF);	// @ (0xD97 * 8 + 7)
#define                                 PWM5OFL7_bit        _BIT_ACCESS(PWM5OFL,7)
// PWM5OFCON<PWM5OFM0>
extern volatile __bit                   PWM5OFM0            __at(0x6D05);	// @ (0xDA0 * 8 + 5)
#define                                 PWM5OFM0_bit        _BIT_ACCESS(PWM5OFCON,5)
// PWM5OFCON<PWM5OFM1>
extern volatile __bit                   PWM5OFM1            __at(0x6D06);	// @ (0xDA0 * 8 + 6)
#define                                 PWM5OFM1_bit        _BIT_ACCESS(PWM5OFCON,6)
// PWM5OFCON<PWM5OFMC>
extern volatile __bit                   PWM5OFMC            __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 PWM5OFMC_bit        _BIT_ACCESS(PWM5OFCON,4)
// PWM5OFCON<PWM5OFS0>
extern volatile __bit                   PWM5OFS0            __at(0x6D00);	// @ (0xDA0 * 8 + 0)
#define                                 PWM5OFS0_bit        _BIT_ACCESS(PWM5OFCON,0)
// PWM5OFCON<PWM5OFS1>
extern volatile __bit                   PWM5OFS1            __at(0x6D01);	// @ (0xDA0 * 8 + 1)
#define                                 PWM5OFS1_bit        _BIT_ACCESS(PWM5OFCON,1)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x6CDD);	// @ (0xD9B * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5PHH<PWM5PHH0>
extern volatile __bit                   PWM5PHH0            __at(0x6C90);	// @ (0xD92 * 8 + 0)
#define                                 PWM5PHH0_bit        _BIT_ACCESS(PWM5PHH,0)
// PWM5PHH<PWM5PHH1>
extern volatile __bit                   PWM5PHH1            __at(0x6C91);	// @ (0xD92 * 8 + 1)
#define                                 PWM5PHH1_bit        _BIT_ACCESS(PWM5PHH,1)
// PWM5PHH<PWM5PHH2>
extern volatile __bit                   PWM5PHH2            __at(0x6C92);	// @ (0xD92 * 8 + 2)
#define                                 PWM5PHH2_bit        _BIT_ACCESS(PWM5PHH,2)
// PWM5PHH<PWM5PHH3>
extern volatile __bit                   PWM5PHH3            __at(0x6C93);	// @ (0xD92 * 8 + 3)
#define                                 PWM5PHH3_bit        _BIT_ACCESS(PWM5PHH,3)
// PWM5PHH<PWM5PHH4>
extern volatile __bit                   PWM5PHH4            __at(0x6C94);	// @ (0xD92 * 8 + 4)
#define                                 PWM5PHH4_bit        _BIT_ACCESS(PWM5PHH,4)
// PWM5PHH<PWM5PHH5>
extern volatile __bit                   PWM5PHH5            __at(0x6C95);	// @ (0xD92 * 8 + 5)
#define                                 PWM5PHH5_bit        _BIT_ACCESS(PWM5PHH,5)
// PWM5PHH<PWM5PHH6>
extern volatile __bit                   PWM5PHH6            __at(0x6C96);	// @ (0xD92 * 8 + 6)
#define                                 PWM5PHH6_bit        _BIT_ACCESS(PWM5PHH,6)
// PWM5PHH<PWM5PHH7>
extern volatile __bit                   PWM5PHH7            __at(0x6C97);	// @ (0xD92 * 8 + 7)
#define                                 PWM5PHH7_bit        _BIT_ACCESS(PWM5PHH,7)
// PWM5INTE<PWM5PHIE>
extern volatile __bit                   PWM5PHIE            __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PWM5PHIE_bit        _BIT_ACCESS(PWM5INTE,2)
// PWM5INTF<PWM5PHIF>
extern volatile __bit                   PWM5PHIF            __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PWM5PHIF_bit        _BIT_ACCESS(PWM5INTF,2)
// PWM5PHL<PWM5PHL0>
extern volatile __bit                   PWM5PHL0            __at(0x6C88);	// @ (0xD91 * 8 + 0)
#define                                 PWM5PHL0_bit        _BIT_ACCESS(PWM5PHL,0)
// PWM5PHL<PWM5PHL1>
extern volatile __bit                   PWM5PHL1            __at(0x6C89);	// @ (0xD91 * 8 + 1)
#define                                 PWM5PHL1_bit        _BIT_ACCESS(PWM5PHL,1)
// PWM5PHL<PWM5PHL2>
extern volatile __bit                   PWM5PHL2            __at(0x6C8A);	// @ (0xD91 * 8 + 2)
#define                                 PWM5PHL2_bit        _BIT_ACCESS(PWM5PHL,2)
// PWM5PHL<PWM5PHL3>
extern volatile __bit                   PWM5PHL3            __at(0x6C8B);	// @ (0xD91 * 8 + 3)
#define                                 PWM5PHL3_bit        _BIT_ACCESS(PWM5PHL,3)
// PWM5PHL<PWM5PHL4>
extern volatile __bit                   PWM5PHL4            __at(0x6C8C);	// @ (0xD91 * 8 + 4)
#define                                 PWM5PHL4_bit        _BIT_ACCESS(PWM5PHL,4)
// PWM5PHL<PWM5PHL5>
extern volatile __bit                   PWM5PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM5PHL5_bit        _BIT_ACCESS(PWM5PHL,5)
// PWM5PHL<PWM5PHL6>
extern volatile __bit                   PWM5PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM5PHL6_bit        _BIT_ACCESS(PWM5PHL,6)
// PWM5PHL<PWM5PHL7>
extern volatile __bit                   PWM5PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM5PHL7_bit        _BIT_ACCESS(PWM5PHL,7)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// PWM5PRH<PWM5PRH0>
extern volatile __bit                   PWM5PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM5PRH0_bit        _BIT_ACCESS(PWM5PRH,0)
// PWM5PRH<PWM5PRH1>
extern volatile __bit                   PWM5PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM5PRH1_bit        _BIT_ACCESS(PWM5PRH,1)
// PWM5PRH<PWM5PRH2>
extern volatile __bit                   PWM5PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM5PRH2_bit        _BIT_ACCESS(PWM5PRH,2)
// PWM5PRH<PWM5PRH3>
extern volatile __bit                   PWM5PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM5PRH3_bit        _BIT_ACCESS(PWM5PRH,3)
// PWM5PRH<PWM5PRH4>
extern volatile __bit                   PWM5PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM5PRH4_bit        _BIT_ACCESS(PWM5PRH,4)
// PWM5PRH<PWM5PRH5>
extern volatile __bit                   PWM5PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM5PRH5_bit        _BIT_ACCESS(PWM5PRH,5)
// PWM5PRH<PWM5PRH6>
extern volatile __bit                   PWM5PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
